{
  "totalCount": 157,
  "data": [
    {
      "contentAdvisoryRating": "4+",
      "description": "SG Parl is an official app by the Parliament of Singapore. It is a one-stop information centre for you to find out more about your Member of Parliament and parliamentary proceedings.\n \nThe app contains, among others:\n (i) a database of the Members of Parliament listed alphabetically and by constituency, which also includes the venues and times for the weekly Meet-The-People Sessions,\n(ii) an interactive seating plan of the Chamber,\n(iii) items of business and order of business for upcoming parliament sittings,\n(iv) various publications including Bills, Standing Orders and reports and\n(v) a glossary of parliamentary terms.",
      "appName": "SG Parl",
      "releaseNotes": "- Updated bills introduced",
      "developerName": "Parliament of Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/sg-parl/id473177329?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-05-18T04:30:29Z",
      "userRatingCount": 14,
      "size": "21004288",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/parliament-of-singapore/id473177332?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "2.6.7",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.parliament.sgparl",
      "agencyFullName": "PARLIAMENT OF SINGAPORE"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "This is the Official Mobile App is for the Singapore Members of Parliament. This Mobile App will contains relevant materials and documents for the Parliament Sitting. MP can refer to the pre-sitting documents directly from the app at their own convenience. The Application will also send out any official notifications pertaining to the Sitting.",
      "appName": "SG MP Mobile Application",
      "releaseNotes": null,
      "developerName": "Parliament of Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/sg-mp-mobile-application/id1451896923?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-15T02:20:36Z",
      "userRatingCount": 0,
      "size": "67632128",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/parliament-of-singapore/id473177332?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.35",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.parliament.sg-parl-mp",
      "agencyFullName": "PARLIAMENT OF SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Welcome to the BALIKSG: Reflections of Singapore app presented by the National Heritage Board (NHB) and the National Parks Board (NPARKS) to commemorate the Singapore Bicentennial. \nHave you ever imagined how Singapore was like when Sir Stamford Raffles landed or been intrigued by the history and legends of Fort Canning Hill? \nBALIKSG promises an immersive experience for users, with mixed reality graphics that will transport you to a reimagined past dating back to the 14th century.\nEmbark on The River and The Fort Trail to watch history come alive at 16 augmented reality (AR) Discovery Points. Step through a portal and witness the signing of the 6 February, 1819 treaty which established Singapore as a British trading post, one of the most important events in our history. Interact with the beloved bronze sculptures along the Singapore River and listen to Singapore’s early settlers describe their lives. Drop in on an archaeological dig to uncover secrets about Fort Canning Hill’s past.        \n\nWHY GO ON THE BALIKSG TRAIL:\n•\tFREE: It’s completely free, and does not contain any in-app purchases. \n•\tACCESSIBLE: The trails are centrally located and conveniently accessible by public transportation.\n•\tHISTORICALLY ACCURATE: Storytelling is based on extensive research and endorsed by the National Heritage Board and National Parks Board.\n•\tEDUCATIONAL: Watch scenes from history textbooks come to life at the very location history was imprinted.\n•\tINTERACTIVE: Using the latest in AR technology, the app reproduces a creative interpretation of actual historical events at each touchpoint of the heritage trail, for a thoroughly immersive experience.   \n•\tCLOCK YOUR DAILY STEPS: Put on your walking shoes and go on a trail back in time!\n•\tMOMENTO: Collect all the jigsaw pieces at each AR discovery point as a memento.\n\nNOTES:\n•\tThe information provided in the BALIKSG mobile application is designed to provide helpful information on the history and heritage of Singapore through a creative interpretation of past events. While extensive research has been done to depict historical events and persons of interest as accurately as possible, certain characters in the app are fictitious. Any similarity to actual persons, living or dead, is purely coincidental.\n•\tTo fully experience the augmented reality features of the app, users are advised to use BALIKSG in the day, but avoiding the hottest hours between noon to 3pm. Please wear comfortable walking shoes, have an umbrella handy and stay hydrated!\n•\tFor a more realistic AR experience, use this app on iPhone SE, 6S, 6S Plus, 7, 7Plus and newer models, iPad (5th and 6th Generation), iPad Pro (1st Generation) and newer models, on iOS 11.0 or later.\n•\tFor a basic AR experience, use this app on iPhone 6 and newer models running iOS 10 or later. \n•\tUse BALIKSG while connected to a network to improve the accuracy of GPS. You can still use the app offline, but location information will be less accurate, and some functions may not be available.\n•\tUsers should enable location information on their devices in order to facilitate accurate way-finding. \n•\tData charges may apply.",
      "appName": "BALIKSG",
      "releaseNotes": "-Reduce app size.",
      "developerName": "National Heritage Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/baliksg/id1442201045?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-23T02:06:29Z",
      "userRatingCount": 17,
      "size": "583701504",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/national-heritage-board/id601295061?mt=8&uo=4",
      "averageUserRating": 4.5,
      "version": "1.2.1",
      "minimumOsVersion": "11.3",
      "bundleId": "gov.nhb.BalikSG",
      "agencyFullName": "NATIONAL HERITAGE BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Welcome to The Asian Civilisation Museum’s mobile experience. We developed this app to give visitors like you, an in depth look at the mysterious and wondrous art and culture collection at ACM. Bring your experience to life by engaging with informative audio, beautiful video and descriptive text about the museum and its collection, as well as free self-guided audio tours, and interactive exhibition maps to help you find your way.\n\nTake your first step into the amazing ACM journey by experiencing our collection highlights tour - a must for visitors short on time - or take your little ones on a dedicated children’s tour, featuring content crafted specially for our most inquisitive visitors.    \n\n“What’s On” provides information on upcoming museum-led events and programmes, guided tours, lectures, and festivals. “What to See” details the museum’s permanent galleries and special exhibitions, and offers object-level interpretation beyond traditional labels and wall texts.\n\nBe sure to download the Asian Civilisations Museum app before your next visit for a sneak preview of the journey that awaits you.",
      "appName": "Asian Civilisations Museum",
      "releaseNotes": "App fixes for iOS 10",
      "developerName": "National Heritage Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/asian-civilisations-museum/id1054235413?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-09-17T17:27:56Z",
      "userRatingCount": 0,
      "size": "48280576",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/national-heritage-board/id601295061?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.4",
      "minimumOsVersion": "8.0",
      "bundleId": "gov.nhb.acm",
      "agencyFullName": "NATIONAL HERITAGE BOARD"
    },
    {
      "contentAdvisoryRating": "9+",
      "description": "New OneMap is the authoritative national map of Singapore with the most detailed and timely updated information developed by the Singapore Land Authority. There are also many useful day-to-day information and services contributed by government agencies.\n \nFeatures of OneMap:\n \nSEARCH: Search for addresses with postal codes and building names.\n\nNAVIGATION: Get driving and public transport directions with walking routes.\n\nFIND NEARBY INFORMATION: Locate nearby amenities and government information.\n\nMAP STYLES: Select from a range of base maps.\n\nFREE TO USE: All maps and features are free to use. No in-app purchases.\n \nIf you have any questions or feedback, please drop us an email at onemap@sla.gov.sg\n\nFollow us on Facebook: https://www.facebook.com/OneMap",
      "appName": "OneMap SG",
      "releaseNotes": "- Critical bug fix.",
      "developerName": "Singapore Land Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/onemap-sg/id1244720012?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-03-04T23:00:00Z",
      "userRatingCount": 52,
      "size": "82252800",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-land-authority/id1068341642?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "1.1.6",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.onemap.ios.om2",
      "agencyFullName": "SINGAPORE LAND AUTHORITY"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "One Historical Map is an SG50 project created by the Singapore Land Authority in partnership with the National Heritage Board.\n\nDiscover Singapore of yesteryears through our collection of georeferenced street maps (since 1966) and hundreds of photos!\n\nYou can make your photos a part of Singapore’s history by sharing them today.",
      "appName": "OneHMap",
      "releaseNotes": "Bug Fixes.",
      "developerName": "Singapore Land Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/onehmap/id1068341643?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-05-04T09:33:16Z",
      "userRatingCount": 0,
      "size": "54293504",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-land-authority/id1068341642?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.3.3",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.onemap.ohm",
      "agencyFullName": "SINGAPORE LAND AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "INLIS (Integrated Land Information Service) is a one-stop portal which allows you to obtain property and land survey information such as property ownership information and survey plans provided by Singapore Land Authority. You can also obtain road line plans and railway protection plans provided by Land Transport Authority.",
      "appName": "INLIS4",
      "releaseNotes": "* Bug fixed",
      "developerName": "Singapore Land Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/inlis4/id1140865753?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-09-03T22:00:31Z",
      "userRatingCount": 0,
      "size": "14416896",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-land-authority/id1068341642?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.3",
      "minimumOsVersion": "9.0",
      "bundleId": "com.INLIS.ios",
      "agencyFullName": "SINGAPORE LAND AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "DISCOVER STATE PROPERTIES IN VIRTUAL REALITY!\nDo join the SLA team in this exciting journey through the most iconic state properties. Visit Red Dot Traffic Building, Black & White Bungalows and fly 50 meters above Dempsey Hill!\nLearn more about past, present and interesting facts about Singapore’s historical buildings.\nProperties featured: Red Dot Traffic Building, Black & White Bungalows, Dempsey Hill.\nHow to view: Use your smartphone or VR headset to be immersed inside the experience!\nCompatible with any Virtual Reality headsets: Google Cardboard, Zeiss VR ONE, DoDo Case VR, Homido, Durovis Dive, Fibrum etc.",
      "appName": "SLA360",
      "releaseNotes": "fixed some downloading errors on old devices",
      "developerName": "Singapore Land Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/sla360/id1152374814?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-12-17T17:44:01Z",
      "userRatingCount": 0,
      "size": "77911040",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-land-authority/id1068341642?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.2",
      "minimumOsVersion": "8.0",
      "bundleId": "com.vostokvr.sla360",
      "agencyFullName": "SINGAPORE LAND AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Singapore Satellite Positioning Reference Network (SiReNT) is a national reference network infrastructure, developed to support real-time high precision Positioning, Navigation and Tracking (PNT). An initiative by Singapore Land Authority (SLA), SiReNT supports GNSS (Global Navigation Satellite System) systems such as NAVSTAR GPS, GLONASS, QZSS, Beidou and Galileo. It provides Differential GNSS (DGNSS, also known as DGPS) services which improve the accuracy and reliability of PNT.",
      "appName": "SiReNT",
      "releaseNotes": "Bug fixes.",
      "developerName": "Singapore Land Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/sirent/id1358585311?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-22T15:13:49Z",
      "userRatingCount": 0,
      "size": "27615232",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-land-authority/id1068341642?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.1",
      "minimumOsVersion": "9.0",
      "bundleId": "com.sla.sirent.inlis",
      "agencyFullName": "SINGAPORE LAND AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Embark on a transformational journey of some of our most iconic state-owned properties in Singapore! Visit the past, present and future of Tanjong Pagar Railway Station, The Grandstand, and Maxwell Chambers to learn more about them.\n \nHow to use: Use your VR headset to immerse in the experience!\n \nPhoto Credits: Ministry of Information and the Arts (Courtesy of National Archives of Singapore), Red Dot Museum, Land Transport Authority, Ministry of Law, Maxwell Chambers, Jerome Lim (The Long and Winding Road).\n \nCompatible with any VR headsets!",
      "appName": "SLA VR",
      "releaseNotes": null,
      "developerName": "Singapore Land Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/sla-vr/id1421632643?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-08T08:51:32Z",
      "userRatingCount": 0,
      "size": "218680320",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-land-authority/id1068341642?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.0",
      "minimumOsVersion": "8.1",
      "bundleId": "com.alternatevp.sla",
      "agencyFullName": "SINGAPORE LAND AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Singapore Government.\n\nmyCPF provides you with easy access to your personal CPF information on the go. It also provides you with a quick way to perform Retirement Sum Top-Ups and calculate the amount of CPF contributions payable. You can access your CPF information via the following services using your SingPass:\n\n•My Dashboard \n•My Healthcare\n•My Housing \n•My Investment \n•My Messages \n•Transaction History\n•Contribution History \n\nFor the full suite of CPF online services, please visit www.cpf.gov.sg.",
      "appName": "myCPF",
      "releaseNotes": "Minor app fixes and improvements to usability.",
      "developerName": "Central Provident Fund Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/mycpf/id389277976?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-22T07:22:39Z",
      "userRatingCount": 755,
      "size": "19835904",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/central-provident-fund-board/id389277979?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "5.8.2",
      "minimumOsVersion": "8.0",
      "bundleId": "gov.sg.cpf.mycpf",
      "agencyFullName": "CENTRAL PROVIDENT FUND BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Singapore Government.\n\nCPF Starter is a handy resource tool that gives an overview of your CPF, from projecting the growth of your CPF savings to how you can better use these savings for your housing, healthcare and retirement needs.\nCPF Starter won the Mob-Ex Awards 2016 for Best App - Utility (Gold) and Best App - Creative (Bronze).\n\nFeatures: \nCPF Savings Projection:\n- Calculate how much CPF contributions you and your employer need to make\n- Find out how much CPF goes into your Ordinary, Special and MediSave Accounts\n- Project how your CPF savings will grow over the years in each of these accounts with the power of compound interest\n\nMy Messages\n- Get the latest CPF news and notifications about upcoming events on the go\n\nInformation on using CPF for Housing, Healthcare and Retirement: \n- Learn more about the various CPF schemes and services\n- Get useful tips on managing cash flow",
      "appName": "CPF Starter",
      "releaseNotes": "- Updates to the projection tool.\n- Updates to 'My Messages' section.",
      "developerName": "Central Provident Fund Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/cpf-starter/id995163955?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-02T01:31:13Z",
      "userRatingCount": 92,
      "size": "21612544",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/central-provident-fund-board/id389277979?mt=8&uo=4",
      "averageUserRating": 4.5,
      "version": "1.2.2",
      "minimumOsVersion": "7.0",
      "bundleId": "com.cpf.cpfstarter",
      "agencyFullName": "CENTRAL PROVIDENT FUND BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "CPF e-Submit@mobile is a free tool provided by the CPF Board for employers to conveniently e-submit and pay their monthly CPF contributions on-the-go. It is optimised for mobile devices to help employers complete their submissions easily and quickly. It is most suitable for employers with 10 or fewer employees.\n\nBenefits of using CPF-e-Submit@mobile:\na) No pre-registration required\nb) Fuss-free submission of your CPF contribution details via any mobile platform\nc) Mobile optimised screen for positive user experience\nd) Secure payment via:\n• eNETS [personal bank accounts from DBS, POSB, UOB, OCBC, Citibank (Maxisave / Ready Credit) and Standard Chartered are accepted]; or\n• OCBC Bank ATM / Internet Banking using the Transaction Reference Number (TRN) generated\n\nThis application is a service of the Singapore Government.",
      "appName": "CPF e-Submit@mobile",
      "releaseNotes": "Minor bug fixes",
      "developerName": "Central Provident Fund Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/cpf-e-submit-mobile/id1072317364?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-10-30T03:45:59Z",
      "userRatingCount": 0,
      "size": "913408",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/central-provident-fund-board/id389277979?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.02",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.gov.cpf.eSub",
      "agencyFullName": "CENTRAL PROVIDENT FUND BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "NPal2 mStudent is an extension of NPal2 Student Self-Service, providing more personalised experience while using essential e-Services. This service is offered to NP students on mobile devices with Internet access.\n\nYour feedback is important to us. Features available in the app are a result of your feedback. So do continue to give us your feedback via 'Contact us / Feedback' in the app.",
      "appName": "mStudent",
      "releaseNotes": "Student Virtual Card - Students can now access a virtual copy of the student card.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/mstudent/id1065511743?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-21T08:27:56Z",
      "userRatingCount": 38,
      "size": "55201792",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 2.0,
      "version": "3.0",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.npcc.npal2mstudent",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "YAAASSS Friends of NP!\n\nFind out which course matches your personality in our awesome quiz full of pop culture references.\n\nAnd check out our super cool and exclusive 360 panoramic content where you gonna have a great view of our beautiful campus!",
      "appName": "NP Courses",
      "releaseNotes": "Fix Performances and Open House content",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/np-courses/id1180835366?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-04T21:37:34Z",
      "userRatingCount": 0,
      "size": "87643136",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1.8",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.edu.np.NgeeAnnPoly",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Nursing Assessment app is the first-of-its-kind mobile nursing assessment programme in Asia.  The app allows NP students to conduct MCQ-type self assessment, update learning journals and also allows Clinical Facilitators (CF) and Clinical Instructors (CI) to securely record/sign skill items performed during the clinical attachments. Lecturers are also able to view records created by students under their charge.   The individual sub-apps are: 1. Pre-test 2. E-LogBook and 3. Learning Journal.",
      "appName": "NPalm Nursing Assessment",
      "releaseNotes": "Update to support iOS 8. Fix bug that CF names created in the backend was not able to sync to app.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/npalm-nursing-assessment/id436299709?mt=8&uo=4",
      "currentVersionReleaseDate": "2014-11-04T20:05:34Z",
      "userRatingCount": 8,
      "size": "7307264",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "2.6",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.edu.np.NPalmNursingAssessment",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The New NPalm Nursing Assessment app is the first-of-its-kind mobile nursing assessment programme in Asia. Updated to HTML 5 with auto synchronize to backend database. The app allows NP students to conduct MCQ-type self assessment, update learning journals and also allows Clinical Facilitators (CF) and Clinical Instructors (CI) to securely record/sign skill items performed during the clinical attachments. Lecturers are also able to view records created by students under their charge. The individual sub-apps are: 1. Pre-test 2. E-LogBook and 3. Learning Journal.",
      "appName": "NPalm",
      "releaseNotes": "Bug fixes",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/npalm/id990918927?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-10-02T23:31:28Z",
      "userRatingCount": 20,
      "size": "10472448",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 1.5,
      "version": "1.5",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.edu.np.NPalm",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Busy missy is a single user self-learning nursing skills centric game which aims to help nursing students learn the nursing skills in a fun, interactive and engaging manner. The game also aims to make learning more meaningful by integrated knowledge and practice within clinical scenarios. Within the game, a scenario or patient background will be presented to the player. The player has to ask or answer the right questions and perform the right task as he/she progress through the storyboard. The game illustrates the admission, hospitalization and discharge of a patient.  During admission & hospitalization, there are activities to assess the students’ assessment, diagnosing, planning, implementation, evaluation and documentation skills.",
      "appName": "BusyMissy",
      "releaseNotes": "• Fixed some bugs in quiz",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/busymissy/id587242316?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-29T21:26:43Z",
      "userRatingCount": 0,
      "size": "202417152",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.9",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.edu.np.BusyMissy",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Given the list of medical abbreviations widely used in the healthcare context, this apps allows nursing students to seek answers to those mind-boggling abbreviations scribbled in medical documents. These medical abbreviations are arranged in alphabetical order allowing user to search for the abbreviations and its definitions quickly.",
      "appName": "HS Medical Abbreviations",
      "releaseNotes": "Minor bug fix",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/hs-medical-abbreviations/id436304902?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-07-16T17:52:50Z",
      "userRatingCount": 0,
      "size": "58350592",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.1",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.edu.np.MedicalAbbr",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Singapore is a multiracial country with a population made up of Chinese, Malays, Indians and  other races.  To bridge this communication gap between the races and dialects used by the population at large and the nursing students, a database with audio capability of commonly-used phrases by nurses, are made available in Mandarin, the Hokkien and Cantonese dialects as well as Malay.",
      "appName": "Mobile Translator",
      "releaseNotes": "Minor bug fix.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/mobile-translator/id436307443?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-07-16T17:53:08Z",
      "userRatingCount": 0,
      "size": "69590016",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.1",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.edu.np.mTranslator",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This app is an educational tool that acts as both a reference and a self-assessment tool for skeletal bones and joint movements.\n\nThe app consists of 5 different bone sets:\n• cranial bones \n• upper limb\n• lower limb\n• facial\n• axial skeleton\n\nUsers can:\n• browse the reference section to learn about the bone groups\n• try assembling each bone group from constituent bones, then name them\n• test themselves on correct joint movements using the accelerometer (e.g. abduction at left shoulder)\n\nPoints are awarded for correctly joining the bones to form a bone group as well as correct movement of the joint.\n\nThis app is developed for the School of Health Sciences, Ngee Ann Polytechnic. For more information, please contact sch_hs@np.edu.sg.",
      "appName": "SkelePracti",
      "releaseNotes": "Upgraded to 3D model of the Skeleton and also to support the latest iOS and all the iPhone screen sizes.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/skelepracti/id409988859?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-04-23T16:43:26Z",
      "userRatingCount": 0,
      "size": "309780480",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.0",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.edu.np.skelepracti",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Virtual Hospital 2 can be played as both single-user and multi-user game. It is developed for Year 2 and Year 3 Nursing students at the School of Health Sciences, Ngee Ann Polytechnic. The game-based, learner-centered approach empowers students to build on knowledge learnt in the Nursing Science modules. In the multi-player mode, students are involved in collaborative learning as they work as a team to solve problems.\n \nThe game depicts real-life scenarios showing different types of patients with different clinical conditions. In the game, the students are trained in various skills, such as nursing care and management of patients. They are expected to demonstrate competence in caring for patients with various clinical conditions. Every appropriate nursing interventions lead to gaining points and progression in the game.\n \nThe app. is also a good tool to help the students develop clinical judgment, clinical reasoning and critical thinking skills through real-life scenarios.",
      "appName": "HSHospital2",
      "releaseNotes": "Security patch to adhere to updated client and server security requirement.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/hshospital2/id1104838970?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-07T02:08:01Z",
      "userRatingCount": 0,
      "size": "360113152",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.4",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.np.HSHospital2",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Your RED Camp journey starts here! Get all the deets on the most lit camp for O-levelers!",
      "appName": "RED Camp",
      "releaseNotes": "Bug Fixes\nParent Consent \nQR Code Reader",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/red-camp/id1388741482?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-16T03:07:22Z",
      "userRatingCount": 7,
      "size": "110189568",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "2.4",
      "minimumOsVersion": "11.0",
      "bundleId": "sg.edu.np.Redcamp",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The RESUS App is developed for nursing students at the School of Health Sciences, Ngee Ann Polytechnic. It is the simple and fast way to help students to learn and test them on the correct CPR techniques and processes. Also, it is the good way to augment learning in emergency and critical care nursing.\n\nThe app comprises of the following sub-modules:\n• BCLS (4 modules)\n   1. One man adult CPR \n   2. Relief of adult foreign body airway obstruction (FBAO)\n   3. Infant one-rescuer CPR\n   4. Relief of  infant foreign body airway obstruction (FBAO)\n• BCLS instructor course\n• Megacode\n\nThe app allows the users to simulate cardiac compression and ventilation. It incorporate a metronome to simulate cardiac compressions for deliverance of 100 beats per minutes.\n\nA question bank with appropriate taxonomy levels is set up for students to perform self-assessment on the theoretical contents covered in the modules.\n\nThe app depicts 4 real-life scenarios. It is a good tool to enable students practise life-saving decision-making skills while handling different case scenarios.",
      "appName": "RESUS",
      "releaseNotes": "Minor bug fix for devices running iOS 11.2 updates.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/resus/id1187789282?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-01-12T19:51:33Z",
      "userRatingCount": 0,
      "size": "43910144",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1.4",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.np.resus",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Learning endocrine system is very complex and confusing as students need to remember total number of 14 endocrine structures, more than 30 hormones and their different actions on various target organs in the body. Students need more practice to be familiar with terminology, to have better retention to remember the names and actions of different endocrine glands and respective hormones etc.\u2028\u2028Endocrine Game is specially designed to help students learn about the complex human endocrine system through play on their mobile iOS devices. Players can test their knowledge of different endocrine glands and hormones secreted in the body system. They simply choose correct endocrine organ/s or hormone secreted level by level (e.g., head level, neck level, chest level, abdomen level and gonads) from the given list of answer keys. They can do numerous attempts to improve their score.\u2028\nEnhance your learning experience… try and test yourself as you learn the endocrine system, using this innovative, interactive way on the go anytime anywhere !",
      "appName": "EndocrineQuiz",
      "releaseNotes": "This update is signed with Apple’s latest signing certificate. No new features are included.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/endocrinequiz/id1100124109?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-04-14T20:29:03Z",
      "userRatingCount": 0,
      "size": "5993472",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "7.1",
      "bundleId": "sg.edu.np.EndocrineQuiz",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The name C28 refers to the 28 days menstrual cycle. \nThis mobile game is designed to enhance learning in human anatomy and physiology for the medical and health sciences students. Even for the learners without prior biological background, you can play this anatomy game easily and learn the different complex cycles of female reproductive system such as uterine cycle, ovarian cycle, changing levels of various sex hormones and better understanding of safe & unsafe periods. A highly interactive set-up, a sperm moving around to select the day to answer which engages the users effectively to enhance self-directed learning.\nA comprehensive reference section, scoring and systematic feedback from the app enable the learners to achieve the desired active learning goal conveniently on the GO!. In fact, this game is your pocket learning resource or your practice companion to tackle the complexity of the female reproductive system of the human anatomy.",
      "appName": "C28",
      "releaseNotes": null,
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/c28/id1161626431?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-10-08T02:35:31Z",
      "userRatingCount": 0,
      "size": "23269376",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.edu.np.C28",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This mobile game is designed to enhance learning in human anatomy and physiology for the medical and health sciences students. Even for the learners without prior biological background, you can play this anatomy game easily and learn the different types of cranial nerves. A highly interactive set-up, the roulette wheel, engages the users effectively to complete the learning journey for the whole set of cranial nerves.  \nBeing the only 12 pairs of nerves in the body which attach directly the brain, you might wonder how these nerves are special. This game strengthens your knowledge in the following aspects. \n1)\tIdentifying the cranial nerves with the names & the assigned numbers. \n2)\tClassification according to their nature & function such as pure motor, pure sensory, special sensory, mixed nerve etc. \n3)\tNames & functions of the cranial nerves for special sensory.\n4)\tNames & functions of the cranial nerves for pure sensory. \n5)\tNames & functions of the cranial nerves for pure motor. \n6)\tNames & functions of the mixed cranial nerves.\n7)\tIdentifying the cranial nerve which functions in autonomic nervous system. \nA comprehensive reference section and systematic feedback from the app enable the learners to achieve the desired learning goal conveniently. In fact, this game is your pocket learning resource or your practice companion to tackle the complexity of the nervous system of the human anatomy.",
      "appName": "Cranial Nerves",
      "releaseNotes": null,
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/cranial-nerves/id1166089584?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-10-20T00:50:55Z",
      "userRatingCount": 0,
      "size": "24627200",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.np.CranialNerves",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Alert@NP is an app for Ngee Ann Polytechnic's staff, students and visitors to report cleanliness issues, defects, hazards and near misses.  \n\nAll you have to do is to notify us on incidents of water and energy wastage, building defects, unauthorised smoking, littering etc, simply by using a few taps via this app.  Attach photos, add your location, description and you are good to go!\n\nYour feedback will be kept confidential and follow-up action will be taken.  \n\nThank you for playing a part in keeping our environment safe and clean.",
      "appName": "Alert@NP",
      "releaseNotes": "In this new update, user who reported the incident will be copied in the email.  It also comes with app fixes.",
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/alert-np/id1401873402?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-09-28T18:53:04Z",
      "userRatingCount": 0,
      "size": "89033728",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.3",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.npcc.npalert",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Cell cycle is the series of events that happen as cells grow and divide. All organisms rely upon cell division for reproduction, repair and growth. However, the steps of the cell cycle are complicated for students and require time and practice to understand. Thus, this cell cycle game has been designed with the objective to make student understand the events taking place in the cell during cell cycle. \nThis game uses a roulette wheel format to challenge students to use what they know about cell division to play a game in which they identify phases of cell division (mitosis). This game enhances students’ knowledge on cell cycle in the following ways:\n-\tProvides a comprehensive coverage of the cell cycle.\n-\tChallenges students to identify the stages of the mitosis cell cycle by matching the phases with the descriptions.\n-\tAids students in recalling key concepts of the stages of the cell cycle.\nThis game is an excellent way to reinforce the topic on cell division and discover the events that occur in each phase of the cell cycle. So, can you identify the stages of the cell cycle?",
      "appName": "CellCycle",
      "releaseNotes": null,
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/cellcycle/id1166062830?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-10-17T19:02:28Z",
      "userRatingCount": 0,
      "size": "24150016",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.np.CellCycle",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "Container listing common NP web applications and mobile apps for the NP community.",
      "appName": "NP Apps Container",
      "releaseNotes": null,
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/np-apps-container/id1413564315?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-07-29T17:40:24Z",
      "userRatingCount": 0,
      "size": "19657728",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "10.3",
      "bundleId": "sg.npcc.container",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "The app has 2 sections; Coronary Circulation and Electrocardiogram. Each section is developed into 3 levels of learning processes. The contents of the levels are designed with Bloom Taxonomy from the basic anatomy & physiology to the mechanism of disease processes and the diagnosis & management of cardiovascular diseases.",
      "appName": "AR Heart",
      "releaseNotes": null,
      "developerName": "Ngee Ann Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/ar-heart/id1440579811?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-22T18:40:21Z",
      "userRatingCount": 0,
      "size": "154390528",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ngee-ann-polytechnic/id359082393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.edu.np.ARHeart",
      "agencyFullName": "NGEE ANN POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "[Notice: This app is no longer supported. Please download the new app, MuslimSG.]\n\nThis app provides Muslims in Singapore quick access to prayer schedules, mosque locations, sermon texts and latest fatwa.",
      "appName": "MUIS:OOM",
      "releaseNotes": "Added notification to inform user app is no longer supported.",
      "developerName": "HCLINSYS SG",
      "appViewUrl": "https://itunes.apple.com/sg/app/muis-oom/id514823490?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-14T21:09:34Z",
      "userRatingCount": 161,
      "size": "5345280",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/hclinsys-sg/id979139703?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "8.2",
      "minimumOsVersion": "8.0",
      "bundleId": "com.infusionz.Muis-OOM",
      "agencyFullName": "MAJLIS UGAMA ISLAM, SINGAPURA"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Singapore Government. \n\nGet access to the news releases, latest vessel information/alerts and other e-services with myMaritime@SG:\n• News releases and circulars\n• Real time information of a vessel details\n• Latest vessel arrival/departure schedule\n• Daily shipping state list of vessels\n• Receive alert when a vessel arrives, departs, or moves from one location to another within Singapore Port\n• Report unusual or illegal activities in port waters via Feedback\n• Tidal Atlas\n• And many more e-services to come in future updates...\n\nNote: The m-Marinet module requires users to have a valid MARINET login ID to access. For more information on MARINET, please visit http://www.mpa.gov.sg/sites/global_navigation/e-services/e_services.page.\n\nThe Maritime and Port Authority of Singapore (MPA) was established on 2 February 1996, with the mission to develop Singapore as a premier global hub port and International Maritime Centre (IMC), and to advance and safeguard Singapore's strategic maritime interests. MPA is the driving force behind Singapore's port and maritime development, taking on the roles of Port Authority, Port Regulator, Port Planner, IMC Champion, and National Maritime Representative. MPA partners the industry and other agencies to enhance safety, security and environmental protection in Singapore port waters, facilitate port operations and growth, expand the cluster of maritime ancillary services, and promote maritime R&D and manpower development.",
      "appName": "myMaritime@SG",
      "releaseNotes": "Minor bug fixes",
      "developerName": "Maritime and Port Authority of Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/mymaritime-sg/id895843510?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-03-23T22:32:11Z",
      "userRatingCount": 5,
      "size": "62212096",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/maritime-and-port-authority-of-singapore/id895843513?mt=8&uo=4",
      "averageUserRating": 4.5,
      "version": "1.8.3",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.mpa.mmarinet",
      "agencyFullName": "MARITIME AND PORT AUTHORITY OF SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Customs@SG is a latest service offering by Singapore Customs. \n\nTravellers with purchases exceeding their personal duty free concession or Goods & Services Tax (GST) relief can use the app to declare and pay the duty and/or GST for the goods purchased, anytime anywhere prior to their arrival in Singapore. \n\nThe app also allows members of the public to provide timely tip-off on customs offences, feedback or send enquiries relating to Customs matters. \n\nWith Customs@SG, you can easily access the following services at your fingertips:  \n\n-\tDeclare and pay duty and/or GST on your overseas purchases\n-\tProvide tip-offs on customs offences\n-\tProvide feedback on customs matters",
      "appName": "Customs@SG",
      "releaseNotes": "Bug fixes and performance improvements.",
      "developerName": "Singapore Customs",
      "appViewUrl": "https://itunes.apple.com/sg/app/customs-sg/id1062502468?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-04-16T16:14:58Z",
      "userRatingCount": 12,
      "size": "7326720",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-customs/id1062502467?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "1.4.14",
      "minimumOsVersion": "7.0",
      "bundleId": "com.singaporecustoms.customssg",
      "agencyFullName": "MINISTRY OF FINANCE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The PAssion Card is a membership card of the People's Association. Besides exclusive privileges for our exciting range of courses, activities and programmes, members can look out for unique promotions offered by PAssion Card merchants and partners. With this application, members will receive the latest updates on PAssion Card promotions and happenings on-the-go! Members can now login via SingPass to download their PAssion e-Card(s) to enjoy greater convenience at PAssion Merchants that accept the PAssion e-Card as a form of identity. \n\nMembers will also be able to participate in members’ exclusive contests & quizzes to stand a chance to win attractive prizes and premiums. In addition, this app allows members to find out the number of TapForMore points accumulated at Cold Storage, Giant and/or Guardian Health & Beauty stores. \n\nDownload the application today!\n\nNote: Members are required to set up their profiles for access to certain modules. For a list of the frequently asked questions on the mobile app, please visit https://www.passioncard.sg/faqs",
      "appName": "PAssion Card",
      "releaseNotes": "Bug fix to resolve missing content issue.\n\nNote: Users who had set up their profiles/ usernames in the earlier versions of the app(s) are still required to go through the above step and re-enter their username/ password. Availability of usernames is on a first-come first-served basis.",
      "developerName": "People’s Association",
      "appViewUrl": "https://itunes.apple.com/sg/app/passion-card/id423739100?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-05T19:02:51Z",
      "userRatingCount": 122,
      "size": "65814528",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/peoples-association/id423739103?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "4.0.2",
      "minimumOsVersion": "9.0",
      "bundleId": "com.PAssion.PAssionCard",
      "agencyFullName": "PEOPLE'S ASSOCIATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Introducing the app that will welcome you to a world of wonder at Our Tampines Hub.\n\nGet the full details and listing of all the retail, food & beverage outlets at the Hub – keep up with the latest on all events, programmes and activities hosted within the Hub and receive real-time updates  on current and upcoming events, career opportunities and customer rewards programmes. Check out the photo gallery to better visualise the different features at OTH and use the app to help you get from where you are, to where you want to go in the Hub, in the quickest and easiest way.\n\nDownload OTH Mobile to make the most of your OTH experience – unlock rewards and other perks with our customer loyalty programme which will also feature Exclusive access to promotions and events, amongst other exciting programmes that will help you unlock a plethora of privileges that can be enjoyed at Our Tampines Hub.",
      "appName": "Our Tampines Hub",
      "releaseNotes": "Fix bugs.",
      "developerName": "People’s Association",
      "appViewUrl": "https://itunes.apple.com/sg/app/our-tampines-hub/id1136080828?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-25T21:51:25Z",
      "userRatingCount": 15,
      "size": "20970496",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/peoples-association/id423739103?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "2.5.12",
      "minimumOsVersion": "8.0",
      "bundleId": "gov.oth.sg.OTHMobile",
      "agencyFullName": "PEOPLE'S ASSOCIATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "PALMS is a mobile learning management app for grassroots volunteers of the People's Association.  The app allows them to access interactive e-Learning courseware at their convenience through their mobile devices.\n\nFeatures include: \n- Interactive content\n- Online quiz\n- Online resources\n- e-Certificate\n- Learning progress",
      "appName": "People's Association LMS",
      "releaseNotes": "- Added maintenance feature.\n- Added scheduled application downtime notice.\n- Minor bug fixes.",
      "developerName": "People’s Association",
      "appViewUrl": "https://itunes.apple.com/sg/app/peoples-association-lms/id1201637430?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-01-05T12:53:55Z",
      "userRatingCount": 0,
      "size": "111955968",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/peoples-association/id423739103?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.04",
      "minimumOsVersion": "8.0",
      "bundleId": "com.palms.app.PALMS",
      "agencyFullName": "PEOPLE'S ASSOCIATION"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "Get the latest environmental news updates and information at your finger tips with myENV:\n\n• Access real-time information on Singapore’s weather and receive push-notification alerts when raining at certain locations\n\n• View latest PSI & hourly PM2.5 information\n\n• Locate dengue clusters\n\n• Search for hawker centre by name, region or address\n\n• View latest NEA’s events and happenings\n\n• Obtain useful information such as list of licensed food caterers\n\n• Convenience of providing feedback to NEA\n----------------------------------\nmyENV app will need access to certain features on your phone for the following reasons:\n\n• Location\nUse your phone’s location to provide you with localised weather information.\n \n• Phone\nLet you call NEA hotline conveniently with just one touch.\n \n• Photos/Media/Files\nAllow you to save photographs taken with myENV app in your phone and to attach them when you file a       report to NEA.\n \n• Camera\nAccess the phone’s camera if you wish to attach a photograph while making a Report to NEA.\n \n• Device ID & Call Information \nRead your phone’s UUID so that you can register and receive push notifications.\n----------------------------------\n\nFor a full suite of information and online services, please visit http://www.nea.gov.sg or follow NEAsg on Twitter to receive more updates.\n\nFormed on 1 July 2002, the National Environment Agency (NEA) is the leading public organization responsible for improving and sustaining a clean and green environment in Singapore. The NEA develops and spearheads environmental initiatives and programmes through its partnership with the People, Public and Private sectors. It is committed to motivating every individual to take up environmental ownership and to care for the environment as a way of life.\n\nBy protecting Singapore's resources from pollution, maintaining a high level of public health and providing timely meteorological information, the NEA endeavours to ensure sustainable development and a quality living environment for present and future generations.\n\nThis application is a service of the Singapore Government.\n\nTag: NEACQSD00093",
      "appName": "myENV",
      "releaseNotes": "· Added “Ask Jamie” chatbot\n\n· Enhancement to feedback submission\n\n· Updated Volunteer Signup",
      "developerName": "National Environment Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/myenv/id444435182?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-03-01T04:02:40Z",
      "userRatingCount": 331,
      "size": "41034752",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/national-environment-agency/id444435185?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "2.7.0",
      "minimumOsVersion": "9.0",
      "bundleId": "myNEA",
      "agencyFullName": "NATIONAL ENVIRONMENT AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Urban Redevelopment Authority (\"URA\") provides comprehensive and timely real estate information to enhance the transparency of the Singapore property market and to facilitate developers, property owners and the general public in making informed decisions on land development, property investment/purchases and leasing. \n\nThis application includes information on sale prices and rentals of private residential properties in Singapore (including prices of units sold by developers). \n\nWhilst every reasonable endeavour has been made to ensure that the contents of the Property Market Information are accurate and complete, the URA does not warrant the accuracy, correctness and completeness of such contents and shall not be responsible for any injury, loss or damage whatsoever may arise as a result of any use of or reliance on such contents.",
      "appName": "Property Market Information",
      "releaseNotes": "Bug fixes for feedback page",
      "developerName": "Urban Redevelopment Authority (URA)",
      "appViewUrl": "https://itunes.apple.com/sg/app/property-market-information/id573494340?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-10T19:03:05Z",
      "userRatingCount": 16,
      "size": "43076608",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/urban-redevelopment-authority-ura/id571242368?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "2.7",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.gov.ura.pmi2",
      "agencyFullName": "URBAN REDEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Master Plan is the statutory land use plan which guides Singapore's development in the medium term over the next 10 to 15 years. It shows the permissible land use and density for developments in Singapore and is reviewed every five years. The Master Plan is to be read together with the Master Plan Written Statement.\n\nThis is the Master Plan 2014. The Master Plan 2014 and Master Plan Written Statement 2014 have been approved by the Minister for National Development on 27 May 2014. The Master Plan Written Statement 2014 and all subsequent amendments to the Master Plan and the Master Plan Written Statement are available at the website of the Urban Redevelopment Authority (URA) at http://www.ura.gov.sg/\n\nWhilst every reasonable endeavour has been made to ensure that the contents of the Master Plan 2014 is represented accurately, the URA and the Singapore Government disclaim all liability for any injury, loss or damage whatsoever that may arise as a result of any inaccuracy, error or omission.\n\n©Singapore Government. All rights reserved.",
      "appName": "Master Plan 2014 - Singapore",
      "releaseNotes": "Added 64-bit compatibility",
      "developerName": "Urban Redevelopment Authority (URA)",
      "appViewUrl": "https://itunes.apple.com/sg/app/master-plan-2014-singapore/id571242365?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-09-05T21:03:52Z",
      "userRatingCount": 17,
      "size": "5298176",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/urban-redevelopment-authority-ura/id571242368?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "4.2",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.ura.MP082",
      "agencyFullName": "URBAN REDEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "SGSecure is a national movement to sensitise, train and mobilise Singaporeans to play a part to prevent and deal with a terrorist attack.\nUse the SGSecure app to: \n- Receive important broadcast messages from the authorities on the latest situation in the event of major emergencies\n- Seek assistance from the authorities should a major situation happen in your vicinity\n- Send videos, photos and messages to the authorities to provide information on a situation which you have witnessed\n- Access links to Police@SG and myResponder apps\n- Access  the SGSecure e-learning package and learn how to better protect yourself and others in an emergency. \n\nPlease note that continued use of GPS running in the background can dramatically decrease battery life.",
      "appName": "SGSecure",
      "releaseNotes": "- UI enhancements\n\nFor Support, please contact:\n- Telephone: 66849554 or Email: SGSecure_TechSupport@ncs.com.sg",
      "developerName": "Ministry of Home Affairs",
      "appViewUrl": "https://itunes.apple.com/sg/app/sgsecure/id1095191664?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-02T00:11:39Z",
      "userRatingCount": 406,
      "size": "30827520",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-home-affairs/id529023153?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "1.2.6",
      "minimumOsVersion": "8.0",
      "bundleId": "com.MinistryOfHomeAffairs.SGSecure",
      "agencyFullName": "MINISTRY OF HOME AFFAIRS"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of Singapore Government.\n\nAbout ACRA On The Go\nACRA On The Go is a mobile extension of key services currently available on BizFile+ - the online business filing and information portal managed by the Accounting and Corporate Regulatory Authority (ACRA). Business owners can perform a range of business registration and filing transactions with ACRA On The Go. The public can access business related information for free as well as purchase business information products.\n\nThe following services are available on the ACRA On The Go mobile app: \n\n∙         Business Registration and Filing services  \nBusiness owners can renew registration for certain business entities, file annual declarations or change address for business entities. Enquiries on the status of selected applications including striking off or Extension of Time that have been filed with ACRA can also be made. \n\n∙         Directory Search \nAllows users to conduct a preliminary check on business entities, including basic information such as its Unique Entity Number (UEN), entity name, status, and the street name as reflected in its registered business address. \n\n∙         iShop@ACRA \nTo facilitate the purchase of electronic products such as business profile while the customer is on the move.\n\n∙         AGM Calculator \nEnables directors and companies to plan when to hold their next AGMs and also meet the statutory requirements under the Companies Act. \n\n∙         AskACRA \nAn interactive FAQ search service that enables users to easily access FAQs related information on business registration and filing matters.\n\n∙         ACRAConnect\nACRA’s newsletter that keeps readers updated on new regulatory developments including policy and legislative changes, business facilitation initiatives and upcoming events organised by ACRA. \n\nDate of Official Launch: 7 November 2016 \nTo provide feedback on the application,\nPlease e-mail us at\nhttps://www.acra.gov.sg/ask_ACRA_FAQs",
      "appName": "ACRA On The Go",
      "releaseNotes": "New payment modes",
      "developerName": "ACRA, Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/acra-on-the-go/id430149539?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-25T11:00:23Z",
      "userRatingCount": 20,
      "size": "14439424",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/acra-singapore/id430149542?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "3.0.12",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.acra.ACRAOnTheGo",
      "agencyFullName": "ACCOUNTING AND CORPORATE REGULATORY AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Singapore Government.\n\nJustice@State Courts mobile app provides information on the hearing dates in the State Courts and other information services such as filling instructions, virtual tour of courtrooms and access to legal aid services for the convenience of public users via its user-friendly interface. The application is available across popular mobile platforms.",
      "appName": "Justice@State Courts",
      "releaseNotes": "Enhancements:\n- Update new webpage link\n- Update hearing list API\nBug fixes:\n- Fix flash screen and correct link",
      "developerName": "State Courts Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/justice-state-courts/id981124571?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-08T22:22:22Z",
      "userRatingCount": 0,
      "size": "17429504",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/state-courts-singapore/id981124570?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.3.9",
      "minimumOsVersion": "8.0",
      "bundleId": "com.statecourts.mhearings",
      "agencyFullName": "JUDICIARY, STATE COURTS"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "IMDA’s Wireless@SG app provides features catering to the needs of people who are constantly “on the move”. Through this app, users can:\n•\t Setup Wireless@SG and get connected automatically\n•\t View and find the nearest up-to-date Wireless@SG hotspots\n•\t Rate the Wireless@SG hotspots\n\nTo help us improve this app, you are welcome to email us at: info@imda.gov.sg\n\nNote: You may incur data charges while using this application. You are encouraged to keep track of your data usage from time to time\n\nDisclaimer: Continued use of GPS running in the background can dramatically decrease battery life.",
      "appName": "Wireless@SG",
      "releaseNotes": "Improved compatibility & bug fixes",
      "developerName": "Info-communications Media Development Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/wireless-sg/id994924492?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-10T03:17:04Z",
      "userRatingCount": 172,
      "size": "13366272",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/info-communications-media-development-authority/id470826705?mt=8&uo=4",
      "averageUserRating": 2.0,
      "version": "2.4",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.gov.wirelesssg",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "IMDA’s Wireless@SG app provides features catering to the needs of people who are constantly “on the move”. Through this app, users can:\n•\t Setup Wireless@SG and get connected automatically\n•\t View and find the nearest up-to-date Wireless@SG hotspots\n•\t Rate the Wireless@SG hotspots\n\nTo help us improve this app, you are welcome to email us at: info@imda.gov.sg\n\nNote: You may incur data charges while using this application. You are encouraged to keep track of your data usage from time to time",
      "appName": "Wireless@SG",
      "releaseNotes": "Improved compatibility & bug fixes",
      "developerName": "Info-communications Media Development Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/wireless-sg/id1222815823?mt=12&uo=4",
      "currentVersionReleaseDate": "2018-09-04T06:36:09Z",
      "userRatingCount": 38,
      "size": "3766895",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/info-communications-media-development-authority/id470826705?mt=12&uo=4",
      "averageUserRating": 2.5,
      "version": "1.3",
      "minimumOsVersion": "10.10",
      "bundleId": "sg.gov.wirelesssg-mac",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Ministry of Social and Family Development (MSF) focuses on work in the development of families, social services and social safety nets. The Directory of Family Centres Services (DFCS) mobile app is an initiative by MSF to provide location and information on various centres, organisations and services while on the go.",
      "appName": "Family and Social Services",
      "releaseNotes": "minor bug fixes.",
      "developerName": "Ministry of Social and Family Development",
      "appViewUrl": "https://itunes.apple.com/sg/app/family-and-social-services/id707274893?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-10-11T18:07:41Z",
      "userRatingCount": 0,
      "size": "22976512",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-social-and-family-development/id612976888?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.3",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.msf.dfss",
      "agencyFullName": "MINISTRY OF SOCIAL AND FAMILY DEVELOPMENT"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application provided by the Ministry of Social and Family Development allows parents to:\n\n•\tDetermine if your child is eligible for the Baby Bonus Scheme\n•\tHave an overview the child’s Baby Bonus benefits\n•\tCheck on Baby Bonus Cash Gift payment schedule\n•\tAccess information on your child’s Child Development Account (CDA) (e.g. remaining CDA cap)\n•\tPerform e-Services (e.g. change of bank account, change of CDA bank)\n\nNote: \nTo access the e-services in this application, SingPass login is required. You need to join Baby Bonus scheme to access the e-services in this application. Please visit www.babybonus.msf.gov.sg/parent to join the scheme.",
      "appName": "Baby Bonus SG",
      "releaseNotes": "MyInfo Integration with Update User Details.",
      "developerName": "Ministry of Social and Family Development",
      "appViewUrl": "https://itunes.apple.com/sg/app/baby-bonus-sg/id1172052323?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-11T10:00:54Z",
      "userRatingCount": 0,
      "size": "11399168",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-social-and-family-development/id612976888?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.5",
      "minimumOsVersion": "8.1",
      "bundleId": "sg.gov.msf.bbss",
      "agencyFullName": "MINISTRY OF SOCIAL AND FAMILY DEVELOPMENT"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "You can access our whole range of services and other features at your convenience.\n\n* Check your sales application results, BTO flats available for selection and their probable completion dates\n\n* View the recent transacted prices of resale flats and the ethnic quotas, at the location of your choice\n\n* Locate and obtain directions to HDB Hub, Branch, and Service Centres\n\nThe Housing & Development Board (HDB) is Singapore's public housing authority and a statutory board under the Ministry of National Development.\n\nNote:\n* Selected services may require you to use SingPass or eNETS to complete the transaction.\n* This application is a service of the Singapore Government.",
      "appName": "Mobile@HDB",
      "releaseNotes": "- A brand new home screen for more convenient access to our services in Mobile@HDB\n- Retrieve car park short-term parking charges for all vehicles types in HDB Map Services and Car Park Information in Augmented Reality\n- Compatibility support for iOS 12\n- Optimisation​ for iPhone XS and iPhone XS Max",
      "developerName": "Housing & Development Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/mobile-hdb/id425341800?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-10-01T07:13:48Z",
      "userRatingCount": 423,
      "size": "147602432",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/housing-development-board/id425341803?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "2.64",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.hdb.mobilehdb",
      "agencyFullName": "HOUSING & DEVELOPMENT BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The key features of this app include:\n \nMonitoring your health statistics using Apple HealthKit or Fitbit\n- Keep track of your height, weight, BMI and calories burnt\n- Set your daily steps goal and track your daily steps count\n \nView your history of steps taken\n- View previous weeks/months history based on the selected step trackers\n\nLocation & Information on HDB Panel Clinics\n- Locate and view the details of HDB Panel Clinics\n \nPush Notifications on HDB health and wellness activities\n- Receive notifications on upcoming health activities\n \nHealth-related Information\n- View guidelines and articles on Workplace Safety & Health\n- Access related agencies’ websites on health and Workplace Safety information",
      "appName": "HDB Health",
      "releaseNotes": "Compatibility and performance enhancements",
      "developerName": "Housing & Development Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/hdb-health/id1266210350?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-07T11:28:43Z",
      "userRatingCount": 20,
      "size": "55739392",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/housing-development-board/id425341803?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "1.09",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.hdb.health",
      "agencyFullName": "HOUSING & DEVELOPMENT BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Discover the gracious neighbour in you as you embark on this exciting, fun-filled adventure game. Take a stroll around your neighbourhood and look out for leading clues to interact and help neighbours in need!\n\nFully integrated with 6 different mini games for you to unlock and score points! Also, don't forget to interact with your neighbours to score more points!! \n\n* A Republic Polytechnic production, in collaboration with the Housing & Development Board (HDB)\n\n- 6 fun-filled mini games to unlock (Required to complete the game):\n+ Wait 4 Me > Will you hold the lift for your neighbours?\n+ Cluttered Blaze' > Help your neighbour put out the fire!\n+ Music Or Noise > Control the music volume! Not too soft, Not too loud\n+ Dripping Frenzy > Protect your clothes from getting wet!\n+ Invite'em All > Invite your neighbours to an exciting event!\n+ Yumilicious Food > Can you help your neighbour find the ingredients for our local delights?\n\n- Share your score with your friends on Facebook!",
      "appName": "YOLO Neighbour",
      "releaseNotes": "- Bug Fix\n- Game Mechanic changes",
      "developerName": "Housing & Development Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/yolo-neighbour/id866775541?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-01-14T03:18:37Z",
      "userRatingCount": 0,
      "size": "190074880",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/housing-development-board/id425341803?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.5",
      "minimumOsVersion": "6.0",
      "bundleId": "com.RepublicPolytechnic.YOLONeighbour",
      "agencyFullName": "HOUSING & DEVELOPMENT BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Calculate parking fees automatically\nKey in your vehicle number, select the car park and indicate your estimated parking duration. Your charges will be automatically calculated (free parking timings, whole-day parking, night parking are all included).\n\nPay for parking \u2028digitally\nPay using your credit or debit card and start parking.\n\nTrack and extend your parking session remotely\nReceive notifications when your parking session is expiring or has ended. Extend your parking session without having to return to your vehicle.\n\nEnd your parking session early\nEnd your parking session if you're back at your vehicle early. A refund based on the actual parked duration will be given.",
      "appName": "Parking.sg",
      "releaseNotes": "Just internal updates to prep future changes",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/parking-sg/id1286602494?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-19T03:47:14Z",
      "userRatingCount": 223,
      "size": "29486080",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 4.0,
      "version": "v2.17.0",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.parking",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Log in within seconds using your fingerprint or 6-digit passcode.\n\nKEY FEATURES\n\n- Say goodbye to long passwords\n\nWith the SingPass Mobile app, you don’t have to enter your SingPass ID or password. Simply scan or tap the QR code to launch the app, verify and you’re in!\n\n- Transact securely on-the-go\n\nGoing for a holiday or staying overseas? Enjoy greater mobility when you use the new SingPass Mobile app. No more waiting for SMS OTP, or carrying a token around!\n\n- Be secure every step of the way\n\nWe’ve got several layers of security measures in place to protect your personal data. You only need to log in with your fingerprint or enter a 6-digit passcode to verify your identity for all transactions.\n\n- Log in like a pro with QR\n\nLog in by scanning a QR code using your SingPass Mobile QR code scanner. If you’re using a mobile device, simply tap on the QR code to launch the app.\n\n- Better together\n\nWe will be adding new features into the app to help you manage your data and transactions better, so keep your app updated!\n\nSET UP IN 3 EASY STEPS\n\nTo set up, all you need is a smartphone, an internet connection, and a registered SingPass account.\n\n- Step 1\nInstall SingPass Mobile by clicking the button above.\n\n- Step 2\nComplete a one-time set up.\n\n- Step 3\nYou’re all set. Log in to government digital services using your fingerprint or 6-digit passcode – it’s that simple!\n\nFEEDBACK\n\nWe want to hear from you! For feedback, questions or concerns,\nplease email us at support@singpass.gov.sg.\n\nNote: SingPass Mobile can only be installed on one device at a time.\n\nThis application is bought to you by the Government Technology Agency of Singapore.\n\n\n***\nDirected to singpassmobile.sg when you tapped the QR code during login?\n\nThis is due to a delay by iOS at times in retrieving the required configuration file (Apple-App-Site-Association), which is necessary for QR code tapping (Universal Link) to work.\n\nHere are some workarounds that worked well with other users experiencing this same issue:\n- try again later. Most users reported that iOS managed to retrieve the necessary config after some time\n- uninstall SingPass Mobile from your device, and download the app again from the official App Store",
      "appName": "SingPass Mobile",
      "releaseNotes": "Thanks for using SingPass Mobile! We’re working hard to optimise our app and have made some things a lot better in this release.\n\nWhat’s new:\n- Random crash fix during registration on iOS 9 and iOS 10\n- Speed improvement: App is now snappier than before\n- Stability enhancements and optimisations",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/singpass-mobile/id1340660807?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-27T01:01:37Z",
      "userRatingCount": 207,
      "size": "57348096",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "1.0.4",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.ndi.sp",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Beeline is Singapore's first marketplace for crowdsourced bus services. Our bus routes are derived from insights that we obtain from analysing transportation data and community demand. Private bus operators can make use of these findings to bring convenient, comfortable and direct transportation alternative to those who want them the most, at affordable prices.",
      "appName": "Beeline SG",
      "releaseNotes": "Bug fixes and UI improvements",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/beeline-sg/id1010615256?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-07T02:12:21Z",
      "userRatingCount": 25,
      "size": "21519360",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "3.7.0",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.beeline.beeline",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Moments of Life (Families) app is a Smart Nation initiative providing families with young children (aged 0-6) with a one-stop, convenient option to access government services and information.\n\nThe app features services offered by the Ministry of Social and Family Development (MSF), the Immigration & Checkpoints Authority (ICA), the Early Childhood Development Agency (ECDA), and the Health Promotion Board (HPB).\n\nKey features include:\n\n- Register a child’s birth and apply for the Baby Bonus Scheme online in a single form;\n- Search and indicate interest for suitable preschools through the use of geolocation technology, with accompanying fees and vacancy information;\n- Locate institutions that accept Child Development Account (CDA) funds;\n- Access a child’s medical appointments and immunisation records; and\n- Receive parenting information and event listings.\n\nThis app is optimised for iOS 9.0 and above.",
      "appName": "Moments of Life (Families)",
      "releaseNotes": "Bug fixes and improvements",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/moments-of-life-families/id1383218758?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-03-05T01:24:44Z",
      "userRatingCount": 41,
      "size": "26112000",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 4.5,
      "version": "1.4.2",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.app.mol",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Singapore Government.\n\nTired of managing travel claims and receipts? Look no further! My HR Kiosk makes capturing receipts, tracking trip distance and time quick, easy and hassle-free for officers. \nFeatures: \n\n1. Create travel expenses anytime, anywhere: \n• Option to create your expense during or after your trip.\n• Choose your mode of transport and log in your trip start and end locations and you are done!\n• If taking a cab, simply take a picture of your receipt and attach it with the claim.\n\n2. Submit your claims with just a click: \n• With all your receipts itemized in one place, easily review and manage your expenses and claims.\n• Simply add each expense and trip and easily submit your expense report to get reimbursed.\n\n3. Other features:\n• Predictive location recommendations and intuitive location search.\n• Multi-modality with the option to log in claims for taxi, car, bike, bus and MRT.\n• Recommended location based on organizational travel history.\n• Save your favorite locations and manage at a single place.\n\nWrite a review, share your experience and help us improve our app. Start claiming on the move now!",
      "appName": "My HR Kiosk",
      "releaseNotes": "Bug fixes for iPad",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/my-hr-kiosk/id1084593996?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-02T16:32:36Z",
      "userRatingCount": 14,
      "size": "53280768",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "3.0.8",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.sla.hrkiosk",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Wireless@SGx Sender App facilitates the Wireless@SGx connection setup on your computing device. It encrypts and send the user's Wireless@SGx credentials via email to your email account.",
      "appName": "Wireless@SGx Sender App",
      "releaseNotes": null,
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/wireless-sgx-sender-app/id1448121774?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-31T23:37:49Z",
      "userRatingCount": 0,
      "size": "57491456",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.govtech.wirelesssgx",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Digital Workplace is an initiative to improve the day-to-day working experiences through user-centric digital tools and solutions. \n\nFeel free to contact us if you have any feedback or suggestions.",
      "appName": "DWP Mobile",
      "releaseNotes": "Fixed some bugs.\n----------- \nWelcome to Digital Workplace! The team strives to provide a better experience for you with each new update.\n\nAs new capabilities are made available, we will update in the app! Feel free to contact us if you have any feedback or suggestions!",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/dwp-mobile/id1329488106?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-28T23:53:26Z",
      "userRatingCount": 8,
      "size": "77061120",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "1.3.1",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.digitalworkplace",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "CorpPass is the required login method for online transactions with the government. First launched for Singapore-registered business entities and SingPass-backed users, it is now available for foreigners who need to transact with the Singapore government.\n \nEnjoy the following benefits with CorpPass.\n•             Enhanced data protection for businesses and employees, with separate login IDs for corporate and personal matters\n•             Increased convenience to transact with multiple government agencies, with each user having a single corporate digital identity and no longer handling multiple login IDs for different services.\n•             Better internal control within businesses, as key personnel can grant and manage employees access to each government digital service.\n \nFor more information, visit https://www.corppass.gov.sg/corppass/common/userguides",
      "appName": "CorpPass 2FA for Foreigners",
      "releaseNotes": "Thanks for using CorpPass 2FA for Foreigners! We’re working hard to optimise our app and have made some things a lot better in this release.\nWhat’s new:\n- Stability enhancements and optimisations",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/corppass-2fa-for-foreigners/id1340764537?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-22T15:21:31Z",
      "userRatingCount": 8,
      "size": "14969856",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 5.0,
      "version": "1.0.7",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.ndi.cp",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "GOVTECH’s smARt Nation is an AR App created to illustrate how the Smart Nation Platform can work to serve the people in Singapore. The Smart Nation Platform aims to connect sensors island wide and pull together meaningful data to deliver Smart Nation applications for citizens. Explore up to three different Domains and see the enhancements to individuals’ lives enabled by advancements in technology.\nFollow this link to download the AR Marker images required to experience the Augmented Content: https://app.box.com/s/z1cbui7pqvi7oqqp3z0kz0ebcik7ik5m\n\nFeatures:\n•\tExplore up to 3 domains depicting the Heartland city of Singapore\n•\tAdorable and vibrant graphics that can engage audiences from every age group\n•\tFun way to learn how each character’s life can be improved with the Smart Nation Platform\n•\tTest your skills at tossing the Pins. Try to hit the target with as few attempts as possible",
      "appName": "smARt Nation",
      "releaseNotes": "- Grammar correction in Search Marker screen.\n- Change graphic in the end screen",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/smart-nation/id1160765046?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-10-06T01:52:03Z",
      "userRatingCount": 0,
      "size": "106166272",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "3",
      "minimumOsVersion": "8.0",
      "bundleId": "com.eonreality.SmartNationIDA",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Beeline Driver App is built for Beeline's bus operator partners. \nOnly registered Beeline drivers will be able to use the app.\n\nBeeline is Singapore’s first marketplace for crowdsourced bus services. Our bus routes are derived from insights that we obtain from analysing transportation data and community demand. Private bus operators can make use of these findings to bring convenient, comfortable and direct transportation alternative to those who want them the most -- at affordable prices.",
      "appName": "Beeline Driver",
      "releaseNotes": "Added links to navigate in Google Maps",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/beeline-driver/id1131152564?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-15T03:52:23Z",
      "userRatingCount": 0,
      "size": "14598144",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.3.3",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.beeline.driver",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Singapore Government.\n\nThe \"Events Kiosk\" is a simple to use mobile application that allow staffs to organize official and casual corporate activities within the organization.  With technology at our finger tips, we are making it easier to collaborate and increase in productivity by eliminating administrative work such as collating RSVP and attendance on paper.  Imagine when your invitees list is long and tracking the change of status is a pain.  Events in its alpha stage now, lies a great opportunites ahead in incorporating more services and functionalities that could bring the collaboration and productivity to a new level.  Join us and help us to grow.\n\n-  Creates new events or meetings.\n-  Invite staffs or entire department in just one-click.\n-  Invitees check-in by just one-scan at host's QR code.\n-  Option to enable check-in with location based.\n-  Download RSVP and attendance list.",
      "appName": "Events Kiosk",
      "releaseNotes": "Minor bug fixes when check in event",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://itunes.apple.com/sg/app/events-kiosk/id1289136064?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-07-13T17:01:27Z",
      "userRatingCount": 0,
      "size": "30306304",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/government-technology-agency/id1201157247?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.3",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.govtech.events",
      "agencyFullName": "GOVERNMENT TECHNOLOGY AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Get the latest commonly used statistics on Singapore’s economy and population from SingStat App. Data are presented in user-friendly charts and tabular formats.\nFor more detailed Singapore statistics, please visit www.singstat.gov.sg.\n\nThe mobile application is designed for devices with iOS 7 and above.",
      "appName": "SingStat",
      "releaseNotes": "Minor adjustments",
      "developerName": "Singapore Department of Statistics",
      "appViewUrl": "https://itunes.apple.com/sg/app/singstat/id935197005?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-28T01:33:51Z",
      "userRatingCount": 5,
      "size": "31006720",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-department-of-statistics/id935197004?mt=8&uo=4",
      "averageUserRating": 5.0,
      "version": "1.5.3",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.singstat",
      "agencyFullName": "MINISTRY OF TRADE AND INDUSTRY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Find the latest deals and events happening in one-north with the one-north Mobile App! Enjoy a plethora of promotions ranging from F&B, consumer products and lifestyle services, and participate in concerts, performances and fitness activities held in the estate. Keep up-to-date with push notifications to your mobile device!\n\nWith 7 unique precincts sited within a 200 hectare development, one-north presents abundant opportunities for the elements of its Work-Live-Play-Learn vision. Having problems finding your destination in the expansive estate? The one-north Mobile App comes with maps to ensure that you can navigate your way around with ease. \n\nBrowse through estate news and test your knowledge of one-north with our quarterly newsletter, Pulse @ one-north, embedded in the app.\n\nDownload the one-north Mobile App today!",
      "appName": "one-north",
      "releaseNotes": "Refreshed home page design with a new side menu for a much easier navigation of features!",
      "developerName": "JTC Corporation",
      "appViewUrl": "https://itunes.apple.com/sg/app/one-north/id1046416283?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-12T01:44:10Z",
      "userRatingCount": 5,
      "size": "38877184",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/jtc-corporation/id477667158?mt=8&uo=4",
      "averageUserRating": 5.0,
      "version": "1.6",
      "minimumOsVersion": "8.0",
      "bundleId": "com.jtc.onenorth",
      "agencyFullName": "JTC CORPORATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "\"Report-A-Fault\" is a mobile application that provides a convenient channel for reporting issues (e.g. Cleanliness, Defects, etc.) of properties under JTC. Users will take photos of defects, select the specific JTC property based on location, input short descriptions and feedback submission would be routed to JTC Officers instantly.",
      "appName": "Report-A-Fault",
      "releaseNotes": "Minor text fix",
      "developerName": "JTC Corporation",
      "appViewUrl": "https://itunes.apple.com/sg/app/report-a-fault/id1145216739?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-29T20:49:10Z",
      "userRatingCount": 0,
      "size": "9849856",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/jtc-corporation/id477667158?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.0.7",
      "minimumOsVersion": "9.2",
      "bundleId": "sg.gov.jtc.app.mobile.feedback.p",
      "agencyFullName": "JTC CORPORATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Find out what are the latest F&B deals and events with this app. Participate in classes and activities happening in the park. Getting around the park or looking for a company in the park? The app comes with maps with real-time tracking of the park’s shuttle buses.  \n \nDownload the Seletar Aerospace Park mobile app today!",
      "appName": "Seletar Aerospace Park",
      "releaseNotes": "New and improved look of Shuttle Bus feature",
      "developerName": "JTC Corporation",
      "appViewUrl": "https://itunes.apple.com/sg/app/seletar-aerospace-park/id1245105129?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-10-11T19:55:27Z",
      "userRatingCount": 0,
      "size": "25082880",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/jtc-corporation/id477667158?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.6.0",
      "minimumOsVersion": "8.0",
      "bundleId": "com.jtc.appsapv2",
      "agencyFullName": "JTC CORPORATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The JTC Survey Fee Calculator application is developed by JTC Corporation to provide users an estimate of the survey fees payable for a range of survey works required. These survey works include:\n\n - Lease Allocation Survey\n - Temporary Occupation License (TOL) Survey\n - Subdivision Survey\n - Amalgamation Survey\n\nBesides calculating the total survey fee, the application will present a breakdown of the components as follows:\n\n - JTC Survey Fee\n - URA Processing Fee (where applicable)\n - SLA Survey Fee (where applicable)\n - Goods and Services Tax (GST)\n\nAbout JTC Corporation\nJTC Corporation (JTC) is Singapore’s leading industrial infrastructure specialist spearheading the planning, promotion and development of a dynamic industrial landscape.  \n\nFor more than 40 years, JTC has played a key role in the growth of the economy by providing cutting-edge industrial real estate solutions. Some of its landmark projects include wafer fabrication parks, business parks, Biopolis and Fusionopolis at one-north, a chemicals hub on Jurong Island, biomedical parks as well as logistics hubs for various industries. These industrial and business parks are now home to renowned global companies and promising local enterprises.   \n\nToday, JTC continues to break new ground with pioneering projects that anticipate and address the future needs of industry. The Jurong Rock Caverns look to subterranean depths to optimise land use; Seletar Aerospace Park and Tukang Innovation Park support the growth of new industry clusters in aerospace and innovation activities; CleanTech Park, Singapore's first eco-business park, offers unique clean technology features and also serves as a 'living lab' for the test-bedding and development of green technologies and sustainable urban solutions; and the Jurong Island Version 2.0 initiative plans to cut carbon emissions and enhance competitiveness of the chemicals hub.\n\nAs Singapore transforms itself for the future, JTC will partner with its customers to understand their evolving needs and develop appropriate 'future-ready' infrastructure solutions. The Corporation will continue to expand its innovation capacity and offer infrastructure facilities of a calibre that sets the city state apart as an investment location. JTC will hence position itself as an industrial infrastructure innovator that creates value for its customers by developing the optimal infrastructure solutions that they aspire. This will help differentiate Singapore and propel it to the next level of growth.\n\nFor more information on JTC and its products and services, please visit www.jtc.gov.sg.",
      "appName": "JTCSurveyFee",
      "releaseNotes": "Look and feel updated, removed redundant code.",
      "developerName": "JTC Corporation",
      "appViewUrl": "https://itunes.apple.com/sg/app/jtcsurveyfee/id510897368?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-07-26T16:25:46Z",
      "userRatingCount": 0,
      "size": "2227200",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/jtc-corporation/id477667158?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.6",
      "minimumOsVersion": "8.0",
      "bundleId": "com.jtc.surveyfee",
      "agencyFullName": "JTC CORPORATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Life.\nIt’s not about looking perfect, eating perfect, or being perfect.\n\nIt’s simply a journey about trying - taking little steps to form small habits in our daily lives that can make a big impact.\n\nWith Active Health Labs being rolled out island-wide managed by qualified Active Health Experts, an Active Health app to keep track of your fitness progress, and fun community activities, it’s never been easier to proactively own your health.\n\nBesides allowing you to take some assessment tests, this app will also import activity data from HealthKit/Health App. By putting together data from various domains, my Active Health app provides an overview of your health status, aiding you in this Active Health Journey. \n\nLet’s all live life to the fullest.\n\nAnd remember, #betterbeatsperfect",
      "appName": "My Active Health",
      "releaseNotes": "Enhancements to support ActiveFit",
      "developerName": "Singapore Sports Council",
      "appViewUrl": "https://itunes.apple.com/sg/app/my-active-health/id1332547806?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-15T15:47:03Z",
      "userRatingCount": 7,
      "size": "74529792",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-sports-council/id984473669?mt=8&uo=4",
      "averageUserRating": 4.0,
      "version": "1.4.0",
      "minimumOsVersion": "8.0",
      "bundleId": "com.ahms.sg",
      "agencyFullName": "SPORT SINGAPORE"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "SG TravelKaki provides you with important information on what travellers can (and cannot) bring back into Singapore from their overseas trips. \n\nThe app also allows you to:\n\n1. View the latest travel notices and advice for Singaporeans going overseas\n2. Sign up for eRegister on the go \n\nSG TravelKaki app is created by Agri-Food & Veterinary Authority of Singapore and supported by:\n\n• Central Narcotics Bureau\n• Health Sciences Authority\n• Immigration & Checkpoints Authority of Singapore\n• Ministry of Foreign Affairs\n• Singapore Customs\n• Singapore Police Force\n\nLet us know what you think and how we can improve the app at ava_apps@ava.gov.sg.",
      "appName": "SG TravelKaki",
      "releaseNotes": "Minor bugs fixed on email portion",
      "developerName": "Agri-Food & Veterinary Authority of Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/sg-travelkaki/id850892055?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-09-13T21:02:45Z",
      "userRatingCount": 5,
      "size": "14126080",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/agri-food-veterinary-authority-of-singapore/id850892058?mt=8&uo=4",
      "averageUserRating": 4.5,
      "version": "2.1.6",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.ava.sgtravelkaki",
      "agencyFullName": "AGRI-FOOD & VETERINARY AUTHORITY OF SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "\"SkillsFuture@PublicService”\n\nThis application is a service of the Government of Singapore.\n\nLEARN is a one-stop digital learning platform that lets you learn wherever you go. It also gives you all that you need to upskill and reskill in a digital workplace.\n\nDiscover a world of learning resources with CSC’s proprietary content and curated learning pathways from renowned third-party content providers.\n\nSharpen your skills with personalised content according to Public Service Competency Frameworks and your learning needs.\n\nActivate your account and LEARN today!",
      "appName": "LEARN.gov.sg",
      "releaseNotes": "Bug fixes to ordering of courses in the Discover Page.",
      "developerName": "Civil Service College",
      "appViewUrl": "https://itunes.apple.com/sg/app/learn-gov-sg/id1441520590?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-21T15:32:12Z",
      "userRatingCount": 26,
      "size": "41847808",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/civil-service-college/id1251778080?mt=8&uo=4",
      "averageUserRating": 2.0,
      "version": "1.07",
      "minimumOsVersion": "11",
      "bundleId": "cxs.cscollege.learn",
      "agencyFullName": "CIVIL SERVICE COLLEGE"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "The CSC Events app is an all-in-one cross platform learning companion for conferences, seminars and events organised by Civil Service College, Singapore.  It provides learners access to speaker, agenda information and resources, with the ability to take digital notes. It also allows learners to interact and connect through discussion boards, polls, live Q&A and real-time photo/ canvas sharing.",
      "appName": "CSC Events",
      "releaseNotes": null,
      "developerName": "Civil Service College",
      "appViewUrl": "https://itunes.apple.com/sg/app/csc-events/id1251778081?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-06-29T23:09:48Z",
      "userRatingCount": 0,
      "size": "35617792",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/civil-service-college/id1251778080?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "4.0.1",
      "minimumOsVersion": "8.0",
      "bundleId": "com.cscollege.micepad",
      "agencyFullName": "CIVIL SERVICE COLLEGE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "MySkillsFuture is your personal guide for skills upgrading and career planning. Find courses to enhance your skills, attend the latest events and workshops near you, browse bite-sized articles on the go, and access an extensive library, including articles, e-books and industry insights, to enrich yourself.",
      "appName": "MySkillsFuture",
      "releaseNotes": "• Log in using Facebook. More social media platforms will be available soon. \n\n• Edit your contact details in Profile\n\n• New courses have a ‘New’ icon in blue\n\n• Minor fixes and improvements",
      "developerName": "SkillsFutureSG",
      "appViewUrl": "https://itunes.apple.com/sg/app/myskillsfuture/id1256315705?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-12T02:10:09Z",
      "userRatingCount": 27,
      "size": "17739776",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/skillsfuturesg/id1256315704?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "3.1.0",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.skillsfuture.msf",
      "agencyFullName": "SKILLS FUTURE SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Cardiopulmonary resuscitation (CPR) is identified as the essential life-saving skill that would positively improve the survival rate in a cardiac emergency situation. Through the application of mobile technologies in an environment of high mobile phone penetration, SHF hopes to empower everyone with the skills and confidence to administer CPR anytime and anywhere.\n\nHeart4Life is a handy tool to keep track of your heart health. It features an overview of how to do CPR (available in English & Mandarin), assesses your heart risk and even has a CPR mode for emergency situations.\n\nYou can also locate the AEDs around you, and find a listing of available AEDs in Singapore.",
      "appName": "Heart4Life",
      "releaseNotes": "Stability update to successfully locate AEDs around user.",
      "developerName": "ITE College East",
      "appViewUrl": "https://itunes.apple.com/sg/app/heart4life/id706733884?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-05-01T23:07:14Z",
      "userRatingCount": 0,
      "size": "47689728",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ite-college-east/id685277621?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.4",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.myheart.Heart4Life",
      "agencyFullName": "INSTITUTE OF TECHNICAL EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Companion mobile app for the ITE-VTC International Student Seminar 2017 (27 - 29 June), Singapore. View the programme schedule, speaker information, campus map, recreation information, emergency contacts and provide feedback all through the app.",
      "appName": "ITE-VTC ISS2017",
      "releaseNotes": "- Updated Programme Schedule\n- Added NUS Utown section\n- Updated ITE College West map\n- Updated Rest & Recreation information\n- Updated Emergency Nos.\n- Bug fixes to ISS Feedback",
      "developerName": "ITE College East",
      "appViewUrl": "https://itunes.apple.com/sg/app/ite-vtc-iss2017/id1242985351?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-06-21T19:19:07Z",
      "userRatingCount": 0,
      "size": "21518336",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ite-college-east/id685277621?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1.0",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.ite.iss2017",
      "agencyFullName": "INSTITUTE OF TECHNICAL EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Government of Singapore. The PaC@Gov mobile application is developed by the Accountant-General’s Department to provide Singapore Government serving officers and pensioners with convenient access to their pay, claims and medical bills information. They can submit claims on-the-go and receive notifications anytime, anywhere. \nDate of official launch: 6 February 2017\nIf you have any query on the application, please send it to us via the “Help” icon on the menu page. By downloading, you agree to the Terms of Use and Privacy Statement of the PaC@Gov Mobile App.",
      "appName": "PaC@Gov",
      "releaseNotes": "- Fixed invalid last used verifier and certifier\n- Built with iOS 12 SDK\n\nWe update the app regularly to make it better for you. Get the latest version to enjoy all available features and improvements. Thank you for using PaC@Gov Mobile App!",
      "developerName": "Accountant-General’s Department",
      "appViewUrl": "https://itunes.apple.com/sg/app/pac-gov/id1177267613?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-19T01:23:14Z",
      "userRatingCount": 55,
      "size": "240934912",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/accountant-generals-department/id1108787647?mt=8&uo=4",
      "averageUserRating": 4.0,
      "version": "2.5.0",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.agd.pac",
      "agencyFullName": "MINISTRY OF FINANCE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Government of Singapore. \nThe Vendors@Gov mobile application is developed by the Accountant-General’s Department to facilitate government vendors to monitor their invoices and payments on the go. Vendors can also receive notifications on their invoices, as well as changes in their account status and details.\n\nDate of official launch: 15 June 2016\n\nTo provide feedback on the application, please email us at https://app.helpdesk.agd.gov.sg/public_user/vendor/vendor/helpdesk.aspx.\nBy downloading, you agree to the Terms of Use and Privacy Statement of the Vendors@Gov Mobile App.",
      "appName": "Vendors@Gov",
      "releaseNotes": "Targeted IOS SDK 12.1",
      "developerName": "Accountant-General’s Department",
      "appViewUrl": "https://itunes.apple.com/sg/app/vendors-gov/id1108787648?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-03-04T01:40:31Z",
      "userRatingCount": 15,
      "size": "15167488",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/accountant-generals-department/id1108787647?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "1.4.4",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.agd.vendors",
      "agencyFullName": "MINISTRY OF FINANCE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "CEA@SG features the CEA Public Register and Consumer Resources to help consumers make informed decisions in their property transactions.\n\nThe CEA Public Register is a free m-service that enables consumers to:\n- Check whether a real estate agent is licensed by CEA.\n- Check whether a salesperson is registered with CEA.\n- Know whether a real estate agent or salesperson has been disciplined by CEA within the last three years.\n- Know whether any awards have been conferred on a real estate agent or salesperson by CEA.\n\nThe Consumer Resources you can access on this app include CEA's Consumer Guides, Press Releases and CEAnergy e-Newsletter.\n\nThe Council for Estate Agencies (CEA) is the regulator of the real estate agency industry in Singapore and a statutory board under the Ministry of National Development.",
      "appName": "CEA@SG",
      "releaseNotes": "Minor bug fixes",
      "developerName": "Council for Estate Agencies",
      "appViewUrl": "https://itunes.apple.com/sg/app/cea-sg/id557473132?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-06-04T01:28:22Z",
      "userRatingCount": 18,
      "size": "3428352",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/council-for-estate-agencies/id557473135?mt=8&uo=4",
      "averageUserRating": 1.5,
      "version": "2.3",
      "minimumOsVersion": "6.1",
      "bundleId": "sg.gov.cea.ceasg",
      "agencyFullName": "COUNCIL FOR ESTATE AGENCIES"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Parents Gateway is an initiative by MOE to enable parents to interact with schools more conveniently on administrative matters. Parents will also be able to use this app to stay updated on school’s programme and activities.\n\nThe mobile app is currently only available in selected schools and will be progressively rollout to all schools subsequently.\n\nWe appreciate if you can share with us your feedback to help MOE enhance and improve the experience, benefiting more parents in future.",
      "appName": "Parents Gateway",
      "releaseNotes": "- Bug fix for push notifications",
      "developerName": "Ministry of Education (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/parents-gateway/id1267198708?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-20T02:14:24Z",
      "userRatingCount": 66,
      "size": "15300608",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-education-singapore/id852187844?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "2.1.3",
      "minimumOsVersion": "8.0",
      "bundleId": "com.moe.pgp",
      "agencyFullName": "MINISTRY OF EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Easy to play challenging Malay language word puzzle! \n\nRearrange the scrambled letters to form words. To advance to the next level, find and underline the longest word or unscramble to find all the possible words in the puzzle.\n\nChoose to play in a leisure un-timed mode, or go up against the clock in timed rounds. Compete with other players in Challenge mode.\n\nWords formed must not be from the following variations:\n\n- Colloquial language / dialects\n- Short forms\n- Sounds\n- Ancient language",
      "appName": "Cambahan Kata",
      "releaseNotes": null,
      "developerName": "Ministry of Education (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/cambahan-kata/id1154382632?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-09-21T13:22:15Z",
      "userRatingCount": 0,
      "size": "83319808",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-education-singapore/id852187844?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "6.0",
      "bundleId": "com.moe.cambahanKata",
      "agencyFullName": "MINISTRY OF EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "C(SP) Interactive Resource Package is a web portal hosting digital resources for the 2015 Secondary Chinese (Special Programme) Syllabus. The content is set in localized contexts, making it highly relevant to our students’ lives. There is also a series of activities such as language games and role-playing activities, designed to reinforce students’ learning and to make learning fun and meaningful for pupils, both in and out of the classrooms.",
      "appName": "C(SP) 2A",
      "releaseNotes": "Bug Fixes",
      "developerName": "Ministry of Education (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/c-sp-2a/id1082966887?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-03-31T23:37:05Z",
      "userRatingCount": 0,
      "size": "1759346688",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-education-singapore/id852187844?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.3",
      "minimumOsVersion": "6.0",
      "bundleId": "com.moe.csp2a",
      "agencyFullName": "MINISTRY OF EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "C(SP) Interactive Resource Package is a web portal hosting digital resources for the 2015 Secondary Chinese (Special Programme) Syllabus. The content is set in localized contexts, making it highly relevant to our students’ lives. There is also a series of activities such as language games and role-playing activities, designed to reinforce students’ learning and to make learning fun and meaningful for pupils, both in and out of the classrooms.",
      "appName": "CSP3A",
      "releaseNotes": null,
      "developerName": "Ministry of Education (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/csp3a/id1199461956?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-07-03T03:40:05Z",
      "userRatingCount": 0,
      "size": "625954816",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-education-singapore/id852187844?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "7.0",
      "bundleId": "com.PinheadInteractive.CSP3",
      "agencyFullName": "MINISTRY OF EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "C(SP) Interactive Resource Package is a web portal hosting digital resources for the 2015 Secondary Chinese (Special Programme) Syllabus. The content is set in localized contexts, making it highly relevant to our students’ lives. There is also a series of activities such as language games and role-playing activities, designed to reinforce students’ learning and to make learning fun and meaningful for pupils, both in and out of the classrooms.",
      "appName": "C(SP) 2B",
      "releaseNotes": null,
      "developerName": "Ministry of Education (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/c-sp-2b/id1196268378?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-02-18T03:10:31Z",
      "userRatingCount": 0,
      "size": "2489451520",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-education-singapore/id852187844?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "6.0",
      "bundleId": "com.moe.csp2b",
      "agencyFullName": "MINISTRY OF EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "C(SP) Interactive Resource Package is a web portal hosting digital resources for the 2015 Secondary Chinese (Special Programme) Syllabus. The content is set in localized contexts, making it highly relevant to our students’ lives. There is also a series of activities such as language games and role-playing activities, designed to reinforce students’ learning and to make learning fun and meaningful for pupils, both in and out of the classrooms.",
      "appName": "CSP 3B",
      "releaseNotes": null,
      "developerName": "Ministry of Education (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/csp-3b/id1273083374?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-08-29T16:26:27Z",
      "userRatingCount": 0,
      "size": "642305024",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-education-singapore/id852187844?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "7.0",
      "bundleId": "com.MOE.CSP3B",
      "agencyFullName": "MINISTRY OF EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "SP Mobile is a Singapore Polytechnic (SP) mobile application. Established in 1954, SP is Singapore’s first polytechnic. SP offers full-time diploma courses and a wide range of continuing education programmes to its students. SP alumni includes successful entrepreneurs, well-known professionals, and leaders in government.\n\nSP Mobile provides a single point access to commonly used tools for students and staff in SP to learn and work. Some features are also available to public. The app can be personalised by customising favourite apps list on the home page to easily access the frequently used features.\n\nTip : When you first login, please tap on \"Ok\" at the Push Notifications prompt. You will receive useful alerts, such as such as Library, SAS and News, from SP. \n\nNote : SP Mobile is supported in the two latest iOS versions. Upgrade to the latest iOS version in order to enjoy the full features on SP Mobile.\n\nIMPORTANT: This is not the full-feature version. Additional features will be included in stages in subsequent releases.",
      "appName": "SP Mobile v2",
      "releaseNotes": "- App crash issue on some devices\n- Improved app performance\n- Showing of update pop-up for new app release\n- Other minor bug fixes",
      "developerName": "Singapore Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/sp-mobile-v2/id1339445798?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-01T04:10:52Z",
      "userRatingCount": 106,
      "size": "106009600",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-polytechnic/id410480187?mt=8&uo=4",
      "averageUserRating": 1.5,
      "version": "2.1.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.sp.spmobilev2",
      "agencyFullName": "SINGAPORE POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "SP MS Formulae App is the mobile version of MS Mathematical Formulae & Tables used in Singapore Polytechnic.\n\nThis mobile app provides the convenience to look for formulae through your mobile device. In this app, the formulae are organised according to the following topics:\n\n           1. Algebra\n           2. Determinants\n           3. Matrices\n           4. Trigonometry\n           5. Complex Numbers\n           6. Differentiation\n           7. Integration\n           8. Differential Equation\n           9. Series\n          10. Probability\n          11. Statistics\n          12. Standard Normal Table\n          13. Laplace Transforms\n          14. Analytic Geometry\n          15. Vectors\n          16. Hyperbolic Function\n          17. Boolean Algebra\n\nBy choosing each of the above topics, the app will lead you to a menu of further subtopics to refine your search. The displayed formulae will fit nicely to the width of your screen.",
      "appName": "SP MS Formulae App",
      "releaseNotes": "- Enhanced User Interface.",
      "developerName": "Singapore Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/sp-ms-formulae-app/id488067689?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-02-27T02:04:58Z",
      "userRatingCount": 0,
      "size": "19752960",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-polytechnic/id410480187?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.3",
      "minimumOsVersion": "9.3",
      "bundleId": "com.sp.edu.sg.SP-MSformula",
      "agencyFullName": "SINGAPORE POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This app provides users with four useful financial calculators, namely, a Savings Calculator, Goal Savings Calculator, Debt Repayment Calculator and Debt Duration Calculator. Results of calculations can be exported via email.\n \nThis app also provides information about the MoneySENSE - Singapore Polytechnic Institute For Financial Literacy and the free financial programmes that we offer.\n\nThe Institute for Financial Literacy (IFL) is a collaboration between MoneySENSE (a national financial education programme spearheaded by the public-sector Financial Education Steering Committee) and Singapore Polytechnic to provide free and unbiased financial education programmes to the public. The IFL provides education and does not promote financial products.\n\n\nVisit our website at http://www.finlit.sg for more information.\n\n\nSP Mobile is a Singapore Polytechnic (SP) mobile application. Established in 1954, SP is Singapore's first polytechnic. Its ten academic schools offer 47 full-time diploma courses for its 16,000 students. Among SP's 190,000 graduates are successful entrepreneurs, top executives in multinational and public-listed corporations, and well-known professionals.",
      "appName": "SP IFL",
      "releaseNotes": "-iOS 9 fixes.",
      "developerName": "Singapore Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/sp-ifl/id599841871?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-10-05T20:22:42Z",
      "userRatingCount": 0,
      "size": "5642240",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-polytechnic/id410480187?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.5",
      "minimumOsVersion": "5.1.1",
      "bundleId": "sg.edu.sp.spifl",
      "agencyFullName": "SINGAPORE POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "SGWorkPass is a free mobile app to check the validity of work passes / long term passes issued by the Singapore Ministry of Manpower (MOM).\n \nA must have app for all employers, foreign employees, agents or anyone who wishes to verify if a work pass / long term pass card issued by MOM is valid. You will need a Singapore mobile number for a one-time registration in order to start using the app.\n \nScan it to check it\nA work pass / long term pass could be cancelled before it expires as employment / stay status can change over time. When this happens, the pass holder is not allowed to continue working / staying in Singapore. Simply launch the SGWorkPass app to scan the QR code of a work pass / long term pass card and you can verify its validity instantly.\n \nNo QR Code? No problem!\nIf the work pass / long term pass card doesn’t have a QR code, you can verify it using the unique Card Serial Number printed on the card.",
      "appName": "SGWorkPass",
      "releaseNotes": "System enhancements",
      "developerName": "Ministry of Manpower",
      "appViewUrl": "https://itunes.apple.com/sg/app/sgworkpass/id1274061632?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-10-15T02:38:48Z",
      "userRatingCount": 63,
      "size": "94994432",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-manpower/id518542249?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "1.0.5",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.mom.sgworkpass",
      "agencyFullName": "MINISTRY OF MANPOWER"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Are your muscles stiff and aching after sitting for long hours at your desk? How can you improve your lifting posture?\n\nIntroducing ergo@WSH – a mobile application on ergonomics developed by the Workplace Safety and Health (WSH) Institute, Singapore for iOS smart phones and tablets.\n\nWhat is it? \nergo@WSH is meant for both WSH professionals and the general public. WSH professionals can use it as a tool to identify ergonomic hazards in the workplace and provide recommendations to prevent musculoskeletal complaints. It can also help to raise general awareness of good postures. \n\nYou will find that ergo@WSH is easy-to-use to:\n- Evaluate sitting and lifting postures using photographs and videos\n- Receive tips on how to improve postures\n- Monitor changes in posture and health complaints over time \n- Share posture analysis results via Facebook, Twitter, email\n- Receive stretching exercise tips \n- Set exercise reminders \n\nDownload ergo@WSH today for a safer and healthier you!",
      "appName": "ergo@WSH",
      "releaseNotes": "Minor bug fix",
      "developerName": "Ministry of Manpower",
      "appViewUrl": "https://itunes.apple.com/sg/app/ergo-wsh/id556877197?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-09-14T02:32:46Z",
      "userRatingCount": 10,
      "size": "62410752",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-manpower/id518542249?mt=8&uo=4",
      "averageUserRating": 4.5,
      "version": "3.0.3",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.mom.final.Ergo-work-Beta",
      "agencyFullName": "MINISTRY OF MANPOWER"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "DormWatch is a mobile app which allows users (such as foreign workers), to report on defects, broken facilities/ equipment directly to the dormitory operator. The app aims to encourage operators to self-regulate and fix the issues identified by users. It also tracks, monitors and alerts parties of that latest status updates. MOM will also be kept informed on the progress of the issues identified; MOM would be able to step in and inspect the premises if deemed necessary.",
      "appName": "DormWatch",
      "releaseNotes": "App is now available in Tamil language \nImproved interface for map pins",
      "developerName": "Ministry of Manpower",
      "appViewUrl": "https://itunes.apple.com/sg/app/dormwatch/id1429488237?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-26T22:48:46Z",
      "userRatingCount": 0,
      "size": "27378688",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-manpower/id518542249?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.mom.dormwatch",
      "agencyFullName": "MINISTRY OF MANPOWER"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is jointly developed by Ministry of Manpower (MOM) and Workplace Safety and Health Council (WSHC).\nSnapSAFE is a free mobile app that allows the public to report workplace safety and health issues in Singapore. Use this SnapSAFE app to \n\tReport workplace safety and health lapses to Ministry of Manpower and the occupier\n\tReport workplace safety and health lapses within your company. The information will not be sent to Ministry of Manpower",
      "appName": "SnapSAFE",
      "releaseNotes": "minor bug fixes",
      "developerName": "Ministry of Manpower",
      "appViewUrl": "https://itunes.apple.com/sg/app/snapsafe/id1245498483?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-12T06:43:29Z",
      "userRatingCount": 6,
      "size": "29257728",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-manpower/id518542249?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "1.2.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.mom.SnapSafe",
      "agencyFullName": "MINISTRY OF MANPOWER"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Volunteers are notified via the myResponder Mobile App by SCDF’s 995 Ops Centre of any Cardiac Arrest Case within 400 metres of their location. If you are notified, you may choose to respond to the incident and offer your assistance. The Mobile App will highlight nearby AEDs that may be available. \n\nOnce you have located the victim suffering from cardiac arrest, you can assist the original caller who alerted SCDF in performing CPR or helping to apply the AED to revive the patient. SCDF’s 995 Ops Centre may also ask responders to guide the ambulance crew by escorting them to the incident site.\n\nIf you are 15 years and above and wish to volunteer, be sure to get your SingPass ID and password ready. If you are under 18 years old, please seek parental consent for your participation. Your handphone number is also required for SCDF to get in touch with you during an emergency. \n\nYour response is entirely voluntary, and we only encourage you to respond when you are available and to do so within safe and reasonable means.\n\nmyResponder is the latest project by the Singapore Civil Defence Force. The myResponder Mobile App alerts volunteers to nearby Cardiac Arrest Cases to render first aid before ambulance arrival. With myResponder, volunteers will have the following services at their fingertips:\n\n- Geolocation notification of nearby cases\n- Display of nearby incidents using OneMap\n- Display of nearby AEDs using OneMap\n- Geolocation enabled dialling of 995\n- Access to the National AED Registry\n\nPlease note that continued use of GPS running in the background can dramatically decrease battery life.\n\nThe Singapore Civil Defence Force – The Lifesaving Force",
      "appName": "myResponder",
      "releaseNotes": "myResponder version 3.2.1 is now live! Older versions will cease to be supported. Users are encouraged to download the latest version to continue receiving case notifications.\n\nNew features include:\n· Display of additional information such as operating hours of AED-installed premises.\n· Nearest lamp post will now be highlighted if the incident is within a park.\n· Users can check connectivity settings in the Support page.\n· Bug fixes for Notification and Location services.",
      "developerName": "Singapore Civil Defence Force",
      "appViewUrl": "https://itunes.apple.com/sg/app/myresponder/id983494391?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-09-24T04:17:35Z",
      "userRatingCount": 42,
      "size": "72540160",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-civil-defence-force/id983494390?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "3.2.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.scdf.myResponder",
      "agencyFullName": "MINISTRY OF HOME AFFAIRS"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "mySCDF, the latest initiative from the Singapore Civil Defence Force (SCDF), is a mobile application providing members of public with these features:\n\n1.      Fire Safety Feedback module – Spot any fire safety violations or fire hazards? Submit your feedback to SCDF via the Fire Safety Feedback module! With every feedback submission, you are able to:\n\n·        Capture up to 5 pictures\n\n·        Drop pin on a location on a map\n\n·        Choose either Fire Hazards of Fire Safety Violation category\n\n·        Write a brief description of the violation\n\n2.      Fire Extinguisher module – What should you do when a fire breaks out? Do you know how to operate a fire extinguisher so as to help put out the fire? Launch the pictorial guide developed by SCDF to find out more on how to operate a fire extinguisher.",
      "appName": "mySCDF",
      "releaseNotes": "- Added link to Home Fire Alarm Device e-Service.\n- Bug fixes",
      "developerName": "Singapore Civil Defence Force",
      "appViewUrl": "https://itunes.apple.com/sg/app/myscdf/id630598023?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-05-02T04:06:36Z",
      "userRatingCount": 15,
      "size": "45527040",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-civil-defence-force/id983494390?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "1.2.2",
      "minimumOsVersion": "8.0",
      "bundleId": "com.raptech.mySCDF",
      "agencyFullName": "MINISTRY OF HOME AFFAIRS"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of the Singapore Government.\n\nSee an interesting animal or plant? Share it with us through this SGBioAtlas app! SGBioAtlas is a citizen-science platform for nature lovers to share their biodiversity sightings and uses crowd-sourced information to map the distribution of flora and fauna across Singapore. It is not only simple to use, it is also a fun way to learn more about the amazing diversity of animals and plants in our City in a Garden. Every sighting you record will contribute to our database of precious local biodiversity. \n\nThis app is brought to you by the National Parks Board (NParks) as part of the Community in Nature (CIN) initiative. As the lead agency on nature conservation, NParks has developed an urban biodiversity conservation model, which aims to conserve representative eco-systems in land-scarce Singapore.  NParks also monitors and coordinates measures to enhance the presence of biodiversity in our urban landscape. \n\nDate released: 16 April 2015\n\nFor technical issues, please e-mail biome_support@neseapl.com\n\nFor general queries, please e-mail CIN@nparks.gov.sg.",
      "appName": "SGBioAtlas",
      "releaseNotes": "1.New edit sighting feature\n2.UI refinement for the application\n3.Bug Fix",
      "developerName": "National Parks Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/sgbioatlas/id975080923?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-09-28T17:49:06Z",
      "userRatingCount": 12,
      "size": "273852416",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/national-parks-board/id975080922?mt=8&uo=4",
      "averageUserRating": 1.5,
      "version": "2.0",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.SGBioAtlas",
      "agencyFullName": "NATIONAL PARKS BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "ITE Attendance allows the ITE students and staff to view attendances and time-table. It works in tandem with the Automatic Attendance Alert system for back-end data. The app requires codes that are generated and only for ITE College  staff and students only.",
      "appName": "ITE Attendance",
      "releaseNotes": null,
      "developerName": "CCK",
      "appViewUrl": "https://itunes.apple.com/sg/app/ite-attendance/id1335539280?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-01-17T18:39:07Z",
      "userRatingCount": 0,
      "size": "21489664",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/cck/id536157349?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "9.0",
      "bundleId": "ite.rajeshrmohan.attendanceITE",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This app allows easy navigation of ITE CW Student Handbook as well as other useful features for students. Features include \n\n1. Student Handbook\n2. Financial Assistance Schemes\n3. Login to myPortal\n4. Hotlines\n5. Location\n6. Navigation\n\nIt also includes shortcut to Facebook, Twitter and Instagram of ITE CW.",
      "appName": "ITE Handbook",
      "releaseNotes": "Updated Student Handbook.",
      "developerName": "CCK",
      "appViewUrl": "https://itunes.apple.com/sg/app/ite-handbook/id1232536955?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-06-07T19:44:32Z",
      "userRatingCount": 0,
      "size": "22653952",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/cck/id536157349?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "9.3",
      "bundleId": "com.rajeshrmohan.itehandbook",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The SOH@ITECW app offers guests of ITE College West, information about our Food & Beverage Training facilities and the Hotel at the School of Hospitality.",
      "appName": "SOH ITECW",
      "releaseNotes": "Updated for bug fixes and usability improvements.",
      "developerName": "CCK",
      "appViewUrl": "https://itunes.apple.com/sg/app/soh-itecw/id1230855652?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-09-27T17:28:30Z",
      "userRatingCount": 0,
      "size": "56094720",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/cck/id536157349?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "3.0",
      "minimumOsVersion": "9.0",
      "bundleId": "ITE.SOH-RAJESHRMOHAN",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The School of Electronics & Info-Comm Technology offers students with a wide range of Higher Nitec and Nitec courses to match their interest and they are as follows:\n\n•  Electronics Engineering\n•  Information Technology\n•  Network Security Technology\n•  Security Systems Integration\n•  Digital Audio & Video Production\n•  Electronics (Computer & Networking)\n•  Electronics (Wireless LAN)\n•  Info-Communications Technology\n•  Social Media & Web Development\n•  Mobile System & Services\n•  Security Technology\n\nIn this app, you will be able to access to the details about these courses and get a better picture on what the students will learn and experience during the course of their study in ITE CW.",
      "appName": "CW Channel",
      "releaseNotes": null,
      "developerName": "CCK",
      "appViewUrl": "https://itunes.apple.com/sg/app/cw-channel/id1061432545?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-11-30T22:25:34Z",
      "userRatingCount": 0,
      "size": "90923008",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/cck/id536157349?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "7.0",
      "bundleId": "ite.rajeshrmohan.cwchannel",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "CW Events mobile app allows ITE students to find new events to join and they can register for these events via the app. The app comes with 3 screens: Home, My Events and Settings.\n\n- Under Home, they can search for their events. \n\n- Under My Events, they can see the events that are categorized according to their interests.\n\n- Under Settings, they can enter their user details so that they can register for events.",
      "appName": "CW Events",
      "releaseNotes": "Included validation to setting screen.",
      "developerName": "CCK",
      "appViewUrl": "https://itunes.apple.com/sg/app/cw-events/id1373632601?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-05-23T20:34:50Z",
      "userRatingCount": 0,
      "size": "19863552",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/cck/id536157349?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.0",
      "minimumOsVersion": "8.0",
      "bundleId": "edu.ite.rajeshrmohan.eventsapp",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This color vision test app consists of 13 plates. You have to get all your answers correct in order to pass. Results may vary depending on lighting conditions and your device’s display settings. This test is for informational purposes only.",
      "appName": "Colour Vision Test",
      "releaseNotes": "Included screen capture of the result.",
      "developerName": "CCK",
      "appViewUrl": "https://itunes.apple.com/sg/app/colour-vision-test/id1369800126?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-10-07T21:33:29Z",
      "userRatingCount": 0,
      "size": "17126400",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/cck/id536157349?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2",
      "minimumOsVersion": "9.3",
      "bundleId": "ite.rajeshrmohan.Colour-Vision-Test",
      "agencyFullName": "INFO-COMMUNICATIONS MEDIA DEVELOPMENT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "With TP Student mobile app, students may now access information more conveniently.\n \nThis version of TP Student mobile app supports:\n- Class Timetable\n- Examination Results\n- Term Test Timetable\n- Exam Timetable\n- Special Consideration\n- Attendance and Leave \n- Subject Non-grading Notice\n- Academic Progression\n- One Service, it will facilitate students to report issues and make enquiry.\n- Library mobile services\n- Retrieval of past notifications sent to the students\n- Students to submit, view and replace MC\n- Students to submit, view and replace LOA\n- Students to check library occupancy\n- Students to change TP account password\n- Students to watch canteen crowd",
      "appName": "TP Student",
      "releaseNotes": "This version includes the following features:\n\nEnable CET students to login and access student mobile \nNew LOA module for Leave of Absence submission\nLibrary Robbie video\nChange TP account password\nCanteen crowd watch",
      "developerName": "Temasek Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/tp-student/id1007897539?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-21T05:39:43Z",
      "userRatingCount": 33,
      "size": "31221760",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/temasek-polytechnic/id1007897538?mt=8&uo=4",
      "averageUserRating": 2.0,
      "version": "7.1",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.edu.tp.tpossmobile",
      "agencyFullName": "TEMASEK POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "MindWorks is a set of brain training games designed for older adults. These games were developed by researchers from the Centre for Applied Gerontology and students from Temasek Polytechnic (Singapore), in collaboration with renowned neuroscientist Professor Ryuta Kawashima from Tohoku University (Japan). \n\nThere are 6 games which involve memory, attention, logic and arithmetic calculation. Through our research and testing, the results have shown that these games could activate the brain’s prefrontal areas of older adults during gameplay. The prefrontal cortex (PFC) of the brain is responsible for executive functions such as decision-making and problem-solving. Studies have shown that activation of the PFC could potentially improve cognitive performance and function. \n\nUpon completion of each game, the player will be provided feedback on his/her performance through the comparison with other players’ scores in the same age group. On-going research will be conducted to validate the cognitive effects of these games in improving cognitive abilities for daily life activities in older adults.",
      "appName": "MindWorks Brain Training",
      "releaseNotes": "bug fix",
      "developerName": "Temasek Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/mindworks-brain-training/id1429515219?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-09-06T07:29:31Z",
      "userRatingCount": 0,
      "size": "83769344",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/temasek-polytechnic/id1007897538?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "7.0",
      "bundleId": "sg.edu.tp.Mindworks",
      "agencyFullName": "TEMASEK POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "oneConnect allows you to book rooms and view your upcoming room booking activities.",
      "appName": "oneConnect",
      "releaseNotes": null,
      "developerName": "Monetary Authority of Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/oneconnect/id1362976662?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-05-16T11:09:51Z",
      "userRatingCount": 0,
      "size": "24207360",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/monetary-authority-of-singapore/id1362976661?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "0.0.10",
      "minimumOsVersion": "9.0",
      "bundleId": "com.isscmg.oneconnect",
      "agencyFullName": "MONETARY AUTHORITY OF SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Get the latest updates on flash floods from CCTV images with PUB’s MyWaters app. Informative content on beautiful waterscapes are also available at your fingertips.\n\nFeatures include:\n\n• Receive alerts on heavy rain, rising water levels and flash floods\n• Access CCTV images to view road conditions during storms\n• Report water-related incidents\n• Explore PUB’s waterways and reservoirs via Augmented Reality\n• View and share photos of PUB’s waterways and reservoirs\n• Find out the latest water buzz\n• Unlock badges, gain points and redeem rewards\n• Browse and download PURE magazines.\n\nNote: Continued use of GPS running in the background can dramatically decrease battery life. \n\nAbout PUB\nNational water agency, PUB is a statutory board under the Ministry of the Environment and Water Resources. It is the water agency that manages Singapore’s water supply, water catchment and used water in an integrated way. For more information, visit www.pub.gov.sg or www.facebook.com/PUBsg.\n\nThis application is a service of the Singapore Government.",
      "appName": "MyWaters",
      "releaseNotes": "- Minor enhancements and bug fixes.",
      "developerName": "Public Utilities Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/mywaters/id533051315?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-01-09T18:53:02Z",
      "userRatingCount": 22,
      "size": "93288448",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/public-utilities-board/id443115725?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "2.8",
      "minimumOsVersion": "8.0",
      "bundleId": "com.pub.pubmobile",
      "agencyFullName": "PUB, SINGAPORE'S NATIONAL WATER AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Singapore has built a robust water supply system through the Four National Taps (water from local catchment areas, imported water, reclaimed water known as NEWater and desalinated water). Today, more than 5 million people enjoy clean, safe water at a turn of tap. To ensure water sustainability for Singapore increasing water supply alone is not sufficient; managing the demand for water is just as crucial. We must all treat water as a precious resource and make every drop count.\n\nIn line with PUB’s initiative to make water conservation a way of life, the game hopes to encourage adoption of water saving habits. This game starts with a simple one-touch mechanism that enables user to save water in different ways. The first installation of game spreads across 30 levels and 6 backdrops. As the user moves to the other levels, more game mechanisms and game items are included to enhance it. \n\nFor more info on water conservation, please log on to www.pub.gov.sg/conserve",
      "appName": "Save My Water",
      "releaseNotes": "Fixed missing background image.",
      "developerName": "Public Utilities Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/save-my-water/id704075960?mt=8&uo=4",
      "currentVersionReleaseDate": "2013-12-06T19:53:11Z",
      "userRatingCount": 6,
      "size": "230547456",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/public-utilities-board/id443115725?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "1.2",
      "minimumOsVersion": "5.0",
      "bundleId": "com.pub.savemywaters",
      "agencyFullName": "PUB, SINGAPORE'S NATIONAL WATER AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of Singapore Government.\n \nBe empowered for an all new travelling experience\n \nMyTransport.SG Mobile, an award winning app launched by Land Transport Authority (LTA), is a content-rich service offering a wide range of information for all modes of land transportation – empowering commuters, motorists and cyclists in Singapore to make informed decisions and better plan their journey, with these features:\n \n• Personalise your favourite services with MyConcierge\n• Search and locate nearby bus stops and service number with bus route details\n• Get real-time island-wide bus arrival information\n• Search and locate nearby taxi stands and quick dial for taxi booking services\n• Report road defects via Snap & Send \n \n• Get real-time parking lots availability for popular locations\n• Plan route with Traffic News and ERP Gantries on Traffic Smart\n• View live traffic images along all expressways round the island\n• Receive notification on expressways traffic news during peak hours and train service delay information\n• Explore cycling towns, routes, and parking facilities\n• Find out lifestyle events and promotions nearby\n \nThis app is proud to be a multiple local and international awards winners in:\n \n• 2014 Best Global m-Government Service Award, Dubai\n• 2013 Singapore infocomm Technology Federation (SiTF) Awards, Gold Winner in Most Popular Mobile Apps category and Silver Winner in Mobile Applications category\n• 2013 UiTP Grow with Public Transport International Awards, Integrated Mobility category\n• 2013 eGov Excellence Awards,  Distinguished Winner in mServices category\n• 2013 Singapore Mobile Excellence Awards, Gold Winner in Best App/Content by Government/Community category\n• 2012 Summit Emerging Media Awards, Visionary Award in Navigation App category \n• 2012 W3 Awards, Silver Award in Maps and Navigation mobile app category\n \nFor the full suite of land transport information and e-Services, please visit: http://www.mytransport.sg\n \nDisclaimer: Continued use of GPS running in the background can dramatically decrease battery life.",
      "appName": "MyTransport Singapore",
      "releaseNotes": "- General enhancements and bug fixes",
      "developerName": "Land Transport Authority (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/mytransport-singapore/id480951210?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-11-03T02:20:19Z",
      "userRatingCount": 657,
      "size": "74926080",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/land-transport-authority-singapore/id480951213?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "3.3.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.lta.mytransport",
      "agencyFullName": "LAND TRANSPORT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The new MyTransport.SG mobile app now offers you with more useful travelling information and new features to help you get around Singapore.  \n \nNew features of MyTransport.SG:\n• Personalisation - Quick access to your frequently used bus service and traffic information.\n• My Notifications - Manage push notifications to receive MRT or Road alerts that interest you.\n• Near You - View information on nearby bus services, MRT stations or traffic information​ in the vicinity.\n• Multi-modal Journey Planner - Start planning your journey with different transport options based on your travel needs.\n \nThis application is a service of Singapore Government.\n \nDisclaimer: Continued use of GPS running in the background may decrease battery life.",
      "appName": "MyTransport.SG",
      "releaseNotes": "• Bicycle parking information.\n• Bicycle sharing services operator.\n• Performance enhancements and General bug fixes.",
      "developerName": "Land Transport Authority (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/mytransport-sg/id1306661188?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-10T02:00:06Z",
      "userRatingCount": 212,
      "size": "73004032",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/land-transport-authority-singapore/id480951213?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "1.0.1",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.lta.mytransport2",
      "agencyFullName": "LAND TRANSPORT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of Singapore Government\n\nLooking for a taxi? Land Transport Authority (LTA)'s Mobile Apps, Taxi-Taxi@SG not only tells commuters the number of taxis available in their vicinity, commuters can also use the app to indicate their need for taxis. \nCommuter locations will be displayed on an integrated map for taxi drivers to easily identify areas with potential commuters.\n \nFeatures:\n• Commuters can spot available taxis where-ever they are, whenever they want\n• Commuters can easily indicate their need for taxi by tapping on the exact location of choice\n• Taxi drivers can get visibility of where commuters have indicated their need for one",
      "appName": "Taxi-Taxi@SG",
      "releaseNotes": "General enhancements and bug fixes",
      "developerName": "Land Transport Authority (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/taxi-taxi-sg/id939482252?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-11-04T02:45:29Z",
      "userRatingCount": 102,
      "size": "31838208",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/land-transport-authority-singapore/id480951213?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "1.3.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.lta.taxi-taxisg",
      "agencyFullName": "LAND TRANSPORT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Get the latest scoops on incredible projects happening at LTA on all fronts; rail, bus, cycling, walking, taxi, roads and IT…  at times it’s hard to keep track of all the exciting new developments. \n\n‘Getting there Together with you!’ makes it much easier to have an overview of the major enhancements to Singapore’s transport system, so you can look forward to new, exciting and upcoming projects.",
      "appName": "Getting There Together with U!",
      "releaseNotes": null,
      "developerName": "Land Transport Authority (Singapore)",
      "appViewUrl": "https://itunes.apple.com/sg/app/getting-there-together-with-u/id1010523448?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-07-30T05:08:42Z",
      "userRatingCount": 0,
      "size": "10039296",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/land-transport-authority-singapore/id480951213?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.lta.gettingtheretogetherwithyou",
      "agencyFullName": "LAND TRANSPORT AUTHORITY"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "HealthBuddy – make your next clinic visit a breeze! \nDeveloped by the SingHealth group, HealthBuddy allows you access to health information and services, anytime, anywhere. \n\nHealthBuddy features:\n\n\t•\tMobile appointments – Manage your SingHealth appointments on your phone\n\t•\tInformation on SingHealth Hospitals & Specialty Centres – Contact info, how to get there, visit guides and more!\n\t•\tComprehensive library of Conditions & Treatments\n\t•\tHealth tips by HealthXchange.sg \n\t•\tSGH Campus Wayfinder – Find your way around SGH campus with ease\n\t•\tMobile registration [NEW! – trial service] – Get your queue number and monitor queue status on your mobile for selected clinic visits\n\t•\tA listing of GP / family doctors in Singapore, with opening hours & contact information\n\nThrough this app, SingHealth hopes to encourage active and involved participation in one’s own health and well-being.",
      "appName": "Health Buddy",
      "releaseNotes": "- minor fixes",
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/health-buddy/id448572997?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-21T18:18:34Z",
      "userRatingCount": 177,
      "size": "41671680",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "3.20.12",
      "minimumOsVersion": "8.0",
      "bundleId": "com.singhealth.healthbuddy",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "Produced by KK Women's and Children's Hospital in Singapore, the Woman&Child HealthPedia app is an expert health guide and companion through your journey in pregnancy and parenthood! Get to know week-by-week pregnancy milestones and useful tips, for both mother and baby. Personalise the content by keying in your Last Menstruation Date, Estimated Delivery Date and/or Gestation Period. This free app also provides a comprehensive health library relating to women and children with guidance from specialist doctors at your fingertips. The latest version of the app includes a pregnancy and baby journal to help you record those treasured moments during your pregnancy and as you watch your baby grow. Learn more about the developmental milestones and set reminders so you don’t miss the important vaccinations for your baby!",
      "appName": "Woman&Child HealthPedia",
      "releaseNotes": "- Minor update",
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/woman-child-healthpedia/id434360169?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-03-30T18:51:09Z",
      "userRatingCount": 24,
      "size": "22423552",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "2.1.1",
      "minimumOsVersion": "8.0",
      "bundleId": "com.kkh1.app",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "Stay informed about events organised by SingHealth with the SingHealth Event App! \n\nWith this app, you can view all SingHealth events and details like programme/schedule, speakers' biography, event venue and more in one place. You can also choose to receive notifications and alerts from organisers, participate in event polls and surveys.\n\nIf you have any question regarding the use of the SingHealth Event App, please contact emp.helpdesk@singhealthacademy.edu.sg",
      "appName": "SingHealth Events App",
      "releaseNotes": "Recent Updates:\n1. UI improvements\n2. Bug Fixes",
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/singhealth-events-app/id1223315281?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-16T06:05:01Z",
      "userRatingCount": 0,
      "size": "189822976",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.8",
      "minimumOsVersion": "10.3",
      "bundleId": "com.eventrol.singhealth",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "AsthmaCare Buddy is the first asthma care management mobile application developed by SingHealth Polyclinics that allows patients with asthma to assess and manage their asthma control. Through this app, SingHealth Polyclinics hopes to encourage and promote active participation among persons with asthma in managing their health. \nIn this app, you will find: \n• Tools and action plans for monitoring asthma conditions\n• Tips on ways to maintain good asthma control\n• Instructional videos in using the different types of inhalers\n• Reminder for vaccinations\n• Listing of GP clinics in Singapore",
      "appName": "AsthmaCare Buddy",
      "releaseNotes": "Bug fix and some additional URL links",
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/asthmacare-buddy/id570607526?mt=8&uo=4",
      "currentVersionReleaseDate": "2013-05-02T01:33:09Z",
      "userRatingCount": 0,
      "size": "10956275",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.3",
      "minimumOsVersion": "4.3",
      "bundleId": "com.singhealth.asthmacare",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "SingHealth IVF App is first of its kind in-vitro fertilization (IVF) App in Singapore. This patient centric App aims to provide general information, FAQ, financial information and hospital contacts on IVF to patients or couples considering IVF as an option for conception. The App has also in-built IVF appointment calendar to keep you organized for your IVF visits.\n\nThe App features include:\n1) My IVF Schedule: Simple interactive inputs to remind patients of key events/milestones during their IVF cycle in calendar & reminder format.\n2) IVF Education: General Information on in-vitro fertilization to patients and couples considering IVF.\n3) FAQ: Frequently asked questions on IVF including treatments and financial information\n4) IVF Calculator: Calculating your gestation age of embryo based on your ovulation date.\n5) Contact Us: Operation hours and telephone numbers for IVF consultation and enquiries at KK Women’s and Children’s Hospital and Singapore General Hospital.",
      "appName": "SingHealth IVF",
      "releaseNotes": null,
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/singhealth-ivf/id994813978?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-06-13T20:18:50Z",
      "userRatingCount": 0,
      "size": "24367104",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "7.0",
      "bundleId": "com.singhealth.ivf",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "This is an interactive ECG teaching app designed by cardiologists to help teach the clinical pearls of ECG interpretation to doctors, healthcare professionals and students.\n\nThis app includes many case-based examples, quizzes and tips and tricks that will help in the learning process.\n\nThis app has been endorsed by several major cardiology societies.",
      "appName": "Dr ECG",
      "releaseNotes": null,
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/dr-ecg/id1437641000?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-10-18T22:09:16Z",
      "userRatingCount": 8,
      "size": "98555904",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 5.0,
      "version": "1.0",
      "minimumOsVersion": "9.0",
      "bundleId": "com.singhealth.clinicalpearlsecg",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "Heart failure is one of the leading causes of recurrent hospitalization, reduced life expectancy and diminished quality of life in the world.  However, these can be greatly improved with appropriate lifestyle adjustments and medical treatment. HF Buddy aims to empower the heart failure patient with the knowledge and tools to improve the overall understanding of the condition, and to better manage his/her heart failure.",
      "appName": "HF Buddy",
      "releaseNotes": "Content Update",
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/hf-buddy/id1081801399?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-06-08T02:37:44Z",
      "userRatingCount": 0,
      "size": "73304064",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "7.1",
      "bundleId": "com.singhealth.hfbuddy",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "Organised by SingHealth and Duke-NUS Medical School, the SingHealth Duke-NUS Scientific Congress is the largest and most distinguished healthcare-related scientific event in Singapore and around the region. The Congress gathers more than 3,000 thought leaders and healthcare professionals, academics and researchers across the various professions in Singapore’s healthcare. It is a unique platform for the sharing of healthcare challenges and research findings on the latest medical developments and scientific advances in care innovation, research and education.\n \nFeatures includes\n- Programme Details\n- Topic Synopsis\n- Speaker Session/s\n- Speaker Biography\n- Abstracts\n- Sponsors List\n- Exhibitors Booths\n- Getting to Academia\n- Feedback",
      "appName": "SDSC 2016",
      "releaseNotes": "Update some alignment fixed.",
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/sdsc-2016/id1143392931?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-09-07T13:54:00Z",
      "userRatingCount": 0,
      "size": "47145984",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.1",
      "minimumOsVersion": "8.0",
      "bundleId": "com.novitee.singhealth",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "An app that allows faculty members to selectively evaluate residents on demand.",
      "appName": "SHRE",
      "releaseNotes": "- Improvements",
      "developerName": "Singapore Health Services (SingHealth)",
      "appViewUrl": "https://itunes.apple.com/sg/app/shre/id1053814587?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-12-15T16:32:40Z",
      "userRatingCount": 0,
      "size": "5892096",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-health-services-singhealth/id395642269?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.3",
      "minimumOsVersion": "8.0",
      "bundleId": "com.crafd.shre",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Planning a trip to Singapore? The Visit Singapore Travel Guide app is your travel guide to search, discover and explore Singapore’s places of interest on the go. Uncover hidden gems, save your favourite places, and navigate around Singapore in the easiest ways – be it by walking, public transportation or car – while having an unforgettable time.\n\nHere’s what you get:\n\n· Explore, experience and plan what to do on your holiday in Singapore from wherever you are, be it from your hotel or on-the-go. Our navigational tool not only brings you to your destination, it even points out other places of interest along the way.\n\n· Discover nearby places of interest around you, be it restaurants, bars, attractions, malls or accommodations. Find a tour to explore even more. Read recommendations by local residents on places of interest you could go, and why you should check them out.\n\n· Start your own Favourites list by saving your places of interest you like.\n\n· Receive recommendations on nearby places to eat at or go to.\n\n· Get the latest information on events around the city.\n\n· Get handy tips for your trip to Singapore.\n\n· Ever wondered what are the core ingredients in our popular local food? Now you can with a new local food feature and if you snap a shot of any of these food items, there would be a special tip shared! Stay tuned as we expand our menu in the coming months.\n\n· Know more about Merli, Singapore’s Passion Ambassador and use the amazingly cute stickers in your iMessage and WhatsApp. Look out for his moods and the experiences that he enjoys in Singapore!\n\nLook out for upcoming features in future releases.",
      "appName": "Visit Singapore Travel Guide",
      "releaseNotes": "· Minor bug fixes.\n· Minor UI fixes/enhancements. (You probably won't even notice them!)",
      "developerName": "Singapore Tourism Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/visit-singapore-travel-guide/id1258016201?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-16T02:47:51Z",
      "userRatingCount": 32,
      "size": "137308160",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-tourism-board/id377187145?mt=8&uo=4",
      "averageUserRating": 5.0,
      "version": "2.1.4",
      "minimumOsVersion": "11.0",
      "bundleId": "com.stb.visitsingapore",
      "agencyFullName": "SINGAPORE TOURISM BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Part lion, part fish, Singapore's mythical icon is here on iMessage for a full dose of fun! Peel, resize and paste them anywhere in your conversation to share your Singapore experience with your family and friends. Download today! \n\nFor more information on what to do in Singapore, visit www.yoursingapore.com\n\nFor queries and feedback, contact us at https://s.yoursingapore.com/contact-us.html\n\nFind us on social media! \n\nFacebook: https://www.facebook.com/YourSingapore\nTwitter: @visitsingapore\nInstagram: @visit_singapore\nYoutube: https://www.youtube.com/user/YourSingapore \n\nPowered by PicoCandy.",
      "appName": "Merlion Stickers",
      "releaseNotes": null,
      "developerName": "Singapore Tourism Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/merlion-stickers/id1156043750?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-09-26T04:00:51Z",
      "userRatingCount": 0,
      "size": "2372608",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-tourism-board/id377187145?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "10.0",
      "bundleId": "com.picocandy.imessage.0be916457120.content-group.5885",
      "agencyFullName": "SINGAPORE TOURISM BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The CONQUAS app is a one stop location to access all the CONQUAS related information and sites. This app allows developers and contractors to easily access information including the CONQUAS calculators and links.",
      "appName": "CONQUAS.",
      "releaseNotes": "Updated QSL links and other swiping related functionalities.",
      "developerName": "Building & Construction Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/conquas/id556890969?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-07-19T22:24:52Z",
      "userRatingCount": 0,
      "size": "7205888",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/building-construction-authority/id655408961?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.1",
      "minimumOsVersion": "9.2",
      "bundleId": "CONQUAS",
      "agencyFullName": "BUILDING AND CONSTRUCTION AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This is the official BCA Green Mark application, in service of the Singapore Government. The mobile app has 4 key functionalities, namely, Ebooks, Score Calculator, the ability to import and export the score calculation, and an assistive calculator.",
      "appName": "BCA Green Mark",
      "releaseNotes": "Updated and added new criteria ebooks.",
      "developerName": "Building & Construction Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/bca-green-mark/id695728730?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-01-17T14:55:25Z",
      "userRatingCount": 0,
      "size": "45811712",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/building-construction-authority/id655408961?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "3.8",
      "minimumOsVersion": "9.3",
      "bundleId": "com.MobTwo.Green-Mark",
      "agencyFullName": "BUILDING AND CONSTRUCTION AUTHORITY"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "IGBC is organised by the Building and Construction Authority of Singapore (BCA) in collaboration with our strategic partners, the Singapore Green Building Council and Reed Exhibitions.\n\nHeld in Marina Bay Sands, the premier green building event in Asia Pacific, IGBC 2018 is expected to attract more than 1,500 participants from over 30 countries - from thought leaders, real estate developers to urban planners, architects, engineers, builders and other industry professionals - committed to understanding and putting into action real-world, tangible and leading green building solutions.",
      "appName": "IGBC Conference Singapore",
      "releaseNotes": "We’re continuously making improvements to make our app better for you, so we release updates regularly.\n\nEvery update of our app could include improvements for speed and reliability.",
      "developerName": "Building & Construction Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/igbc-conference-singapore/id1401723433?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-08-27T01:53:22Z",
      "userRatingCount": 0,
      "size": "46222336",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/building-construction-authority/id655408961?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.19",
      "minimumOsVersion": "9.0",
      "bundleId": "com.bca.igbc-conference-singapore",
      "agencyFullName": "BUILDING AND CONSTRUCTION AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "“Find Your Friendly Buildings” mobile application is a service of the Singapore Government, brought to you by the Building and Construction Authority (BCA).   It allows users to perform quick searches on the availability of user-friendly facilities in about 3,800 buildings in Singapore, while on the move.  \n\nThe building details information is extracted from BCA’s Friendly Built Environment Web Portal, which was set up to create awareness on the needs to facilitate a user-friendly built environment.   For more information, please visit our friendly built environment portal at www.friendlybuildings.sg.",
      "appName": "Find Your Friendly Building",
      "releaseNotes": "- Recommended route refinements",
      "developerName": "Building & Construction Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/find-your-friendly-building/id911704926?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-29T14:21:23Z",
      "userRatingCount": 0,
      "size": "345758720",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/building-construction-authority/id655408961?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.0.1",
      "minimumOsVersion": "10.0",
      "bundleId": "com.bca.FriendlyBuildings",
      "agencyFullName": "BUILDING AND CONSTRUCTION AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Please note that only user accounts created by BCA staff can use this app.\n\nThis app allows users to report incidents and other issues - using photos and videos. \n\nThe app then notifies relevant BCA officers about these incidents based on departments they belong to.",
      "appName": "BCA Incident Notification",
      "releaseNotes": "UI fixes\nScrolling Bug. \nApp name change",
      "developerName": "Building & Construction Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/bca-incident-notification/id1107377605?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-10-10T02:19:07Z",
      "userRatingCount": 0,
      "size": "50881536",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/building-construction-authority/id655408961?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.15.1",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.bca.arir",
      "agencyFullName": "BUILDING AND CONSTRUCTION AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "CORENET e-Information System is the central repository for building codes, regulations and circulars published by the various building and construction regulatory agencies in Singapore. It also broadcasts events and circulars to its subscribers in a regular and timely manner.",
      "appName": "CORENET E-Info",
      "releaseNotes": null,
      "developerName": "Building & Construction Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/corenet-e-info/id1093111429?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-03-22T18:14:07Z",
      "userRatingCount": 0,
      "size": "2199552",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/building-construction-authority/id655408961?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "6.0",
      "bundleId": "com.bca.Corenet-e-Info",
      "agencyFullName": "BUILDING AND CONSTRUCTION AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "CORENET e-Information System is the central repository for building codes, regulations and circulars published by the various building and construction regulatory agencies in Singapore. It also broadcasts events and circulars to its subscribers in a regular and timely manner.",
      "appName": "CORENET E-Info iPad",
      "releaseNotes": null,
      "developerName": "Building & Construction Authority",
      "appViewUrl": "https://itunes.apple.com/sg/app/corenet-e-info-ipad/id1093841935?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-03-21T15:41:10Z",
      "userRatingCount": 0,
      "size": "4296704",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/building-construction-authority/id655408961?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "6.0",
      "bundleId": "com.bca.Corenet-e-Info-iPad",
      "agencyFullName": "BUILDING AND CONSTRUCTION AUTHORITY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "RP Connect aims to transform the way you work by using mobile technology. It connects all mobile features that simplify how Republic Polytechnic (RP) works.\n\nFor instance, we used to queue for attendance taking. With RP Connect, it allows us to take our attendance via QR code projected on the screen and from the comfort of our seat! \n\nIt also provides information on the go such as Campus Discovery, showcasing all amenities in RP and direction to the amenities. \n\nMore exciting features will be made available in subsequent updates.\n\n\nTip: Turn on your location service to find out amenities near you.\n\nDisclaimer:\n--------------\nContinued use of GPS running in background can dramatically decrease battery life",
      "appName": "RP Connect",
      "releaseNotes": "Thanks for using RP Connect! With this new version, we provide more features to enhance your experience.\n·       “Keep me logged in” to keep your session to access functionalities in RP Connect.\n·       Links to RP social media sites or applications.\n·       Mobile phone number registration to receive customised push notification from RP applications.\n·       Receipt of content when near to specific location.",
      "developerName": "RepublicPolytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/rp-connect/id1101644926?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-04-23T01:32:12Z",
      "userRatingCount": 0,
      "size": "22437888",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/republicpolytechnic/id898718693?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.7",
      "minimumOsVersion": "6.0",
      "bundleId": "com.rp.mobile",
      "agencyFullName": "REPUBLIC POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Welcome back to the Episode 2 of YOLO, Neighbour!\nGet ready for yet another exciting adventure around a whole new neighbourhood. How far would you go to help your new neighbours?\n\nNow integrated with 7 mini games with more difficulty for you to challenge yourself and save the day.\nRemember to interact with your neighbours to score more points too! Look out for neighbours seeking help to find a location or share news and events or even tweets with you!\n\nWith a polished new look that will captivate you, be sure to share your score with all your peers!!\n\nOur New Mini Game Features:\n\n+ Wait 4 Me! > Will you hold the lift for your neighbours?\n\n+ Cluttered Blaze > Extinguish the fire and defuse the bombs before your neighbourhood explodes!\n\n+ Music or Noise > Control the music volume… from a turntable!!\n\n+ Dripping Frenzy > Protect your clothes from getting wet! This time, empty the bucket when it’s full!\n\n+ Invite'em All > Invite your neighbours to an exciting event! But are they at home?\n\n+ Yumilicious Food > Whole new recipes and challenging controls to pick out the ingredients!\n\n+ The Key > Match the parts of the key correctly to fit the lock!",
      "appName": "YOLO Neighbour 2",
      "releaseNotes": "- Added Ending Animation\n- Share recipe to facebook in Yummlicious Food Game\n- Fix Bug",
      "developerName": "RepublicPolytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/yolo-neighbour-2/id903086437?mt=8&uo=4",
      "currentVersionReleaseDate": "2014-08-13T15:39:51Z",
      "userRatingCount": 0,
      "size": "243363840",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/republicpolytechnic/id898718693?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "6.0",
      "bundleId": "com.RepublicPolytechnic.YOLONeighbour2",
      "agencyFullName": "REPUBLIC POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Wheels@Ubin is a ground-up community event. We are a group of friends who believe than no part of Singapore should be inaccessible to any Singaporeans and on 26 June 2015, Wheels@Ubin volunteers and supporters brought 100 wheelchair users to visit Pulau Ubin - a place wheelchair-users would not normally have the chance to visit on their own.\n \nThis application is provided for volunteers to keep in touch with the event organizers.",
      "appName": "Wheels@Ubin 2018",
      "releaseNotes": "Minor bugfixes and updates",
      "developerName": "RepublicPolytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/wheels-ubin-2018/id1331302997?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-02-23T17:58:17Z",
      "userRatingCount": 0,
      "size": "13398016",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/republicpolytechnic/id898718693?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.5",
      "minimumOsVersion": "11.2",
      "bundleId": "sg.edu.rp.wheelsubin2018.WheelsUbin2018",
      "agencyFullName": "REPUBLIC POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "17+",
      "description": "Healthy 365 mobile app is brought to you by the Health Promotion Board (HPB).\nThis app enables you to track your daily steps count and calculate the corresponding calories burned as you move. Among other tracking sources, you can use Apple Health with Apple Watch to track steps. With a compatible wearable that tracks heart rate, you can also track the duration engaged in higher intensity physical activities. Steps and heart rate data from Apple Health can be shared with Healthy 365 mobile app while participating in Health Challenges. \n\n\nKey features include:\n• Dashboard that provide you with an overview of your fitness, Healthpoints and rewards information. \n• Health Challenges that enable you to step up to get healthy, earn Healthpoints and redeem rewards\n• New Eat Drink Shop Healthy Challenge digital passport with more rewards that can be earned along with Healthpoints when you make healthier purchases \n• History charts to keep records of your past steps count, heart rate, distance covered, and calorie intake and output\n• Healthpoints history function that allows tracking of your scans from healthier food, drink or grocery consumption\n• Nearby listing and map views on HPB events, healthier eateries, exercise facilities and routes in your vicinity\n• Integration with new HPB steps trackers and exercise apps including Actxa®, Fitbit® and Apple Health (together with Apple Watch and other devices that provides data into Apple Health as the device source) and in-device motion tracker\n• Sync for Friends function to allow both non-smartphone and smartphone participants to conveniently sync their steps on their friend or family member’s smartphone\n• Background location detection of nearby Scan&Win Hotspots for earning Healthpoints\n\n\nNote:\n• This app uses background location for detection of outdoor Hotspots\n• Continued use of GPS running in the background may dramatically decrease battery life\n• For the optimum experience, please ensure that your phone is set to Singapore Time zone (GMT +8)\n• For any enquiries, please call our hotline at 1800 567 2020 or email us at stepschallenge@hpb.gov.sg",
      "appName": "Healthy 365",
      "releaseNotes": "- You may now discover exciting activities offer by HPB under \"Nearby\" -> \"Events\" and register to confirm your slot\n- Actxa authorisation no longer require bluetooth to be turned on\n- Miscellaneous bug fixes",
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/healthy-365/id1040202154?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-30T03:01:30Z",
      "userRatingCount": 5083,
      "size": "87771136",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/health-promotion-board/id470823074?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "4.3.3",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.hpb.healthy365",
      "agencyFullName": "HEALTH PROMOTION BOARD"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "One-stop access to health records of your family, friends, children.  Learn, manage and improve your health, schedule your appointments, check your personal health records, access your immunisation, screening and lab test results, view your child’s upcoming immunisation schedule and more*!\n\nHealthHub is your personal digital health companion by the Ministry of Health and Health Promotion Board Singapore.\n\nFeatures:\n\nAppointments: Make, view, reschedule, cancel\nMedications: Access your prescription records and medication lists\nRefill: Request for medication refill or renewal of prescription\nPayments: Pay for your medical bills\nChildren Health: Track your child’s developmental milestones and vaccination records as well as upcoming immunisation schedule\nFamily Health: View your parents’ medical appointments and medication lists\nSchool Health: Get notified of school health assessments and your child’s referral letters\nDirectory Listing: Find doctors, caregivers, 24 hour CHAS clinics easily\nHealthpoints: Be rewarded when you complete quizzes\n\n* Participating restructured hospitals, polyclinics and specialist outpatient clinics from the public healthcare sector.",
      "appName": "HealthHub SG",
      "releaseNotes": "Now, you can enjoy quicker access to your appointments, health records and more eServices via our highly-secure and readily accessible SingPass login.\n\nMeanwhile you do not need to have a HealthHub account to access valuable health information resources without the need for signing up for an account.\n\nFor users of our Medical Records and Medication Refill eServices, more public healthcare institutions* are coming onboard, so keep an eye out!",
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/healthhub-sg/id1034200875?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-20T08:49:24Z",
      "userRatingCount": 297,
      "size": "131013632",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/health-promotion-board/id470823074?mt=8&uo=4",
      "averageUserRating": 2.0,
      "version": "2.1.0",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.hpb.healthhub",
      "agencyFullName": "HEALTH PROMOTION BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Take charge of your health and try out these simple healthy lifestyle habits to get yourself on track to better health today.\n\nSimply sign-up for a HealthHub account and choose a health goal:\nHealthy Pregnancy\nDiabetes Prevention\nLose Weight\nGet Fit\nReduce Stress\nSleep Better\nLiving with Diabetes\nQuit Smoking\nAnd much more\n\nConnect with over 100 popular health and activity trackers such as Healthy 365, Fitbit, Nokia Health, Garmin, S Health, Google Fit and more. Once connected, you will receive regular health tips and insights on the activities you do every day and learn how they impact your health. HealthHub.sg – Make healthy easy.\n\nAs an Apple HealthKit user, your data can be used to enhance the experience.",
      "appName": "HealthHub Track",
      "releaseNotes": "Improved Profile Page layout and bug fixes and improvements",
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/healthhub-track/id1211580013?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-15T11:34:19Z",
      "userRatingCount": 20,
      "size": "60423168",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/health-promotion-board/id470823074?mt=8&uo=4",
      "averageUserRating": 2.0,
      "version": "2.7.0",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.hpb.healthhub.track",
      "agencyFullName": "HEALTH PROMOTION BOARD"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "Key features include:\n• Food Photo recognition by snapping your food item.\n• Caloric Balance dashboard to monitor your calorie intake vs output\n• Diet dashboard to view your top 3 highest calories food and drinks consumed for the day\n• Health Challenges that enable you to step up to get healthy, or earn points and redeem rewards\n• Diet tracking journal with access to over 1,000 local food and drinks database, capturing calories and nutritional information",
      "appName": "Snap&Eat",
      "releaseNotes": "Miscellaneous bug fixes and performance enhancements",
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/snap-eat/id1197314930?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-03-16T03:06:50Z",
      "userRatingCount": 0,
      "size": "38428672",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/health-promotion-board/id470823074?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.3.8",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.hpb.snapandeat",
      "agencyFullName": "HEALTH PROMOTION BOARD"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "The hiSG mobile application is brought to you by the Health Promotion Board (HPB), exclusively for participants of the Health Insights Singapore (hiSG) study. The hiSG mobile app is designed to provide hiSG participants with a more seamless and engaging study experience by allowing them to respond directly to study questionnaires on the app and log their meals taken via the app’s meal logging tool. Participants are also able to track their progress in the study, earn Healthpoints for participation in study activities, as well as gain deeper insights on their health via the app.",
      "appName": "hiSG - Health Insights SG",
      "releaseNotes": "- Added a new Progress tab where you can now conveniently track your study participation with a progress overview report and a calendar view of each study requirement.\n- Improvement to meal logging flow. The meal logging tab has been removed; you can now log meals directly from the dashboard by tapping on specific meals.",
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/hisg-health-insights-sg/id1411948539?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-03-01T02:59:56Z",
      "userRatingCount": 39,
      "size": "33766400",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/health-promotion-board/id470823074?mt=8&uo=4",
      "averageUserRating": 1.5,
      "version": "1.1.0",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.hpb.healthinsights",
      "agencyFullName": "HEALTH PROMOTION BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Are busy schedules and endless social commitments making it hard to stick to your health goals? Bitesize makes it easier by helping you find little opportunities in your lifestyle to stay active every day.\n\nBitesize supports and guides you with simple achievable exercises to help you progress in your routine and complete harder exercises over time. By getting to know you better, it can personalise your Dailys and recommend the right workouts that are fit for you. You can even customise Bitesize based on your preferences!\n\nBitesize is an initiative by Health Promotion Board Singapore.\n\nFeatures:\nDailys: Gain access to simple and customisable exercises in Cardio, Flexibility and Strength\nChallenges: Unlock more difficult Dailys by completing challenges\nFeedback: Get exercise recommendations based on how you perform\nWeekly Report: Discover insights to reflect on your weekly activity\nNotifications: Receive encouragement and reminders to exercise throughout the day",
      "appName": "Bitesize SG",
      "releaseNotes": null,
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://itunes.apple.com/sg/app/bitesize-sg/id1444991381?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-15T03:47:28Z",
      "userRatingCount": 5,
      "size": "23071744",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/health-promotion-board/id470823074?mt=8&uo=4",
      "averageUserRating": 4.0,
      "version": "1.5.74",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.hpb.bitesize",
      "agencyFullName": "HEALTH PROMOTION BOARD"
    },
    {
      "contentAdvisoryRating": "12+",
      "description": "This app helps you find DMEs and make an appointment for a medical examination.\n\nAny person who wishes to apply for CAAS pilot or air traffic controller licence is required to have a valid Medical Assessment of the relevant class. This application provides the updated list of Designated Medical Examiners (DMEs) who are able to perform the relevant Licensing Medical Examination and Aeromedical Review for applicants or licence holders.  Information provided by this application includes clinic location, onsite investigation facilities, contact number and contact email of each of the DMEs.",
      "appName": "CAAS DME Finder",
      "releaseNotes": "Fixes a bug that is preventing the display of updated list of DMEs.",
      "developerName": "Civil Aviation Authority of Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/caas-dme-finder/id1091175818?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-09-12T17:45:35Z",
      "userRatingCount": 0,
      "size": "1544192",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/civil-aviation-authority-of-singapore/id1019486003?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "8.0",
      "bundleId": "com.caas.DMEFINDER",
      "agencyFullName": "CIVIL AVIATION AUTHORITY OF SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of Singapore Government.\n\nA new version of NLB Mobile with new nifty features.\n\nProvided by the National Library Board Singapore, the application allows library patrons to:\n\n• Set up multiple user profiles\n• Borrow library items by scanning barcodes \n• Manage loans and reservations\n• Search the library catalogue\n• View events happening at each library\n\nWhat's new in this release:\n• Online payment of fees\n• Borrow and read ebooks in the same app\n• View loan and reservation histories\n• Bookmark favourite items",
      "appName": "NLB Mobile •",
      "releaseNotes": "- Use the autocomplete feature within the search for easier search\n- Redeem your points for Book Bug cards\n- New Account layout for easier and faster navigation\n- Minor enhancements and bug fixes",
      "developerName": "National Library Board Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/nlb-mobile/id1147053983?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-29T22:10:28Z",
      "userRatingCount": 229,
      "size": "98250752",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/national-library-board-singapore/id411883166?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "2.3",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.nlb.nlbmobile",
      "agencyFullName": "NATIONAL LIBRARY BOARD"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a Smart Nation initiative jointly developed by the Municipal Services Office (MSO) and Government Technology Agency (GovTech).\n\nThe “OneService” mobile application is part of the Government’s on-going efforts to provide a convenient channel for reporting municipal issues within Singapore. The application provides for common categories of municipal issues and more features will be offered under subsequent updates.\n\nDate of Official Launch: 25 January 2015\n\nTo provide feedback on the application, please e-mail us at mso_appenquiry@mnd.gov.sg \n\nBy downloading, you agree to the Terms of Use and Privacy Policy of the OneService Mobile App.\n\nURL for Terms of Use: \nhttps://www.oneservice.sg/terms\nURL for Privacy Policy: \nhttps://www.oneservice.sg/privacy\n\nKeywords: one, service, municipal, services, mnd, mso, singapore government",
      "appName": "OneService",
      "releaseNotes": "- Bug Fixes",
      "developerName": "Ministry of National Development",
      "appViewUrl": "https://itunes.apple.com/sg/app/oneservice/id947274394?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-12-17T03:22:21Z",
      "userRatingCount": 132,
      "size": "83561472",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-national-development/id947274393?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "4.0.3",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.gov.mnd.oneservice",
      "agencyFullName": "MINISTRY OF NATIONAL DEVELOPMENT"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "HelpBuddy is a mobile app jointly developed by the Singapore Management University (SMU) and the Municipal Services Office (MSO) that aims to encourage residents to take ownership of their living environment, facilitate volunteerism and community participation. \n\nThe app would recommend activities to users based on user’s preferences, task history and physical proximity to activity’s location. The data collated would help to support behavioural research and allow SMU researchers and Government agencies to understand the users’ attitudes and behaviours towards this new concept.",
      "appName": "HelpBuddy",
      "releaseNotes": "• Email verification update in registration screen.",
      "developerName": "Ministry of National Development",
      "appViewUrl": "https://itunes.apple.com/sg/app/helpbuddy/id1290155686?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-13T09:04:17Z",
      "userRatingCount": 0,
      "size": "63117312",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/ministry-of-national-development/id947274393?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.12",
      "minimumOsVersion": "10.0",
      "bundleId": "sg.gov.mnd.helpbuddy",
      "agencyFullName": "MINISTRY OF NATIONAL DEVELOPMENT"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "MSS’ Weather@SG provides the latest warnings, forecasts and observations at your fingertips. Through this app, users can:\n•\tReceive warnings of heavy rain and other hazards\n•\tAccess weather forecasts\n•\tView real-time weather observations \n\n------------------------------------------------------------------------\n\n\nFor a full suite of weather information, please visit http://www.weather.gov.sg or follow MetServiceSG on Twitter to receive more updates.\n\nThe Meteorological Service Singapore (MSS) is Singapore’s national authority on the weather and climate. It is an operations division under the National Environment Agency (NEA).\nOur mission is to observe and understand the weather and climate affecting Singapore and to provide services in support of national needs and international co-operation. The key areas within the mission include:\n•\tCollecting and maintaining of reliable long-term national weather records\n•\tProviding reliable weather and climate services\n•\tConducting high quality research to advance understanding and prediction of the weather and climate of Singapore and the region\n•\tPerforming risk and impact assessment of natural environmental hazards\n\nThis application is a service of the Singapore government.",
      "appName": "Weather@SG",
      "releaseNotes": "Minor enhancements and optimizations",
      "developerName": "Meteorological Service Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/weather-sg/id1091263497?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-02T20:02:48Z",
      "userRatingCount": 34,
      "size": "62126080",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/meteorological-service-singapore/id1091263496?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "1.0.53",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.gov.weather.weatheratsg",
      "agencyFullName": "NATIONAL ENVIRONMENT AGENCY"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "This application is a service of Singapore Government.\n\neAppt@ICA is the latest initiative from the Immigration & Checkpoints Authority (ICA), which allows members of public to book an appointment with ICA to complete their application processes as well as to change or cancel appointments. With eAppt@ICA, everyone will have the following services at their fingertips:\n \n1) Book appointments* with all 3 Services Centres of ICA.\n2) View existing appointments* made with ICA at 'My Appointment' tab.\n3) Locate SingPost outlets for alternate site collection of selected ICA documents and passes.\n4) Links to other Home Team Departments' homepage.  \n \nNote:\n-*Selected services may require you to log in with your SingPass ID before booking an appointment \n- For any enquiries, please email us at ICA_Feedback@ica.gov.sg",
      "appName": "eAppt@ICA",
      "releaseNotes": "Removed Singapore Citizenship Application and Apply for REP (Transfer) services",
      "developerName": "Immigration & Checkpoints Authority of Singapore",
      "appViewUrl": "https://itunes.apple.com/sg/app/eappt-ica/id1071195475?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-27T10:51:05Z",
      "userRatingCount": 20,
      "size": "6608896",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/immigration-checkpoints-authority-of-singapore/id1071195474?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "1.0.14",
      "minimumOsVersion": "11.2",
      "bundleId": "sg.gov.ica.eappt",
      "agencyFullName": "MINISTRY OF HOME AFFAIRS"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The only official app for Sentosa, The State of Fun!\n\nMake the most of your journey with useful, real-time information of our island resort and keep a part of Sentosa with you wherever you go\n\nDownload now and plan your trip with these features:\n\n•\tNavigate your way around Sentosa with our GPS-enabled map with turn-by-turn directions\n\n•\tPlanning and sharing your customised itinerary with family and friends is easier than ever with our new itinerary planner\n\n•\tFast facts at your fingertips – everything you need to know about our attractions including Universal Studios Singapore, Mega Adventure Park, resorts, and many more\n\n•\tBrowse over 120 restaurants and make dining reservations directly from your phone at select locations\n\n•\tGet in on the fun and enjoy exclusive app-only offers and promotions\n\n•\tBeat the queue and purchase attraction tickets on-the-go\n\n•\tTake the road less-travelled and try out the Interactive Trails where attractive prizes await\n\n•\tCreate your very own Sentosa photo collage and share it with family and friends!",
      "appName": "MySentosa",
      "releaseNotes": "- Usability fixes to improve your experience\n- Stay tuned for more features in the coming months",
      "developerName": "Sentosa Leisure Management Pte. Ltd",
      "appViewUrl": "https://itunes.apple.com/sg/app/mysentosa/id535117751?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-25T03:13:19Z",
      "userRatingCount": 29,
      "size": "212932608",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/sentosa-leisure-management-pte-ltd/id535117754?mt=8&uo=4",
      "averageUserRating": 4.0,
      "version": "6.32",
      "minimumOsVersion": "9.0",
      "bundleId": "com.sentosa.MySentosa",
      "agencyFullName": "SENTOSA DEVELOPMENT CORPORATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "NYP Connect is a free mobile application developed for NYP alumni only. Download the app and install your NYP e-Card on your smartphone! With the e‐Card, you will be able to view and register for upcoming alumni events, book NYP sport and recreational facilities, access the Library and Reading Lounge, and update your particulars on the go! With the e-Card, Diploma graduates can also request for transcripts and exchange contact info with your NYP alumni-friends when you meet.\n\nDeveloped by the NYP School of IT, the NYP Connect e‐Card is YOUR NYP identity!",
      "appName": "NYP Connect - Alumni & Friends",
      "releaseNotes": "- Fix minor crash issues",
      "developerName": "Nanyang Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/nyp-connect-alumni-friends/id987398844?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-10-26T08:08:40Z",
      "userRatingCount": 7,
      "size": "66865152",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/nanyang-polytechnic/id370531175?mt=8&uo=4",
      "averageUserRating": 3.5,
      "version": "2.0.4",
      "minimumOsVersion": "10.2",
      "bundleId": "sg.edu.nyp.AlumniGoProd",
      "agencyFullName": "NANYANG POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "NYP Mobile is the official mobile app designed for Nanyang Poly’s students and staff.  Designed to enhance the experience of our community, it offers access to commonly used E-Services directly from the phone or tablet. Navigate NYP on the go and see the rich campus life through info and events. Users will also be able to view all full-time and part-time courses offered by the polytechnic.\n\nNYP Mobile allows you to:\n- See how crowded canteens and library study spaces are\n- Check how crowded the i@Central help desk is\n- Get a campus map, learn how to get to NYP,  and find out about bus arrival timings at nearby bus stops\n- Find contact information in the staff directory\n- Receive Info Alerts \n- Check out the facilities and food outlets available\n- Students can check timetable and exam results\n- Staff can apply for annual leave",
      "appName": "NYP Mobile",
      "releaseNotes": "Update of Getting to NYP page with removal of shuttle bus information.",
      "developerName": "Nanyang Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/nyp-mobile/id1361094079?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-13T19:10:48Z",
      "userRatingCount": 14,
      "size": "83459072",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/nanyang-polytechnic/id370531175?mt=8&uo=4",
      "averageUserRating": 4.5,
      "version": "1.0.7",
      "minimumOsVersion": "9.0",
      "bundleId": "sg.edu.nyp.cnc.nypappProd",
      "agencyFullName": "NANYANG POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Singapore Institute of Retail Studies (SIRS) is a CET Institute of Nanyang Polytechnic. It was set up in January 2006 collaboratively between Singapore Workforce Development Agency (WDA) and Nanyang Polytechnic (NYP) to upgrade the skills profile and to raise the professionalism of the retail workforce in Singapore. As the National CET Institute (NCI), a pinnacle status for CET centres, SIRS provides training for Retail and Service courses under the Workforce Skills Qualifications (WSQ) Framework in a modular or full qualification basis. SIRS also operates a Career Service Centre to assist job seekers who are unemployed or employed in the non-retail industry seeking to acquire new skills through attending SIRS Retail WSQ programmes and switch careers into the retail industry.\n\nAbout the Application\n\n>> Course Information\nUnderstand training programmes and courses offered by SIRS, course overview, calendar. Interested individuals can sign up for the classes available. \n\n>> Career Services\nIndividuals can obtain information on job opportunities and seek employment assistance and guidance.\n\n>> Contact Us\nCheck out the location of SIRS via address or location map. Contact SIRS via phone or email or enquires.",
      "appName": "Jobs & Courses @SIRS",
      "releaseNotes": "Minor bug fixes",
      "developerName": "Nanyang Polytechnic",
      "appViewUrl": "https://itunes.apple.com/sg/app/jobs-courses-sirs/id627372197?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-08-03T20:08:52Z",
      "userRatingCount": 5,
      "size": "9881600",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/nanyang-polytechnic/id370531175?mt=8&uo=4",
      "averageUserRating": 5.0,
      "version": "1.1.2",
      "minimumOsVersion": "6.0",
      "bundleId": "sg.edu.nyp.SIRSMobile",
      "agencyFullName": "NANYANG POLYTECHNIC"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Police@SG is the initiative from the Singapore Police Force, which gives members of public access to useful information on the go. With Police@SG, everyone will have the following services at their fingertips:\n\n- Read the latest crime news, police appeals for information and missing persons\n- Locate the nearest police station from your current location\n- Share content on Facebook and Twitter\n- Links to Singapore Police Force homepage, recruitment and social media sites\n- Submit information or respond to police appeals via our information submission portal \"i-Witness\"\n\nThe Singapore Police Force - A force for the Nation",
      "appName": "Police@SG",
      "releaseNotes": "New splash screen\nAmendments to SG SECURE",
      "developerName": "Singapore Police Force",
      "appViewUrl": "https://itunes.apple.com/sg/app/police-sg/id472603758?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-04-16T02:05:37Z",
      "userRatingCount": 124,
      "size": "68595712",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-police-force/id440171324?mt=8&uo=4",
      "averageUserRating": 3.0,
      "version": "3.14",
      "minimumOsVersion": "9.0",
      "bundleId": "com.SPF.mobileapp",
      "agencyFullName": "MINISTRY OF HOME AFFAIRS"
    },
    {
      "contentAdvisoryRating": "9+",
      "description": "Test your RoadSense in Singapore. Do you have the skills to stay safe and go the distance?",
      "appName": "RoadPro",
      "releaseNotes": "Cyclist events are now more responsive.  Minor changes in sound effects",
      "developerName": "Singapore Police Force",
      "appViewUrl": "https://itunes.apple.com/sg/app/roadpro/id984448418?mt=8&uo=4",
      "currentVersionReleaseDate": "2015-11-06T04:03:35Z",
      "userRatingCount": 0,
      "size": "333601792",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/singapore-police-force/id440171324?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.032",
      "minimumOsVersion": "5.1.1",
      "bundleId": "com.SingaporeTrafficPolice.RoadPro",
      "agencyFullName": "MINISTRY OF HOME AFFAIRS"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "eLEARN LMS app is a mobile application for staff from the National Healthcare Group, JurongHealth and Alexandra Health System. It complements the main learning portal - elearn.sg by providing staff with easy access to learning resources and online participation.",
      "appName": "eLearn LMS",
      "releaseNotes": "Bug fixes and performance improvements",
      "developerName": "ASKnLearn",
      "appViewUrl": "https://itunes.apple.com/sg/app/elearn-lms/id1144430645?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-01-14T18:58:51Z",
      "userRatingCount": 0,
      "size": "37360640",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/asknlearn/id369556874?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.7.0.6",
      "minimumOsVersion": "8.0",
      "bundleId": "com.asknlearn.NJA",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "360° views of  ITE College Central Singapore, School of Electronics & Info-Comm Technology (SEIT). 360 images cover the various facilities from SEIT where students hands-on, minds-on and hearts-on.",
      "appName": "CC SEIT VR Tour",
      "releaseNotes": "Updated VR tour",
      "developerName": "Murugesan Latha",
      "appViewUrl": "https://itunes.apple.com/sg/app/cc-seit-vr-tour/id1350616548?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-04-11T17:48:29Z",
      "userRatingCount": 0,
      "size": "555815936",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/murugesan-latha/id1127236777?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "3.2",
      "minimumOsVersion": "8.1",
      "bundleId": "cc.seit.vr",
      "agencyFullName": "INSTITUTE OF TECHNICAL EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The SingHealth eLearning app empowers learning on-the-go. Through the app, users stay connected to the eLearning portal and have easy access to course content or learning activities anytime, anywhere. \n\nThe app is easy to use and provides accessibility to learning resources at the fingertips!",
      "appName": "SingHealth eLearning",
      "releaseNotes": "Update the evaluation function to set the question to be either mandatory or not mandatory.",
      "developerName": "ASKnLearn",
      "appViewUrl": "https://itunes.apple.com/sg/app/singhealth-elearning/id1298920805?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-14T19:17:09Z",
      "userRatingCount": 0,
      "size": "30796800",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/asknlearn/id369556874?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.3",
      "minimumOsVersion": "9.0",
      "bundleId": "com.wizlearn.singhealth",
      "agencyFullName": "MINISTRY OF HEALTH"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Businesses can now use this customized merchant app to accept payments from their customers using ActiveWallet in the ActiveSG app. Customers will make payment by scanning QR codes and other online mechanisms. Through this app, Business partners can be notified of the payments in real-time, view past transactions and other operations.",
      "appName": "ActiveWallet",
      "releaseNotes": "Bug fixes and performance improvements",
      "developerName": "iAPPS PTE LTD",
      "appViewUrl": "https://itunes.apple.com/sg/app/activewallet/id1384915584?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-11-01T02:32:46Z",
      "userRatingCount": 0,
      "size": "32098304",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/iapps-pte-ltd/id597193482?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.1",
      "minimumOsVersion": "9.0",
      "bundleId": "com.iapps.activewalletpartner",
      "agencyFullName": "SPORT SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "AR Prototyping is an app that helps beginner 3D modeller to visualise how are UV maps being mapped on to a 3D model.\n\nUsers will be able to see their changes in real time while they colour the printed UV map therefore enabling them to relate to how things are mapped.\n\nUsers may download the following templates below:\nhttps://goo.gl/HDF5zJ",
      "appName": "AR Prototyping",
      "releaseNotes": null,
      "developerName": "Murugesan Latha",
      "appViewUrl": "https://itunes.apple.com/sg/app/ar-prototyping/id1437484616?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-09-28T08:20:28Z",
      "userRatingCount": 0,
      "size": "102129664",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/murugesan-latha/id1127236777?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0",
      "minimumOsVersion": "8.0",
      "bundleId": "sg.edu.ite.ARPrototyping",
      "agencyFullName": "INSTITUTE OF TECHNICAL EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "The Careers@Gov mobile application allows you to browse & apply for jobs in the Singapore Public Service.\n\nThe Singapore Public Service employs about 140,000 public officers working in 16 ministries and more than 50 statutory boards. If you have a passion to serve the people, and want a meaningful career – come join us!\n\nThe Singapore Public Service : Integrity . Service . Excellence\n\nFor more information, visit our website at www.careers.gov.sg",
      "appName": "Careers@Gov",
      "releaseNotes": "Fix issue with data not loading in the app",
      "developerName": "PageUp People",
      "appViewUrl": "https://itunes.apple.com/sg/app/careers-gov/id372964124?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-04-24T15:59:16Z",
      "userRatingCount": 175,
      "size": "15052800",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/pageup-people/id619586803?mt=8&uo=4",
      "averageUserRating": 2.5,
      "version": "12.00",
      "minimumOsVersion": "7.1",
      "bundleId": "com.jobstreet.careersgov",
      "agencyFullName": "PRIME MINISTER'S OFFICE"
    },
    {
      "contentAdvisoryRating": "9+",
      "description": "Central Quest is an interactive game which taps on iBeacon and Augmented Reality technology. Explore ITE College Central on a time-travelling adventure and complete the various challenges from different time and space! \n\n\nFeatures:\n\nSchool of Design & Media\nYou are in the Land of Forgotten. Capture flying dinosaurs to lift your spaceship from the swamp.\n\nSchool of Electronics & Info-Comm Technology\nYou are teleported into a new millennium where you face an alien attack. \n\nSchool of Business & Services\nYou are running out of fuel for your journey home. Collect coins to accumulate the amount required to purchase the fuel.\n\nSchool of Engineering\nYour spaceship is damaged during an attack and you need to get supplies from the helicopter before the pirate jet planes destroy them.",
      "appName": "Central Quest",
      "releaseNotes": "Minor fix to score system",
      "developerName": "Murugesan Latha",
      "appViewUrl": "https://itunes.apple.com/sg/app/central-quest/id1216505592?mt=8&uo=4",
      "currentVersionReleaseDate": "2017-05-09T21:16:35Z",
      "userRatingCount": 0,
      "size": "75294720",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/murugesan-latha/id1127236777?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "0.11",
      "minimumOsVersion": "6.0",
      "bundleId": "sg.edu.ite.gameon",
      "agencyFullName": "INSTITUTE OF TECHNICAL EDUCATION"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "Download this free mobile app and start exploring sports and activity venues located throughout Singapore. Designed for smartphone users to make searches, reservations, registrations, purchases and quick payments, all in one convenient, feature-rich app. Real-time access to all facilities and programmes made available to the public by Sport Singapore. \n\n\nKey features:\n\n\nSteps tracker\nNow the apps integrates with Apple HealthKit to keep track of the steps you have conquered for each challenge/campaign organized.\n\n\nAll user types\nRegistered users. Verified members. Supplementary (family) accounts. Junior (under-16) members.  All can use ActiveSG with varying privileges. \n\n\nSmart search \nSearch for a sports facility nearby, view its location and check its amenities. Ask the app to recommend best possible venues for your interests..\n\n\nEnd-to-end booking\nVenue, date and time selection. Course registrations. Event sign-ups. Shopping cart with options for add-on items. Payments, cancellations and refunds.\n \n\nOne-touch booking\nThe app remembers all your previous bookings so you can grab your favourite slots the next time round. No need to retrace your steps.\n\n\nVirtual ID\nCheck in and check out of a swim or gym facility, by scanning the QR code on your mobile phone screen (after buying an entry pass).",
      "appName": "ActiveSG",
      "releaseNotes": "- Bug fixes",
      "developerName": "iAPPS PTE LTD",
      "appViewUrl": "https://itunes.apple.com/sg/app/activesg/id827595244?mt=8&uo=4",
      "currentVersionReleaseDate": "2019-02-14T23:18:23Z",
      "userRatingCount": 894,
      "size": "146302976",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/iapps-pte-ltd/id597193482?mt=8&uo=4",
      "averageUserRating": 2.0,
      "version": "1.40",
      "minimumOsVersion": "9.0",
      "bundleId": "com.iapps.activesg",
      "agencyFullName": "SPORT SINGAPORE"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "PeopleGo is a Mobile Virtual Community Touchpoint, partnering the Ministry of Manpower, for Migrant Workers in Singapore. This mobile application promotes communications between the Ministry, workers and the employers. With the PeopleGo mobile application, migrant workers in Singapore will have access to the latest news and happenings in Singapore, online e-Courses and Up-Skilling contents, a complete integrated social media platform and useful e-Services at their fingertips.",
      "appName": "PeopleGo",
      "releaseNotes": "- Added FIN/WP to registration\n- Updated push notifications",
      "developerName": "GenyTek Pte. Ltd.",
      "appViewUrl": "https://itunes.apple.com/sg/app/peoplego/id1257681284?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-06-08T18:17:26Z",
      "userRatingCount": 0,
      "size": "61322240",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/genytek-pte-ltd/id1151262276?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.5",
      "minimumOsVersion": "8.0",
      "bundleId": "com.genytek.peoplego",
      "agencyFullName": "MINISTRY OF MANPOWER"
    },
    {
      "contentAdvisoryRating": "4+",
      "description": "ITE VR Garden is an VR app that feature the Garden at ITE College Central Singapore.\n\nInside this app, users can get to learn more about various types of plants and herbs by moving around the garden virtually.",
      "appName": "ITE VR Garden",
      "releaseNotes": "Refreshed look if Garden @ ITE College Central, Singapore",
      "developerName": "Murugesan Latha",
      "appViewUrl": "https://itunes.apple.com/sg/app/ite-vr-garden/id1276547054?mt=8&uo=4",
      "currentVersionReleaseDate": "2018-03-21T21:59:14Z",
      "userRatingCount": 0,
      "size": "74921984",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/murugesan-latha/id1127236777?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "2.0",
      "minimumOsVersion": "7.0",
      "bundleId": "ite.edu.sg.vrgarden",
      "agencyFullName": "INSTITUTE OF TECHNICAL EDUCATION"
    },
    {
      "contentAdvisoryRating": "9+",
      "description": "Campus Alive! is an app that allows visitors to explore ITE College Central through Augmented Reality. See the campus come to life at various iconic locations.",
      "appName": "Campus Alive!",
      "releaseNotes": "- Added new location for dinosaur to appear\n- Resized dinosaur",
      "developerName": "Murugesan Latha",
      "appViewUrl": "https://itunes.apple.com/sg/app/campus-alive/id1127236778?mt=8&uo=4",
      "currentVersionReleaseDate": "2016-08-23T00:45:55Z",
      "userRatingCount": 0,
      "size": "91960320",
      "developerViewUrl": "https://itunes.apple.com/sg/developer/murugesan-latha/id1127236777?mt=8&uo=4",
      "averageUserRating": 0,
      "version": "1.0.5",
      "minimumOsVersion": "6.0",
      "bundleId": "sg.edu.ite.cc.ar",
      "agencyFullName": "INSTITUTE OF TECHNICAL EDUCATION"
    }
  ]
}
