{
  "resultCount": 49,
  "results": [
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "\"SkillsFuture@PublicService”\n\nThis application is a service of the Government of Singapore.\n\nLEARN is a one-stop digital learning platform that lets you learn wherever you go. It also gives you all that you need to upskill and reskill in a digital workplace.\n\nDiscover a world of learning resources with CSC’s proprietary content and curated learning pathways from renowned third-party content providers.\n\nSharpen your skills with personalised content according to Public Service Competency Frameworks and your learning needs.\n\nActivate your account and LEARN today!\n",
      "appName": "LEARN.gov.sg",
      "releaseNotes": "Minor performance updates and improvements for launch!",
      "developerName": "Civil Service College Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=cxs.cscollege.learn",
      "currentVersionReleaseDate": "November 29, 2018",
      "userRatingCount": 3,
      "size": "46M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Civil+Service+College+Singapore",
      "averageUserRating": 5.0,
      "version": "1.02",
      "minimumOsVersion": "4.3 and up",
      "bundleId": "cxs.cscollege.learn",
      "downloads": "100+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of Singapore Government.\n\neAppt@ICA is the latest initiative from the Immigration & Checkpoints Authority (ICA), which allows members of public to book an appointment with ICA to complete their application processes as well as to change or cancel appointments. With eAppt@ICA, everyone will have the following services at their fingertips:\n\n1) Book appointments* with all 3 Services Centres of ICA.\n2) View existing appointments* made with ICA at 'My Appointment' tab.\n3) Locate SingPost outlets for alternate site collection of selected ICA documents and passes.\n4) Links to other Home Team Departments' homepage. \n\nNote:\n-*Selected services may require you to log in with your SingPass ID before booking an appointment \n- For any enquiries, please email us at ICA_Feedback@ica.gov.sg\n",
      "appName": "eAppt@ICA",
      "releaseNotes": "Introducing Collection of Birth Certificate",
      "developerName": "Immigration & Checkpoints Authority",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.ica.eappt",
      "currentVersionReleaseDate": "June 29, 2018",
      "userRatingCount": 231,
      "size": "5.2M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Immigration+%26+Checkpoints+Authority",
      "averageUserRating": 4.0,
      "version": "1.0.9",
      "minimumOsVersion": "4.2 and up",
      "bundleId": "sg.gov.ica.eappt",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of the Singapore Government.\n\nmyCPF provides you with easy access to your personal CPF information on the go. It also provides you with a quick way to perform Retirement Sum Top-Ups and calculate the amount of CPF contributions payable. You can access your CPF information via the following services using your SingPass:\n\n• My Dashboard \n• My Healthcare\n• My Housing\n• My Investment\n• My Messages\n• Transaction History\n• Contribution History \n\nFor the full suite of CPF online services, please visit www.cpf.gov.sg.\n",
      "appName": "myCPF",
      "releaseNotes": "Introducing the Retirement Sum Topping Up feature! Now, you can top up CPF savings using cash or CPF for yourself and your loved ones.   As part of our ongoing enhancements, myCPF mobile app fingerprint login has been integrated with the recently launched SingPass mobile app. Also comes with minor app fixes and improvements to usability.",
      "developerName": "CPF Board",
      "appViewUrl": "https://play.google.com/store/apps/details?id=gov.sg.cpf.mycpf",
      "currentVersionReleaseDate": "November 29, 2018",
      "userRatingCount": 385,
      "size": "15M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=CPF+Board",
      "averageUserRating": 4.5,
      "version": "1.6.0",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "gov.sg.cpf.mycpf",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "The Careers@Gov mobile application allows you to browse & apply for jobs in the Singapore Public Service.\n\nThe Singapore Public Service employs about 140,000 public officers working in 16 ministries and more than 50 statutory boards. If you have a passion to serve the people, and want a meaningful career – come join us!\n\nThe Singapore Public Service : Integrity . Service . Excellence\n\nFor more information, visit our website at www.careers.gov.sg\n",
      "appName": "Careers@Gov",
      "releaseNotes": "Fixed issue with data not loading in the app. No longer need permission to access images.",
      "developerName": "PageUp",
      "appViewUrl": "https://play.google.com/store/apps/details?id=gov.career",
      "currentVersionReleaseDate": "April 23, 2018",
      "userRatingCount": 236,
      "size": "11M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=PageUp",
      "averageUserRating": 3.2,
      "version": "12.00",
      "minimumOsVersion": "4.0 and up",
      "bundleId": "gov.career",
      "downloads": "50,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "MSS’ Weather@SG provides the latest warnings, forecasts and observations at your fingertips. Through this app, users can:\n• Receive warnings of heavy rain and other hazards\n• Access weather forecasts\n• View real-time weather observations \n\n---------------------------------------------------------------------------\n\nFor a full suite of weather information, please visit http://www.weather.gov.sg or follow MetServiceSG on Twitter to receive more updates.\n\nThe Meteorological Service Singapore (MSS) is Singapore’s national authority on the weather and climate. It is an operations division under the National Environment Agency (NEA).\nOur mission is to observe and understand the weather and climate affecting Singapore and to provide services in support of national needs and international co-operation. The key areas within the mission include:\n• Collecting and maintaining of reliable long-term national weather records\n• Providing reliable weather and climate services\n• Conducting high quality research to advance understanding and prediction of the weather and climate of Singapore and the region\n• Performing risk and impact assessment of natural environmental hazards\n\nThis application is a service of the Singapore government.\n",
      "appName": "Weather@SG",
      "releaseNotes": "Updated the MRT network map",
      "developerName": "Meteorological Service Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.weather.weatheratsg.production",
      "currentVersionReleaseDate": "December 20, 2017",
      "userRatingCount": 353,
      "size": "10M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Meteorological+Service+Singapore",
      "averageUserRating": 4.0,
      "version": "1.0.8",
      "minimumOsVersion": "4.0 and up",
      "bundleId": "sg.gov.weather.weatheratsg.production",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "New OneMap is the authoritative national map of Singapore with the most detailed and timely updated information developed by the Singapore Land Authority. There are also many useful day-to-day information and services contributed by government agencies.\n\nFeatures of OneMap:\n\nSEARCH: Search for addresses with postal codes and building names.\n\nNAVIGATION: Get driving and public transport directions with walking routes.\n\nFIND NEARBY INFORMATION: Locate nearby amenities and government information.\n\nMAP STYLES: Select from a range of base maps.\n\nFREE TO USE: All maps and features are free to use. No in-app purchases.\nIf you have any questions or feedback, please drop us an email at onemap@sla.gov.sg\n\nFollow us on Facebook: www.facebook.com/OneMap\n",
      "appName": "OneMap",
      "releaseNotes": "- Bug fixes. - App backend improvements. - Notifications display. - Journey to the past via One Historical Map.",
      "developerName": "Singapore Land Authority",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.onemap.android.onemap2",
      "currentVersionReleaseDate": "November 23, 2018",
      "userRatingCount": 244,
      "size": "18M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Singapore+Land+Authority",
      "averageUserRating": 3.6,
      "version": "2.0.7",
      "minimumOsVersion": "4.4 and up",
      "bundleId": "sg.onemap.android.onemap2",
      "downloads": "50,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of the Government of Singapore.\n\nThe PaC@Gov mobile application is developed by the Accountant-General’s Department to provide Singapore Government serving officers and pensioners with convenient access to their pay, claims and medical bills information. They can submit claims on-the-go and receive notifications anytime, anywhere. \n\nDate of official launch: 6 February 2017\n\nIf you have any query on the application, please send it to us via the “Help” icon on the menu page. By downloading, you agree to the Terms of Use and Privacy Statement of the PaC@Gov Mobile App.\n",
      "appName": "PaC@Gov",
      "releaseNotes": "We update the app regularly to make it better for you. Get the latest version to enjoy all available features and improvements. Thank you for using PaC@Gov Mobile App!",
      "developerName": "Accountant-General's Department",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.neseapl.pacgov",
      "currentVersionReleaseDate": "November 28, 2018",
      "userRatingCount": 157,
      "size": "22M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Accountant-General%27s+Department",
      "averageUserRating": 3.5,
      "version": "1.8.7",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "com.neseapl.pacgov",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Customs@SG is a latest service offering by Singapore Customs. \n\nTravellers with purchases exceeding their personal duty free concession or Goods & Services Tax (GST) relief can use the app to declare and pay the duty and/or GST for the goods purchased, anytime anywhere prior to their arrival in Singapore. \n\nThe app also allows members of the public to provide timely tip-off on customs offences, feedback or send enquiries relating to Customs matters. \n\nWith Customs@SG, you can easily access the following services at your fingertips: \n\n- Declare and pay duty and/or GST on your overseas purchases\n- Provide tip-offs on customs offences\n- Provide feedback on customs matters\n",
      "appName": "Customs@SG",
      "releaseNotes": "Bug fixes and performance improvements",
      "developerName": "Singapore Customs",
      "appViewUrl": "https://play.google.com/store/apps/details?id=org.customs.gov.sg",
      "currentVersionReleaseDate": "April 11, 2018",
      "userRatingCount": 42,
      "size": "3.9M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Singapore+Customs",
      "averageUserRating": 2.8,
      "version": "1.5.1",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "org.customs.gov.sg",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "myENV app will need access to certain features on your phone for the following reasons:\n\n• Location\nUse your phone’s location to provide you with localised weather information.\n\n• Phone\nLet you call NEA hotline conveniently with just one touch.\n\n• Photos/Media/Files\nAllow you to save photographs taken with myENV app in your phone and to attach them when you file a report to NEA.\n\n• Camera\nAccess the phone’s camera if you wish to attach a photograph while making a Report to NEA.\n\n• Device ID & Call Information\nRead your phone’s UUID so that you can register and receive push notifications. \n---------------------------------------------------------------------\nGet the latest environmental news updates and information at your finger tips based on your current location with myENV:\n\n• Access real-time information on Singapore’s weather and receive heavy rainfall alerts\n• View latest air quality information\n• Locate dengue clusters and improve dengue situation awareness\n• Search for hawker centres by name or proximity\n• Obtain useful information such as current listings of licensed food caterers and vector control operators\n• Get 3R (Reduce, Reuse and Recycle) tips\n• View latest NEA’s events and happenings\n• Sign up as a volunteer\n• Submit your feedback to NEA on your mobile device and many more!\n\nFor a full suite of information and online services, please visit http://www.nea.gov.sg or follow NEAsg on Twitter to receive more updates.\n\nThis application is a service of the Singapore Government.\n\n\nTag: NEACQSD00093\n",
      "appName": "myENV",
      "releaseNotes": "- Bug fixes",
      "developerName": "National Environment Agency",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.nea",
      "currentVersionReleaseDate": "June 30, 2018",
      "userRatingCount": 2415,
      "size": "24M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=National+Environment+Agency",
      "averageUserRating": 3.7,
      "version": "2.6.6",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "sg.gov.nea",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "UPDATE (24/10): We are looking into the \"settings altered\" alert prompt reported by our users. The app was designed with stringent security measures to safeguard our SingPass accounts. We kindly ask for your patience while the team investigates more based on the reports received so far. Thank you!\n\nLog in within seconds using your fingerprint or 6-digit passcode.\n\nKEY FEATURES\n\n- Say goodbye to long passwords\n\nWith the SingPass Mobile app, you don’t have to enter your SingPass ID or password. Simply scan or tap the QR code to launch the app, verify and you’re in!\n\n- Transact securely on-the-go\n\nGoing for a holiday or staying overseas? Enjoy greater mobility when you use the new SingPass Mobile app. No more waiting for SMS OTP, or carrying a token around!\n\n- Be secure every step of the way\n\nWe’ve got several layers of security measures in place to protect your personal data. You only need to log in with your fingerprint or enter a 6-digit passcode to verify your identity for all transactions.\n\n- Log in like a pro with QR\n\nLog in by scanning a QR code using your SingPass Mobile QR code scanner. If you’re using a mobile device, simply tap on the QR code to launch the app.\n\n- Better together\n\nWe will be adding new features into the app to help you manage your data and transactions better, so keep your app updated!\n\nSET UP IN 3 EASY STEPS\n\nTo set up, all you need is a smartphone, an internet connection, and a registered SingPass account.\n\n- Step 1\nInstall SingPass Mobile by clicking the button above.\n\n- Step 2\nComplete a one-time set up.\n\n- Step 3\nYou’re all set. Log in to government digital services using your fingerprint or 6-digit passcode – it’s that simple!\n\nFEEDBACK\n\nWe want to hear from you! For any feedback or questions, please email us at support@singpass.gov.sg.\n\nNote: SingPass Mobile can only be installed on one device at a time.\n\nThis application is bought to you by the Government Technology Agency of Singapore.\n\nAPP PERMISSIONS\n\nIn order to provide the service, the app requests certain permissions.\n\n[Mandatory]\nPhone: Your Device ID is used to tie your device to your SingPass account as part of the verification process during logins. Android groups Device ID and call information in a single permission group, but the app does not access or monitor your calls.\n\n[Mandatory]\nPhotos, media and files: This allows us to save an identifier to prevent unauthorised access and help troubleshoot issues in a timely fashion if needed. The app does not access, read or store any of your personal files.\n\nThe following requirements are recommended for an optimised user experience:\n- Minimum Android version 4.4\n- At least 100MB storage space\n- Google Play services installed\n",
      "appName": "SingPass Mobile",
      "releaseNotes": "Improved stability for fingerprint login Reduced app install size Bug fixes and stability improvements",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.ndi.sp",
      "currentVersionReleaseDate": "November 23, 2018",
      "userRatingCount": 506,
      "size": "23M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Government+Technology+Agency",
      "averageUserRating": 3.4,
      "version": "1.0",
      "minimumOsVersion": "4.4 and up",
      "bundleId": "sg.ndi.sp",
      "downloads": "50,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of Singapore Government.\n\nA new version of NLB Mobile with new nifty features.\n\nProvided by the National Library Board Singapore, the application allows library patrons to:\n\n• Set up multiple user profiles\n• Borrow library items by scanning barcodes \n• Manage loans and reservations\n• Search the library catalogue\n• View events happening at each library\n• Online payment of fees\n• Borrow and read ebooks in the same app\n• View loan and reservation histories\n• Bookmark favourite items\n",
      "appName": "NLB Mobile •",
      "releaseNotes": "- Use the autocomplete feature within the search for easier search - Redeem your points for Book Bug cards - New Account layout for easier and faster navigation - Minor enhancements and bug fixes.",
      "developerName": "National Library Board, Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.nlb.nlbmobile",
      "currentVersionReleaseDate": "November 30, 2018",
      "userRatingCount": 583,
      "size": "29M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=National+Library+Board,+Singapore",
      "averageUserRating": 3.2,
      "version": "2.4",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "sg.gov.nlb.nlbmobile",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Police@SG is the initiative from the Singapore Police Force, which gives members of public access to useful information on the go. With Police@SG, everyone will have the following services at their fingertips:\n\n- Read the latest crime news, police appeals for information and missing persons\n- Locate the nearest police station from your current location\n- Share content on Facebook and Twitter\n- Links to Singapore Police Force homepage, recruitment and social media sites\n- Submit information or respond to police appeals via our information submission portal \"i-Witness\"\n\nThe Singapore Police Force - A force for the Nation\n",
      "appName": "Police@SG",
      "releaseNotes": "Minor bug fixes on iWitness module",
      "developerName": "Singapore Police Force",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.spf.policesg",
      "currentVersionReleaseDate": "October 12, 2018",
      "userRatingCount": 375,
      "size": "30M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Singapore+Police+Force",
      "averageUserRating": 3.9,
      "version": "3.0.16",
      "minimumOsVersion": "4.2 and up",
      "bundleId": "com.spf.policesg",
      "downloads": "50,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "SG TravelKaki provides you with important information on what travellers can (and cannot) bring back into Singapore from their overseas trips. \n\nThe app also allows you to:\n\n1. View the latest travel notices and advice for Singaporeans going overseas\n2. Sign up for eRegister on the go \n\nSG TravelKaki app is developed by Agri-Food & Veterinary Authority of Singapore and supported by:\n\n• Central Narcotics Bureau\n• Health Sciences Authority\n• Immigration & Checkpoints Authority of Singapore\n• Ministry of Foreign Affairs\n• Singapore Customs\n• Singapore Police Force\n\n\nLet us know what you think and how we can improve the app at ava_apps@ava.gov.sg.\n",
      "appName": "SG TravelKaki",
      "releaseNotes": "Enhancements",
      "developerName": "Agri-Food & Veterinary Authority of Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.thisiscolony.ava",
      "currentVersionReleaseDate": "July 23, 2018",
      "userRatingCount": 31,
      "size": "15M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Agri-Food+%26+Veterinary+Authority+of+Singapore",
      "averageUserRating": 4.0,
      "version": "2.19",
      "minimumOsVersion": "4.2 and up",
      "bundleId": "com.thisiscolony.ava",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of the Singapore Government.\n\nSee an interesting animal or plant? Share it with us through the SGBioAtlas app! SGBioAtlas is a citizen-science platform for nature lovers to share their biodiversity sightings and uses crowd-sourced information to map the distribution of flora and fauna across Singapore. It is not only simple to use, it is also a fun way to learn more about the amazing diversity of animals and plants in our City in a Garden. Every sighting you record will contribute to our database of precious local biodiversity.\n\nThis app is brought to you by the National Parks Board (NParks) as part of the Community in Nature (CIN) initiative. As the lead agency on nature conservation, NParks has developed an urban biodiversity conservation model, which aims to conserve representative eco-systems in land-scarce Singapore. NParks also monitors and coordinates measures to enhance the presence of biodiversity in our urban landscape.\n\nFind out more about us at www.nparks.gov.sg.\n\nDate released: 16 Apr 2015\n\nFor technical issues, please e-mail biome_support@neseapl.com\n\nFor general queries, please e-mail CIN@nparks.gov.sg.\n",
      "appName": "SGBioAtlas",
      "releaseNotes": "Application bug fix",
      "developerName": "National Parks Board",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.nparks.BiodiversityApp",
      "currentVersionReleaseDate": "October 12, 2018",
      "userRatingCount": 42,
      "size": "21M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=National+Parks+Board",
      "averageUserRating": 2.5,
      "version": "2.0.1",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "sg.gov.nparks.BiodiversityApp",
      "downloads": "5,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "The MFA@SG mobile app provides Singaporean travellers with convenient access to real-time updates of consular information and services, including eRegister and Travel Notices. It has a geolocation feature to help you locate the nearest Singapore Overseas Mission based on your current location. Download it today and stay in touch!\n",
      "appName": "MFA@SG",
      "releaseNotes": "-fixed the issues -fixed security issues",
      "developerName": "Ministry of Foreign Affairs",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.mfa",
      "currentVersionReleaseDate": "October 12, 2018",
      "userRatingCount": 179,
      "size": "30M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Ministry+of+Foreign+Affairs",
      "averageUserRating": 2.9,
      "version": "4.0.8",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "sg.gov.mfa",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "IMDA’s Wireless@SG app provides features catering to the needs of people who are constantly \"on the move\". Through this app, users can:\n\n- Setup Wireless@SG and get connected automatically\n- View and find the nearest up-to-date Wireless@SG hotspots\n- Rate the Wireless@SG hotspots\n\nTo help us improve this app, you are welcome to email us at: info@imda.gov.sg\n\nNote: You may incur data charges while using this application. You are encouraged to keep track of your data usage from time to time\n\nDisclaimer: Continued use of GPS running in the background can dramatically decrease battery life.\n",
      "appName": "Wireless@SG",
      "releaseNotes": "Improved compatibility with Android 7 and above",
      "developerName": "Info-communications Media Development Authority",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.nanoequipment.idawirelesssg",
      "currentVersionReleaseDate": "July 27, 2018",
      "userRatingCount": 1194,
      "size": "5.5M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Info-communications+Media+Development+Authority",
      "averageUserRating": 2.8,
      "version": "3.4",
      "minimumOsVersion": "4.0 and up",
      "bundleId": "com.nanoequipment.idawirelesssg",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of Singapore Government\n\nAbout ACRA On The Go\nACRA On The Go is a mobile extension of some of the frequently used services currently available on BizFile+ - ACRA’s online business filing and information portal.\n\nYou can conduct free directory search of all the business entities registered with ACRA. This allows directors, business owners and staff of the entities, business associates, securities, research companies or consumers to conduct due diligence checks on the business entities. In addition, they can also purchase business profiles, compliance and financial profiles, or extracts via the app to get detailed information on the business entities.\n\nYou can also perform a range of filing service such renewal of business registration, change of address for Business/ LP/ LLP, transaction status enquiries and many other services while on the go.\n\nThe following services are available on the ACRA On The Go mobile app:\n\n1. Directory Search – You can search for business related information such as UEN, business name, business status, business address, industry and year of financial statements filed.\n\n2. iShop@ACRA – You can purchase business information products such as Business Profile, electronic certificates and extracts, etc.\n\n3. Transaction Enquiry – You can check the status of your transaction which you have lodged with ACRA.\n\n4. Renewal of Business/ LP and other filing services – You can do other filing services such as Change of Address for Business/ LP/ LLP, Change of FYE for Local Company, Annual Declaration Filing for LLP and Cessation of Business/ LP.\n\n5. AGM Calculator – You can use our calculator to help you to calculate your AGM due date for local companies, annual filing due date for foreign company or annual declaration due date for LLP.\n\n6. Ask Jamie – Our virtual assistant ‘Ask Jamie@ACRA’ will answer your queries on matter relating to ACRA.\n\n7. ACRA Connect –You can subscribe to ACRA Connect to keep you updated on new initiatives and upcoming events. Through ACRA Connect, we also share insights into key policies and legislative changes.\n\nDate of Official Launch: 06 November 2016 \nTo provide feedback on the application,\nPlease e-mail us at\nhttps://www.acra.gov.sg/ask_ACRA_FAQs\n",
      "appName": "ACRA On The Go",
      "releaseNotes": "Integrate with Singpass Mobile App",
      "developerName": "ACCOUNTING AND CORPORATE REGULATORY AUTHORITY",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.acra.ACRAOnTheGo",
      "currentVersionReleaseDate": "October 11, 2018",
      "userRatingCount": 58,
      "size": "4.8M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=ACCOUNTING+AND+CORPORATE+REGULATORY+AUTHORITY",
      "averageUserRating": 2.4,
      "version": "3.0.6.2150",
      "minimumOsVersion": "4.0 and up",
      "bundleId": "sg.gov.acra.ACRAOnTheGo",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "We’ve refreshed our website and mobile app to bring you a brand new experience. \n\nYou can continue to access our whole range of services at your convenience:\n\n* Check your sales application results, the BTO flats available for selection, and their probable completion dates\n\n* View the recent transacted prices of resale flats and the ethnic quotas, at the location of your choice\n\n* Locate and find your way to HDB Hub, Branch, and Service Centres\n\nThe Housing & Development Board (HDB) is Singapore's public housing authority and a statutory board under the Ministry of National Development.\n\nNote:\n* Selected services may require you to use SingPass or eNETS to complete the transaction.\n* This application is a service of the Singapore Government.\n",
      "appName": "Mobile@HDB",
      "releaseNotes": "- A brand new home screen for more convenient access to our services in Mobile@HDB - Retrieve car park short-term parking charges for all vehicles types in HDB Map Services and Car Park Information in Augmented Reality",
      "developerName": "Housing & Development Board, Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=hdb.android",
      "currentVersionReleaseDate": "October 3, 2018",
      "userRatingCount": 836,
      "size": "65M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Housing+%26+Development+Board,+Singapore",
      "averageUserRating": 3.6,
      "version": "2.2.15",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "hdb.android",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of the Singapore Government.\n\nThe \"OneService\" mobile application is part of the Government’s on-going efforts to provide a convenient channel for reporting municipal issues within Singapore. The application provides for common categories of municipal issues and more features will be offered under subsequent updates.\n\nDate of Official Launch: 25 January 2015\n\nTo provide feedback on the application, please e-mail us at mso_appenquiry@mnd.gov.sg\n",
      "appName": "OneService",
      "releaseNotes": "Batch sessions into bills Enable multiple vehicle selection Bug fixes",
      "developerName": "Ministry of National Development (Singapore)",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.mnd.OneService",
      "currentVersionReleaseDate": "November 26, 2018",
      "userRatingCount": 686,
      "size": "11M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Ministry+of+National+Development+%28Singapore%29",
      "averageUserRating": 3.1,
      "version": "4.0.1",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "sg.gov.mnd.OneService",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Provide the Singapore Public Service vacancies information.\nSG Gov Job Notification provides following functions:\n1. Notification on New Jobs and on Jobs Closing\nApplication sends notification when new Jobs available and when Jobs closing.\n2. Smart Indicator\nClearly indicate for the new vacancies and vacancies approaching deadline.\n3. Minimize the use of data transfer\nThis application only downloads the information when an update is available. \nIt does not only minimize the use of data transfer, but also enhance the battery life. \n4. Jobs Detail \nTraditional Chinese and English supported in Jobs Detail when both languages could be shown at the same time for easy reference.\n5. My Favorites\nBookmark the Job Detail for easy reference. The marked Job info will keep in application even the job opening is closed.\n6. Add to Calendar\n7. Share to friends\n8. User-friendly UI\nRemark: This is not an official application of Singapore Public Service. All information is retrieved from Careers@Gov website. All information changes are subject to information from the system. For official website, please visit www.careers.gov.sg or https://careers-gov-ijpsearch.pageuppeople.com/.\n\nTags:\nSG Gov Job Notification\nSingapore Public Service\nSingapore Government Job\nSingapore\nSingapore careers\nSingapore career\nSingapore job\nSingapore jobs\nCareers@Gov\nPublic Service Division\nPrime Ministers Office\nCareers\nGov\nGovernment Vacancies\nGovernment Vacancies Enquiry System\nCivil Service\nJobs\nSG Gov Job\nSG Gov Jobs\nSG Job\nSG Jobs\nGov Job SG\nGov\nGov Job\nGov Jobs\nJobs\nJobsDB\nGood Job\nGreat Job\nJob Search\n",
      "appName": "SG Gov Job",
      "releaseNotes": "",
      "developerName": "The Top Development",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.local.sggovjob",
      "currentVersionReleaseDate": "April 1, 2015",
      "userRatingCount": 431,
      "size": "2.1M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=The+Top+Development",
      "averageUserRating": 4.2,
      "version": "1.0",
      "minimumOsVersion": "4.0 and up",
      "bundleId": "com.local.sggovjob",
      "downloads": "50,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "The Vendors@Gov mobile application is developed by the Accountant-General’s Department to facilitate government vendors to manage their e-invoices and payments on the go. Vendors can now have access to the following new functions:\n\na. View the summary status of e-invoices and projected cashflow in easy-to-understand charts; and\nb. Receive alerts on payment/rejection of e-invoices, changes in vendor account status and details, as well as broadcast messages.\n\nThe mobile application will also contain existing functions on the Vendors@Gov portal: \n\na. Viewing of e-invoices and payments; \nb. Creation and submission of e-invoices; and\nc. Viewing of vendor account details and updating of these records (except for bank account).\n\nDate of official launch: 15 June 2016\nTo provide feedback on the application, please email us at https://app.helpdesk.agd.gov.sg/public_user/vendor/vendor/helpdesk.aspx.\nBy downloading, you agree to the Terms of Use and Privacy Statement of the Vendors@Gov Mobile App.\n",
      "appName": "Vendors@Gov",
      "releaseNotes": "We update the app regularly to make it better for you. Get the latest version to enjoy all available features and improvements. Thank you for using Vendors@Gov Mobile App!",
      "developerName": "Accountant-General's Department",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.neseapl.vendorsgov",
      "currentVersionReleaseDate": "November 12, 2018",
      "userRatingCount": 34,
      "size": "2.5M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Accountant-General%27s+Department",
      "averageUserRating": 3.4,
      "version": "1.3.54",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.neseapl.vendorsgov",
      "downloads": "1,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "The new MyTransport.SG mobile app now offers you with more useful travelling information and new features to help you get around Singapore. \n\nNew features of MyTransport.SG:\n• Personalisation - Quick access to your frequently used bus service and traffic information.\n• My Notifications - Manage push notifications to receive MRT or Road alerts that interest you.\n• Near You - View information on nearby bus services, MRT stations or traffic information in the vicinity.\n• Multi-modal Journey Planner - Start planning your journey with different transport options based on your travel needs.\n\nThis application is a service of Singapore Government.\n\nDisclaimer: Continued use of GPS running in the background may decrease battery life.\n",
      "appName": "MyTransport.SG",
      "releaseNotes": "Offering more useful travel information and new features to help you get around Singapore!",
      "developerName": "Land Transport Authority",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.lta.mytransportsg",
      "currentVersionReleaseDate": "September 7, 2018",
      "userRatingCount": 615,
      "size": "17M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Land+Transport+Authority",
      "averageUserRating": 3.4,
      "version": "1.0",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "sg.gov.lta.mytransportsg",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "One-stop access to health records of your family, friends, children. Schedule your appointments, check your personal health records, access your immunisation and lab test results and more*! \n\nHealthHub is your personal digital health companion by the Ministry of Health and Health Promotion Board Singapore. \n\nFeatures: \n• Appointments: Make, view, reschedule, cancel \n\n• Medications: Access your prescription records and medication lists\n\n• Refill: Request for medication refill or renewal of prescription\n\n• Payments: Pay for your medical bills \n\n• Children Health: Track your child’s developmental milestones and vaccination records\n\n• Family Health: View your parents’ medical appointments and medication lists \n\n• School Health: Get notified of school health assessments and your child’s referral letters \n\n• Directory Listing: Find doctors, caregivers, 24 hour CHAS clinics easily\n\n• HealthPoints: Be rewarded when you read articles and complete quizzes\n\n* Participating restructured hospitals, polyclinics and specialist outpatient clinics from the public healthcare sector\n",
      "appName": "HealthHub SG",
      "releaseNotes": "Bug fixes & enhancements.",
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.hpb.healthhub",
      "currentVersionReleaseDate": "October 31, 2018",
      "userRatingCount": 1236,
      "size": "31M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Health+Promotion+Board",
      "averageUserRating": 3.5,
      "version": "2.0.7",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "sg.gov.hpb.healthhub",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "MySkillsFuture empowers you on your learning journey and career path. Uncover insights into various industries and jobs, find courses to help you upskill, read informative articles and online resources to support your career exploration, and join events to unlock learning and career opportunities.\n",
      "appName": "MySkillsFuture",
      "releaseNotes": "• Security update • Fine-tuned UI design • This updated version is only supported on devices running Android 5.0 and above",
      "developerName": "SkillsFuture Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.skillsfuture.msf",
      "currentVersionReleaseDate": "November 1, 2018",
      "userRatingCount": 89,
      "size": "15M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=SkillsFuture+Singapore",
      "averageUserRating": 2.0,
      "version": "2.1.4",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "sg.skillsfuture.msf",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of Singapore Government.\n\nBe empowered for an all new travelling experience\n\nMyTransport.SG Mobile, an award winning app launched by Land Transport Authority (LTA), is a content-rich service offering a wide range of information for all modes of land transportation – empowering commuters, motorists and cyclists in Singapore to make informed decisions and better plan their journey, with these features:\n\n• Personalise your favourite services with MyConcierge\n• Search and locate nearby bus stops and service number with bus route details\n• Get real-time island-wide bus arrival information\n• Search and locate nearby taxi stands and quick dial for taxi booking services\n• Report road defects via Snap & Send \n\n• Get real-time parking lots availability for popular locations\n• Plan route with Traffic News and ERP Gantries on Traffic Smart\n• View live traffic images along all expressways round the island\n• Receive notification on expressways traffic news during peak hours and train service delay information\n• Explore cycling towns, routes, and parking facilities\n• Find out lifestyle events and promotions nearby\n\nThis app is proud to be a multiple local and international awards winners in:\n\n• 2014 Best Global m-Government Service Award, Dubai\n• 2013 Singapore infocomm Technology Federation (SiTF) Awards, Gold Winner in Most Popular Mobile Apps category and Silver Winner in Mobile Applications category\n• 2013 UiTP Grow with Public Transport International Awards, Integrated Mobility category\n• 2013 eGov Excellence Awards, Distinguished Winner in mServices category\n• 2013 Singapore Mobile Excellence Awards, Gold Winner in Best App/Content by Government/Community category\n• 2012 Summit Emerging Media Awards, Visionary Award in Navigation App category \n• 2012 W3 Awards, Silver Award in Maps and Navigation mobile app category\n\nFor the full suite of land transport information and e-Services, please visit: http://www.mytransport.sg\n\nDisclaimer: Continued use of GPS running in the background can dramatically decrease battery life.\n",
      "appName": "MyTransport Singapore",
      "releaseNotes": "General enhancements and bug fixes",
      "developerName": "Land Transport Authority",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.lta.mytransport",
      "currentVersionReleaseDate": "November 3, 2017",
      "userRatingCount": 6072,
      "size": "14M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Land+Transport+Authority",
      "averageUserRating": 3.3,
      "version": "3.3.1",
      "minimumOsVersion": "2.3 and up",
      "bundleId": "sg.gov.lta.mytransport",
      "downloads": "1,000,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "CorpPass is the required login method for online transactions with the government. First launched for Singapore-registered business entities and SingPass-backed users, it is now available for foreigners who need to transact with the Singapore government.\n\nEnjoy the following benefits with CorpPass.\n\n• Enhanced data protection for businesses and employees, with separate login IDs for corporate and personal matters\n\n• Increased convenience to transact with multiple government agencies, with each user having a single corporate digital identity and no longer handling multiple login IDs for different services.\n\n• Better internal control within businesses, as key personnel can grant and manage employees access to each government digital service.\n\nFor more information, visit www.corppass.gov.sg/corppass/common/findoutmore > Foreign Registered Entities Tab.\n",
      "appName": "CorpPass 2FA for Foreigners",
      "releaseNotes": "Improved stability for fingerprint login Reduced app install size Bug fixes and stability improvements",
      "developerName": "Government Technology Agency",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.ndi.cp",
      "currentVersionReleaseDate": "November 28, 2018",
      "userRatingCount": 26,
      "size": "13M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Government+Technology+Agency",
      "averageUserRating": 2.4,
      "version": "1.0",
      "minimumOsVersion": "4.4 and up",
      "bundleId": "sg.ndi.cp",
      "downloads": "1,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of the Singapore Government.\n\nCPF Starter is a handy resource tool that gives an overview of your CPF, from projecting the growth of your CPF savings to how you can better use these savings for your housing, healthcare and retirement needs.\n\nCPF Starter won the Mob-Ex Awards 2016 for Best App - Utility (Gold) and Best App - Creative (Bronze).\n\nFeatures: \nCPF Savings Projection:\n- Calculate how much CPF contributions you and your employer need to make\n- Find out how much CPF goes into your Ordinary, Special and MediSave Accounts\n- Project how your CPF savings will grow over the years in each of these accounts with the power of compound interest\n\nMy Messages\n- Get the latest CPF news and notifications about upcoming events on the go\n\nInformation on using CPF for Housing, Healthcare and Retirement: \n- Learn more about the various CPF schemes and services\n- Get useful tips on managing cash flow\n",
      "appName": "CPF Starter",
      "releaseNotes": "Updated information.",
      "developerName": "CPF Board",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.cpf.cpfstarter",
      "currentVersionReleaseDate": "September 10, 2018",
      "userRatingCount": 6,
      "size": "11M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=CPF+Board",
      "averageUserRating": 4.0,
      "version": "1.2.1",
      "minimumOsVersion": "4.3 and up",
      "bundleId": "com.cpf.cpfstarter",
      "downloads": "1,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "The EventTech for Gov SG app is the official mobile app for the Event Tech for Singapore Government event. With the app, it’s convenient for you to have an overall look at the programme and design your schedule.\n",
      "appName": "EventTech for Gov SG",
      "releaseNotes": "",
      "developerName": "Actigage Pte Ltd",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.actigage.event_tech_for_govt",
      "currentVersionReleaseDate": "November 14, 2017",
      "userRatingCount": 0,
      "size": "16M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Actigage+Pte+Ltd",
      "averageUserRating": 0,
      "version": "1.16.185",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.actigage.event_tech_for_govt",
      "downloads": "10+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Enjoy fast and easy access to commonly used statistics on Singapore’s economy and population with the SingStat mobile app. The data are presented in chart and tabular formats covering 25 data categories, including Population, Prices, Labour, Manufacturing, Services and International Trade.\n\nIts key features include allowing the selection of data frequency (e.g. monthly, quarterly or annual), presentation of data in chart or tabular form, drilled down function for data to more detailed levels, information on the data coverage and definition, and release dates of key statistical indicators.\n\nFor more information, please visit https://www.singstat.gov.sg/our-services-and-tools/singstat-mobile-app\n\nThe mobile application is designed for devices with Android OS 4.1.2 and above.\n",
      "appName": "SingStat",
      "releaseNotes": "Minor adjustments",
      "developerName": "Singapore Department of Statistics",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.singstat",
      "currentVersionReleaseDate": "September 25, 2018",
      "userRatingCount": 66,
      "size": "18M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Singapore+Department+of+Statistics",
      "averageUserRating": 4.0,
      "version": "1.5.2",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "sg.gov.singstat",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Features the top job sites in Singapore. \n\nWe rank the different job sites based on Alexa Ranking so you get the most reputable and trustworthy sites first. We understand the hassles of looking for a job so we tried to make it a little bit simpler. Don't miss any job opportunity, browse through different job sites easily with this fast and beautiful app with significantly less ads.\n\nNow includes interview tips such as what to wear, answers to common questions, how to prepare, tips on writing CV and Decider feature. Check it out! \n\nSites include:\n\nJobstreet\nJobsDB\nIndeed \nJobscentral\nMonster \nand much more\n\nBrowse through jobs related to:\n\nAccounting and Finance\nMarketing\nIT\nAdmin\nHR\nHealthcare\nF&B\nOperations\nRetail\nConstruction\nDesign\nProperty\nTransportation\nand others\n\n*Note that the developers of this app are not affiliated nor does it represent any of the featured job site within this app. This simple app only intends to make life easier for people searching for jobs. This app uses Google Analytics to anonymously note usage data to help improve the app. You can easily turn this off inside the app's settings.\n",
      "appName": "Jobs in Singapore",
      "releaseNotes": "Version 2.4 Our very BEST version yet! *Compiles jobs from different sites based on occupation *Design improvements",
      "developerName": "SunOneApps.com",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.sunoneapps.jobsinsingapore",
      "currentVersionReleaseDate": "September 15, 2018",
      "userRatingCount": 51,
      "size": "4.5M",
      "developerViewUrl": "https://play.google.com/store/apps/dev?id=5883421560769933545",
      "averageUserRating": 4.5,
      "version": "2.4",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "com.sunoneapps.jobsinsingapore",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Wondering how much difference that pay rise would make in Singapore? Use our app to work out tax and reliefs on your wage for Year of Assessment 2017, based on the official rates from the Inland Revenue Authority of Singapore (IRAS).\n\nSimply enter your income. The calculator will then show you your effective tax rate and after-tax income.\n\nTaking into account:\n- Employment income\n- Employment expenses\n- Trade, business or vocation\n- Dividends\n- Interest\n- Rental income from property\n- Royalty, charge, estate income\n- Gains or profits of an income nature\n- Approved donations\n- Earned income relief\n- Working mother relief\n- Parent relief\n- Grandparent caregiver relief\n- CPF (Central Provident Fund) relief\n- Life insurance relief\n- Course fees relief\n- Foreign maid levy relief\n- CPF cash top-up relief\n- Supplementary retirement relief\n- NSman relief\n",
      "appName": "Singapore Income Tax",
      "releaseNotes": "App launch",
      "developerName": "Zenapp",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.appdefrance.singaporeincometax",
      "currentVersionReleaseDate": "July 21, 2017",
      "userRatingCount": 6,
      "size": "4.8M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Zenapp",
      "averageUserRating": 4.2,
      "version": "1.0",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.appdefrance.singaporeincometax",
      "downloads": "1,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Hello Everyone, \n\nStreetdirectory App comes Offline maps & real-time bus timing\n\nExciting Feature\n★ The most up-to-date Singapore maps\n★ Bus arrival time \n★ 2016 Singapore Maps\n★ 2016 Johor Maps\n★ latest Bus-stops and train stations with real-time data. \n★ Free Offline Maps, once you download the offline map, you can use the map without internet connection.\n★ Directions by Car, Taxi, Bus & MRT\n★ Traffic, Bus timing & ERP pricing information\n★ Complete 2016 Business directory data for SG businesses and retailers.\n",
      "appName": "Singapore Map",
      "releaseNotes": "patch notes: - fix map rendering for some Android Oreo (8.1) and Pie  (9.0) devices - improve map cache management, reducing bandwidth usage. 1. Whats New - Unlimited History Searches (Previously only 3) - Easily share map location, directions & businesses - Easily save your favourite locations (no login required) - Easily search from map page 2. New & updated data - updated carpark rates in all buildings - New bus-stops added - Updated ERP rates - All mosques shows prayer times - 2018 Maps",
      "developerName": "Streetdirectory Pte Ltd",
      "appViewUrl": "https://play.google.com/store/apps/details?id=streetdirectory.mobile",
      "currentVersionReleaseDate": "August 16, 2018",
      "userRatingCount": 7021,
      "size": "15M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Streetdirectory+Pte+Ltd",
      "averageUserRating": 3.7,
      "version": "Varies with device",
      "minimumOsVersion": "Varies with device",
      "bundleId": "streetdirectory.mobile",
      "downloads": "1,000,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Singapore has a huge capacity to adjust foreigner skilled and experienced workers in different departments. \nSingapore n government always tries to hire more skilled and trained labor and workers from other countries for its industries and other companies. \nSingapore normally hires these workers through local, but reputable recruiting agencies.\nHowever, there are thousands of recruiting agents which hire workers under the supervision of Singapore n management. \nSingapore labor ministry tries to issue work visa to skilled workers in different categories.Singapore i Visa Check Visa Services. \nSingapore Visa Check All Services, Check On here Singapore Visa Check Application Traffic Inquiries • \nVisa inquiry Visa Services • Exit-Entry Services Exit & Entry Permits • Residency Permits inquiry • \nOther Inquiries, Oman Visa Check is Most Popular Application For Checking of Singapore Visa Enquiry Portal\n\n-: You Can Check Your Singapore Visa Status On Singapore ai Visa Check App\n\nSingapore visa\nSingapore visa check\nSingapore visa status\nSingapore visa for Indian\nSingapore visa application\nSingapore visa for Pakistani\nSingapore visa for Pakistani in Urdu\nSingapore visa for pakistani nationals\nSingapore bai visa for pakistani citizens\nSingapore visa for pakistani requirement\nSingapore visa for indians\nSingapore visa for indian free\nSingapore free visa rules\nSingapore visa application \nSingapore For a Nonimmigrant Visa\nSingapore visit visa online\nSingapore id check\nSingapore visa number checking\n\nSingapore Visa Online \nVisa Status Check\nTourist Visa\nFAQ\n",
      "appName": "Singapore Visa Check",
      "releaseNotes": "Online Singapore Visa Check and Visa Apply",
      "developerName": "Visa Checker",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.visa.singaporevisacheck",
      "currentVersionReleaseDate": "August 2, 2018",
      "userRatingCount": 2,
      "size": "1.9M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Visa+Checker",
      "averageUserRating": 5.0,
      "version": "1.0",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.visa.singaporevisacheck",
      "downloads": "1,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Healthy 365 mobile app is brought to you by the Health Promotion Board (HPB).\nThis app enables you to track your daily steps count and calculate the corresponding calories burned as you move. Among other tracking sources, you can use Samsung Health to track steps. With a compatible wearable that tracks heart rate, you can also track the duration engaged in higher intensity physical activities. Steps and heart rate data from Samsung Health can be shared with Healthy 365 mobile app while participating in Health Challenges.\n\n\nKey features include:\n• Dashboard that provide you with an overview of your fitness, Healthpoints and rewards information.\n• Health Challenges that enable you to step up to get healthy, earn Healthpoints and redeem rewards\n• New Eat Drink Shop Healthy Challenge digital passport with more rewards that can be earned along with Healthpoints when you make healthier purchases\n• History charts to keep records of your past steps count, heart rate, distance covered and calorie intake and output \n• Healthpoints history function that allows tracking of your scans from healthier food, drink or grocery consumption\n• Nearby listing and map views on HPB events, healthier eateries, exercise facilities and routes in your vicinity\n• Integration with new HPB steps trackers and exercise apps including Actxa® and Fitbit® \n• Sync for Friends function to allow both non-smartphone and smartphone participants to conveniently sync their steps on their friend or family member’s smartphone\n• Background location detection of nearby Scan&Win Hotspots for earning Healthpoints\n\nNote:\n• This app uses background location for detection of outdoor Hotspots\n• Continued use of GPS running in the background may dramatically decrease battery life\n• For the optimum experience, please ensure that your phone is set to Singapore Time zone (GMT +8)\n• For any enquiries, please call our hotline at 1800 567 2020 or email us at stepschallenge@hpb.gov.sg\n",
      "appName": "Healthy 365",
      "releaseNotes": "This app release includes the following updates/changes: • Support for Polar fitness app to pair with and allow Healthy 365 to retrieve Steps & Heart Rate data • Enhanced security using OTP verification when performing healthpoints related transactions • Miscellaneous bug fixes",
      "developerName": "Health Promotion Board",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.hpb.healthy365",
      "currentVersionReleaseDate": "November 22, 2018",
      "userRatingCount": 25334,
      "size": "85M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Health+Promotion+Board",
      "averageUserRating": 3.8,
      "version": "4.2.0",
      "minimumOsVersion": "4.4 and up",
      "bundleId": "sg.gov.hpb.healthy365",
      "downloads": "500,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "SGWorkPass is a free mobile app to check the validity of work passes / long term passes issued by the Singapore Ministry of Manpower (MOM).\n\nA must have app for all employers, foreign employees, agents or anyone who wishes to verify if a work pass / long term pass card issued by MOM is valid. You will need a Singapore mobile number for a one-time registration in order to start using the app.\n\nScan it to check it\nA work pass / long term pass may be cancelled before it expires as employment / stay status can change over time. When this happens, the pass holder is not allowed to continue working / staying in Singapore. Simply launch the SGWorkPass app to scan the QR code of a work pass / long term pass card and you can verify its validity instantly.\n\nNo QR Code? No problem!\nIf the work pass / long term pass card doesn’t have a QR code, you can verify it using the unique Card Serial Number printed on the card.\n",
      "appName": "SGWorkPass",
      "releaseNotes": "System enhancements",
      "developerName": "Ministry of Manpower",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.mom.sgworkpass",
      "currentVersionReleaseDate": "October 15, 2018",
      "userRatingCount": 470,
      "size": "30M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Ministry+of+Manpower",
      "averageUserRating": 4.4,
      "version": "1.0.5",
      "minimumOsVersion": "4.2 and up",
      "bundleId": "sg.gov.mom.sgworkpass",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "SGSecure is a national movement to sensitise, train and mobilise Singaporeans to play a part to prevent and deal with a terrorist attack.\n\nUse the SGSecure app to: \n- Receive important broadcast messages from the authorities on the latest situation in the event of major emergencies\n- Seek assistance from the authorities should a major situation happen in your vicinity\n- Send videos, photos and messages to the authorities to provide information on a situation which you have witnessed\n- Access links to Police@SG and myResponder apps\n- Access links to the SGSecure programme information and information that can help you to better protect and take care of yourself and others in an emergency. \n\nPlease note that continued use of GPS running in the background can dramatically decrease battery life.\n",
      "appName": "SGSecure",
      "releaseNotes": "- Access terror-related travel advisories and notices by MFA - UI enhancements Please update to the latest version as some of the functions may not work in earlier versions.  For Support, please contact: - Telephone: 66849554 or Email: SGSecure_TechSupport@ncs.com.sg",
      "developerName": "Ministry of Home Affairs (Singapore)",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.ministryofhomeaffairs.sgsecure.mhasg",
      "currentVersionReleaseDate": "August 31, 2018",
      "userRatingCount": 1186,
      "size": "12M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Ministry+of+Home+Affairs+%28Singapore%29",
      "averageUserRating": 2.6,
      "version": "1.3.5",
      "minimumOsVersion": "4.4 and up",
      "bundleId": "com.ministryofhomeaffairs.sgsecure.mhasg",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "The Master Plan is the statutory land use plan which guides Singapore's development in the medium term over the next 10 to 15 years. The Master Plan shows the permissible land use and density for developments in Singapore and is reviewed every five years. The Master Plan is to be read together with the Master Plan Written Statement.\n\nThis is the Master Plan 2014. The Master Plan 2014 and Master Plan Written Statement 2014 have been approved by the Minister for National Development on 27 May 2014. The Master Plan Written Statement 2014 and all subsequent amendments to the Master Plan and the Master Plan Written Statement are available at the Urban Redevelopment Authority (URA) website at http://www.ura.gov.sg/.\n\nWhilst every endeavour has been made to ensure that the contents of the Master Plan 2014 is represented accurately, the URA and the Singapore Government disclaim all liability for any injury, loss or damage whatsoever that may arise as a result of any inaccuracy, error or omission.\n\n©Singapore Government. All rights reserved.\n",
      "appName": "Master Plan 2014 – Singapore",
      "releaseNotes": "Bug fixes.",
      "developerName": "Urban Redevelopment Authority (URA)",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.gov.ura.mp.MP",
      "currentVersionReleaseDate": "June 11, 2014",
      "userRatingCount": 57,
      "size": "454k",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Urban+Redevelopment+Authority+%28URA%29",
      "averageUserRating": 3.1,
      "version": "3",
      "minimumOsVersion": "2.2 and up",
      "bundleId": "sg.gov.ura.mp.MP",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Uncovering heritage and social stories.\n\nWhether you're a local or a tourist visiting Singapore, explore and embark on heritage trails and experience the untold stories behind the streets and landmarks of Singapore.\n\nSingapore Heritage Trails documents and showcases different areas that Singaporeans live, work and play. It also provides a social platform for you to participate and leave stories and memories of how these places evoke on you, bringing out rich and authentic emotions behind these historical places.\n\nThis app is created by NHB (National Heritage Board), Singapore Government in collaboration with the Crowd Trails team from Keio-NUS CUTE Center, National University of Singapore.\n",
      "appName": "Singapore Heritage Trails",
      "releaseNotes": "Bug Fixes",
      "developerName": "National University of Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=singapore.heritage.trails",
      "currentVersionReleaseDate": "November 24, 2016",
      "userRatingCount": 21,
      "size": "12M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=National+University+of+Singapore",
      "averageUserRating": 4.0,
      "version": "1.5.3",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "singapore.heritage.trails",
      "downloads": "5,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "You can now use your android phone to\n\ncalculate the CPF contributions payable\n\nfor Singapore Citizens and Singapore\n\nPermanent Residents.\n\nImportant Notes.\n\n The calculator is updated with rates\n\neffective from January 2016\n",
      "appName": "Cpfcalculator",
      "releaseNotes": "",
      "developerName": "Powered By Dickson's",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.cpfcal",
      "currentVersionReleaseDate": "November 17, 2016",
      "userRatingCount": 25,
      "size": "2.1M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Powered+By+Dickson%27s",
      "averageUserRating": 4.7,
      "version": "1.2",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.cpfcal",
      "downloads": "5,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "The written history of Singapore may date back to the third century. Evidence suggests that a significant trading settlement existed in Singapore during the 14th century. In the late 14th century, Singapura was under the rule of Parameswara until he was expelled by the Majapahit or the Siamese. It then came under the Malacca Sultanate and then the Johor Sultanate. Modern Singapore was founded in 1819, when Sir Thomas Stamford Raffles negotiated a treaty whereby Johor allowed the British to found a trading port on the island.\n\nDuring World War II, Singapore was conquered and occupied by the Japanese Empire from 1942 to 1945. When the war ended, Singapore reverted to British control, with increasing levels of self-government being granted, culminating in Singapore's merger with the Federation of Malaya to form Malaysia in 1963. However, social unrest and disputes between Singapore's ruling People's Action Party and Malaysia's Alliance Party resulted in Singapore's expulsion from Malaysia. Singapore became an independent republic on August 9, 1965.\n",
      "appName": "History of Singapore",
      "releaseNotes": "",
      "developerName": "HistoryIsFun",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.historyisfun.singapore",
      "currentVersionReleaseDate": "October 18, 2018",
      "userRatingCount": 3,
      "size": "3.4M",
      "developerViewUrl": "https://play.google.com/store/apps/dev?id=7377986157522822874",
      "averageUserRating": 3.7,
      "version": "1.4",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.historyisfun.singapore",
      "downloads": "100+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "SP Utilities brings you fast and convenient access to your utilities account on the go. You can manage your account, view and pay bills as well as subscribe to new services that you need.\n\n- Be informed about your latest bill via push notifications\n- Add and save your credit card information securely for greater convenience\n- View your smart meter consumption on daily intervals\n- Browse past bills and payment history\n- Submit meter readings for electricity, gas, water consumption\n- Manage and update your utility details\n\nWith the SP Utilities mobile app, we aim to deliver a more unified, seamless experience for our customers. SP Group is a leading energy utilities group in the Asia Pacific. It owns and operates electricity and gas transmission and distribution businesses in Singapore and Australia, and district cooling businesses in Singapore and China. SP Group is committed to providing customers with reliable and efficient energy utilities services. More than 1.4 million industrial, commercial and residential customers in Singapore benefit from SP Group’s world-class transmission, distribution and market support services. These networks are amongst the most reliable and cost-effective world-wide. For more information, please visit spgroup.com.sg or follow us on Facebook at fb.com/SPGroupSG.\n",
      "appName": "SP Utilities",
      "releaseNotes": "Go green with us! Opt out of your paper bills to earn 3,000 CapitaSTAR$ (only applicable to customers on paper bill)",
      "developerName": "Singapore Power Limited",
      "appViewUrl": "https://play.google.com/store/apps/details?id=sg.com.singaporepower.spservices",
      "currentVersionReleaseDate": "November 12, 2018",
      "userRatingCount": 877,
      "size": "7.9M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Singapore+Power+Limited",
      "averageUserRating": 3.1,
      "version": "7.0.0",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "sg.com.singaporepower.spservices",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Singapore and Johor Bahru checkpoints traffic conditions and more informations.\n\nCauseway and Second Link traffic camera images;\n\nEstimated travel time from Singapore to Johor Bahru and the other way around;\n\nPublic Holiday and School Holiday for Johor and Singapore\n\n2 hours weather forecast in Woodlands and Tuas;\n\nCurrency exchange rates for SGD, MYR and USD;\n\nMalaysia Fuel Prices for RON97, RON95 and Diesel (Updated every thursday);\n\nBookmark traffic cameras for your favourite locations\n\nFor Singapore we have over 80 traffic cameras images provided by LTA:\n\nWoodlands Checkpoint\nTuas Checkpoint\nAYE\nBKE\nCTE\nECP\nKJE\nKPE\nMCE\nPIE\nSentosa Gateway\nSLE\nTPE\n\n\nFor Johor Bahru we have 36 traffic cameras images provided by MBJB:\n\nPersimpangan Jalan Skudai / Sutera Utama\nJalan Skudai (Hadapan Taman Johor)\nPersimpangan Jalan Skudai / Jalan Tun Abdul Razak (Rat Auto)\nJalan Susur 4 (Jalan Tun Abdul Razak)\nPersimpangan Jalan Tebrau / Jalan Tun Abdul Razak\nJalan Persiaran Abu Bakar Sultan (Danga Bay)\nJalan Persiaran Abu Bakar Sultan (Dataran Bandaraya)\nJalan Persiaran Ismail Sultan / Jalan Ayer Molek (Hadapan Mahkamah)\nKM0, Hadapan MBJB\nJalan Wong Ah Fook (Hadapan Plaza Seni)\nJalan Segget (Hadapan Bangunan MIC)\nJalan Meldrum/ Jalan Siu Nam\nJalan Trus / Jalan Ungku Puan\nJalan Kempas Lama / Lebuhraya Utara Selatan\nPersimpangan Jalan Kempas Lama / Jalan Kempas Spur\nPersimpangan Bertingkat Jalan Kempas Baru / Lebuhraya Pasir Gudang\nPersimpangan Bertingkat Jalan Datin Halimah / Jalan Tampoi\nJalan Kolam Ayer (Tasik Merdeka)\nPersimpangan Pesisir Perling / Jalan Tampoi Utama\nJalan Tampoi (Hadapan Plaza Angsana)\nPersimpangan Jalan Tampoi / Jalan Ungku Mohsin\nPersimpangan Jalan Kota Tinggi / Jalan Ulu Tiram\nPersimpangan bertingkat Jalan Kota Tinggi / Persiaran Desa Tebrau\nJalan Kota Tinggi (Hadapan Pasar Borong Pandan)\nJalan Tebrau / Jalan Rebung\nJalan Tebrau (Hadapan Wisma Daiman)\nJalan Tebrau / Jalan Keris\nJalan Tebrau (Metropolis Tower)\nPersimpangan Lebuhraya Pasir Gudang /Seri Alam\nPersimpangan Jalan Pesisir Pantai / Jalan Permas Utama (AEON Permas Jaya)\nPersimpangan Jalan Pasir Pelangi / Jalan Bakar Batu\nPersimpangan Lingkaran Dalam / CIQ\nJalan Datin Halimah / Jalan Kenyalang\nPersimpangan Jalan Kempas Baru / Jalan Permatang 8\nPersimpangan Persiaran Kempas Baru / Jalan Banjaran Utama\nJalan Taruka / Jalan Padu\n",
      "appName": "JB SG Checkpoints",
      "releaseNotes": "Release 1.0.9 Improve Stability Added Public Holiday and School Holiday for Johor and Singapore",
      "developerName": "NextLabs.cc",
      "appViewUrl": "https://play.google.com/store/apps/details?id=cc.nextlabs.jb_sg_checkpoints",
      "currentVersionReleaseDate": "July 4, 2018",
      "userRatingCount": 41,
      "size": "2.9M",
      "developerViewUrl": "https://play.google.com/store/apps/dev?id=5719373617281830668",
      "averageUserRating": 4.3,
      "version": "1.0.9",
      "minimumOsVersion": "4.4 and up",
      "bundleId": "cc.nextlabs.jb_sg_checkpoints",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Wireless Singapore app brings a lighter, more useful app to those seeking free wireless hotspots in Singapore using the Wireless@SG and Wireless@SGx networks. This app is for people looking to connect Wireless Singapore loads faster, smarter, and has a more streamlined UI compared to what is currently available. In this app, users can:\n\n- View and find the nearest up-to-date hotspots\n- Browse the map to show destination hotspots available. \n\nWant improvements? Let us know by either commenting or emailing us.\n",
      "appName": "Wireless Singapore",
      "releaseNotes": "Constantly adding new hotspots! We have 1105 hotspots ready for you! This release has faster loading and allows you to use the Wireless Singapore without giving the My Location permissions - although, we still recommend it.",
      "developerName": "Vegetable Corp.",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.vegetablecorp.wirelesssingapore",
      "currentVersionReleaseDate": "October 2, 2017",
      "userRatingCount": 33,
      "size": "2.0M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Vegetable+Corp.",
      "averageUserRating": 4.2,
      "version": "1.0.5",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.vegetablecorp.wirelesssingapore",
      "downloads": "10,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "ActiveSG\n\nDownload this free mobile app and start exploring sports and activity venues located throughout Singapore. Designed for smartphone users to make searches, reservations, registrations, purchases and quick payments, all in one convenient, feature-rich app. Real-time access to all facilities and programmes made available to the public by Sport Singapore. \n\n\nKey features:\n\nAll user types\nRegistered users. Verified members. Supplementary (family) accounts. Junior (under-16) members. All can use ActiveSG with varying privileges. \n\nSmart search \nSearch for a sports facility nearby, view its location and check its amenities. Ask the app to recommend best possible venues for your interests.\n\nEnd-to-end booking\nVenue, date and time selection. Course registrations. Event sign-ups. Shopping cart with options for add-on items. Payments, cancellations and refunds.\n\nOne-touch booking\nThe app remembers all your previous bookings so you can grab your favourite slots the next time round. No need to retrace your steps.\n\nVirtual ID\nCheck in and check out of a swim or gym facility, by scanning the QR code on your mobile phone screen (after buying an entry pass).\n\nTags : ActiveSG, ActiveWallet, Active SG, Active Wallet, Sport Singapore, Sports, Swim, Gym, Facilities Booking, Programmes, iAPPS\n",
      "appName": "ActiveSG",
      "releaseNotes": "",
      "developerName": "iAPPS Pte Ltd",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.iapps.ssc",
      "currentVersionReleaseDate": "October 2, 2018",
      "userRatingCount": 5139,
      "size": "52M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=iAPPS+Pte+Ltd",
      "averageUserRating": 3.1,
      "version": "1.8.10",
      "minimumOsVersion": "4.3 and up",
      "bundleId": "com.iapps.ssc",
      "downloads": "500,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 12+",
      "description": "Free SG 4D Result checks the weekly 4D lottery results from Singapore Pools. \nIt is FREE and FAST. Result are available at 6:45pm \n\nBe sure to check your Good luck on Wed, Sat and Sun. \n\nFeatures includes:\n\n▶ Free, No in app purchase need, No membership \n▶ Get latest results Fast and consistence\n▶ Database of past results since 1986\n▶ Analyze a number and find out when it last came out\n▶ ***NEW*** Analyze by gap, Total Hits and Average Gap to next hit \n\nOnly Require Internet permission, \n\nWe do not need to read your phone identification info, \nNo need your location, \nNo need to read what apps you have downloaded\n",
      "appName": "Free SG 4D Result",
      "releaseNotes": "1.7 Stability update 1.6 Update Framework  1.4 Google Play Api Update 1.3 New Analysis with Gap, Frequency and Ranking 1.2 Tablets support and bugs fixes 1.1 Support for more Screen Size 1.0 Start of Free",
      "developerName": "Lion City Apps",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.lioncityapps.fourd",
      "currentVersionReleaseDate": "March 6, 2017",
      "userRatingCount": 333,
      "size": "3.0M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Lion+City+Apps",
      "averageUserRating": 4.2,
      "version": "1.7",
      "minimumOsVersion": "2.3 and up",
      "bundleId": "com.lioncityapps.fourd",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "#1 Resource to Search Career Oriented Jobs in Singapore\n*******************************************************************\nIf you want to start your career or thinking about switching job at Singapore and looking for better career opportunity then our online Singapore jobs application is the right tool that you need. In our Singapore job app we have gathered all best resources offering government, private, semi private, teaching, hotel, nursing, marketing, part time, full time, engineering & shopping jobs all across Singapore for Foreigners, Indians, Malaysians, Filipinos and everyone .\n\nKindly visit following well known job portals & websites of Singapore offering latest high paying jobs opportunities & vacancies all across Singapore etc.. \n\n1. Monster Singapore\n2. JobsCentral Singapore\n3. Careers Singapore\n4. STJobs Singapore\n5. JobsDB \n6. JobStreet \n7. JobsBank \n8. Recruit Singapore\n9. Indeed Singapore\n10. Jobs\n11. Linkedin Singapore\n12. RandStad Singapore\n13. CareerJet Singapore\n14. PartTimeJobs \n15. Hays Singapore\n\nJust browse and search latest jobs at Singapore for Indians, Filipinos, Foreigners & Freshers within one click range....\n",
      "appName": "Jobs in Singapore",
      "releaseNotes": "#1 Job App to get jobs in Singapore",
      "developerName": "TWKidsApps",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.singapore.searchjobsinsingapore",
      "currentVersionReleaseDate": "September 20, 2018",
      "userRatingCount": 676,
      "size": "3.0M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=TWKidsApps",
      "averageUserRating": 4.1,
      "version": "3.9",
      "minimumOsVersion": "4.0.3 and up",
      "bundleId": "com.singapore.searchjobsinsingapore",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "This application is a service of the Singapore Government.\n\nJustice@State Courts mobile app provides information on the hearing dates in the State Courts and other information services such as filling instructions, virtual tour of courtrooms and access to legal aid services for the convenience of public users via its user-friendly interface. The application is available across popular mobile platforms.\n",
      "appName": "Justice@State Courts",
      "releaseNotes": "-        New functionalities added.",
      "developerName": "State Courts Singapore",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.statecourts.mhearing",
      "currentVersionReleaseDate": "April 10, 2018",
      "userRatingCount": 13,
      "size": "5.1M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=State+Courts+Singapore",
      "averageUserRating": 4.3,
      "version": "2.3.7",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "com.statecourts.mhearing",
      "downloads": "1,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "Singapore Calendar Horse Lunar is a Calendar Singapore that showing all the characteristic of Singapore culture. It include all the Singapore national public holidays, Singapore school holidays and special event for all main race in Singapore. For example like Chinese New Year, Hari Raya and Deepavali.\n\nThis Horse Lunar Singapore Calendar is convenient and easy to use for your phone or tablet.\n\n[Features]\n- Show notification one day in advance for national public holidays.\n- Updated every year (currently 2019).\n- Setting for showing calendar in Grid View or List View.\n- Look clear even zoom in 600%.\n- Allow theme preferences.\n- Allow to zoom in and zoom out by two finger easily (Pinch).\n- Allow to slide to change month view easily.\n- Sort order features.\n- Hide extra features.\n(Option to show or hide extra info like Calendar Full Year Planner and All School Term Holidays)\n- New Add Event for reminder\n\n[Other Name]\n-新加坡跑马月历日历\n-Kalendar Kuda Singapore\n-Cuti Sekolah Singapore\n\nAny suggestion please feedback to us, we will make improvement and adjustment accordingly.\nThank you and have fun :D !\n\n[FAIR USE NOTICE]\nThis software may contain copyrighted material whose use has not been specifically authorized by the copyright owner. The Dow Accountability Network is making this article available in our efforts to advance the understanding of corporate accountability, human rights, labor rights, social and environmental justice issues. We believe that this constitutes a 'fair use' of the copyrighted material as provided for in section 107 of the U.S. Copyright Law. If you wish to use this copyrighted material for purposes of your own that go beyond 'fair use,' you must obtain permission from the copyright owner.\n\n[CONTENT DISCLAIMER]\nGG Studios does not warrant the accuracy, timeliness or completeness of the information contained on our Software. If you have a particular complaint about something you've found on this website, please contact us, We will remove such content from our software as soon as possible after we receive knowledge of any respective legal violations or infringement of rights by said information.\n\n[TERM OF USE]\nThis work is licensed under a Creative Common Attribution 2.0 Generic License.\n",
      "appName": "Singapore Calendar Horse 2019",
      "releaseNotes": "Updated calendar to 2019!",
      "developerName": "GG Studios",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.ggstudios.calendarsingaporehorse",
      "currentVersionReleaseDate": "November 6, 2018",
      "userRatingCount": 313,
      "size": "19M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=GG+Studios",
      "averageUserRating": 4.3,
      "version": "1.2.0",
      "minimumOsVersion": "4.1 and up",
      "bundleId": "com.ggstudios.calendarsingaporehorse",
      "downloads": "100,000+"
    },
    {
      "contentAdvisoryRating": "Rated for 3+",
      "description": "jobsDB is Singapore's leading job search app with vacancies and jobs sourced directly from job boards, company websites and other job finder app. With new jobs and vaccancy with every refresh, jobsDB is the best job seeking app for you to search for local jobs, part-time jobs, casual jobs, and job opportunities in Singapore. Make sure you don’t miss out this amazing job search app to get a job and career of your dreams – install jobsDB now, it's free.\n\nSearch \n- Simple and fast job search app for Singapore jobs and careers\n- A Singapore job portal with jobs across different industries\n- A job finder app that you can find work with keywords search, job title, company and location search (CBD, Woodlands, Yishun, Tampines, Hougang, etc.)\n- Refine your search by different job types (part-time jobs, casual jobs, freelance jobs, temporary jobs, full time jobs, casual jobs, local jobs and graduate jobs)\n- Save time by viewing only new vacancies and sg jobs since your last search\n\nPersonalise\n- We remember your recent career and vacancy searches\n- Seek for fresh jobs with every job search\n- Save or email your local jobs and Singapore jobs to yourself in the jobs app\n- Turn on alerts for your favourite work and jobs searches in our job finder app\n- Create a free account to access your saved jobs across all devices\n- Get the latest jobs and vacancy by email or push notifications\n\nApply \n- Fast job applications with Quick Apply\n",
      "appName": "jobsDB job search app - find jobs in Singapore",
      "releaseNotes": "Experience the new jobsDB. Now with more jobs in real time to give you greater choice. Previous jobsDB members, please create a NEW account to access all the features",
      "developerName": "Job Seeker Pty Ltd",
      "appViewUrl": "https://play.google.com/store/apps/details?id=com.jora.android.sgjobsdb",
      "currentVersionReleaseDate": "May 14, 2018",
      "userRatingCount": 82,
      "size": "5.5M",
      "developerViewUrl": "https://play.google.com/store/apps/developer?id=Job+Seeker+Pty+Ltd",
      "averageUserRating": 3.5,
      "version": "2.0.7",
      "minimumOsVersion": "5.0 and up",
      "bundleId": "com.jora.android.sgjobsdb",
      "downloads": "10,000+"
    }
  ]
}
